#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Tuto_Mannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Tuto_Mannequin.ABP_Tuto_Mannequin_C.AnimBlueprintGeneratedConstantData
// 0x02BF (0x02C0 - 0x0001)
struct ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_67;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_68;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_69;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_70;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_71;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_72;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_73;                                // 0x0038(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_74;                               // 0x0048(0x0020)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_75;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_76;                               // 0x006C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_77;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_78;                                 // 0x009C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_79;                                 // 0x009D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_80;                                 // 0x009E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_81;                                 // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;               // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;                // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0290(0x0030)()
};
static_assert(alignof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData) == 0x0002C0, "Wrong size on ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __NameProperty_67) == 0x000004, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__NameProperty_67' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __BlendProfile_68) == 0x000010, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__BlendProfile_68' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __CurveFloat_69) == 0x000018, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__CurveFloat_69' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __EnumProperty_70) == 0x000020, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__EnumProperty_70' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __EnumProperty_71) == 0x000021, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__EnumProperty_71' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __ArrayProperty_72) == 0x000028, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__ArrayProperty_72' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __ArrayProperty_73) == 0x000038, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__ArrayProperty_73' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __StructProperty_74) == 0x000048, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__StructProperty_74' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __FloatProperty_75) == 0x000068, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__FloatProperty_75' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __StructProperty_76) == 0x00006C, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__StructProperty_76' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __FloatProperty_77) == 0x000098, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__FloatProperty_77' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __BoolProperty_78) == 0x00009C, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__BoolProperty_78' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __EnumProperty_79) == 0x00009D, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__EnumProperty_79' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __ByteProperty_80) == 0x00009E, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__ByteProperty_80' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x0000A0, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000140, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x000170, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x0001A0, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0001D0, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000200, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000230, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum) == 0x000260, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000290, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");

// ScriptStruct ABP_Tuto_Mannequin.ABP_Tuto_Mannequin_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_Tuto_Mannequin::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_Tuto_Mannequin::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_Tuto_Mannequin::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Tuto_Mannequin::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'ABP_Tuto_Mannequin::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");

}

