#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Astronaut_Hands

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Astronaut_Hands.ABP_Astronaut_Hands_C.AnimBlueprintGeneratedConstantData
// 0x0677 (0x0678 - 0x0001)
struct ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_209;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_210;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_211;                               // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_212;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_213;                               // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_214;                               // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_215;                                // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_216;                                // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_217;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_218;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_219;                                  // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_220;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_221;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_222;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_223;                              // 0x0098(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_224;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_225;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_226;                              // 0x00C0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_227;                               // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_228;                                // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_229;                                // 0x00F1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_230;                                // 0x00F2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_231;                                // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0100(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0180(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;               // 0x01C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_8;              // 0x01F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;               // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                     // 0x0258(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;              // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;               // 0x02B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;              // 0x02E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;               // 0x0318(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0348(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;              // 0x0378(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;               // 0x03A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x03D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0408(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x0438(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0468(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;              // 0x0498(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;               // 0x04C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;              // 0x04F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x0528(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;              // 0x0558(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0588(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x05B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x05E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0618(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0648(0x0030)()
};
static_assert(alignof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData) == 0x000678, "Wrong size on ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __NameProperty_209) == 0x000004, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__NameProperty_209' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __ArrayProperty_210) == 0x000010, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__ArrayProperty_210' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __ArrayProperty_211) == 0x000020, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__ArrayProperty_211' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __EnumProperty_212) == 0x000030, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__EnumProperty_212' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __ArrayProperty_213) == 0x000038, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__ArrayProperty_213' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __ArrayProperty_214) == 0x000048, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__ArrayProperty_214' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __EnumProperty_215) == 0x000058, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__EnumProperty_215' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __EnumProperty_216) == 0x000059, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__EnumProperty_216' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __ArrayProperty_217) == 0x000060, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__ArrayProperty_217' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __BlendProfile_218) == 0x000070, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__BlendProfile_218' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __CurveFloat_219) == 0x000078, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__CurveFloat_219' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __EnumProperty_220) == 0x000080, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__EnumProperty_220' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __EnumProperty_221) == 0x000081, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__EnumProperty_221' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __ArrayProperty_222) == 0x000088, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__ArrayProperty_222' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __StructProperty_223) == 0x000098, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__StructProperty_223' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __BoolProperty_224) == 0x0000B8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__BoolProperty_224' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __FloatProperty_225) == 0x0000BC, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__FloatProperty_225' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __StructProperty_226) == 0x0000C0, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__StructProperty_226' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __FloatProperty_227) == 0x0000EC, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__FloatProperty_227' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __BoolProperty_228) == 0x0000F0, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__BoolProperty_228' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __EnumProperty_229) == 0x0000F1, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__EnumProperty_229' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __ByteProperty_230) == 0x0000F2, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__ByteProperty_230' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, __NameProperty_231) == 0x0000F4, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::__NameProperty_231' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000100, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000180, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000198, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_9) == 0x0001C8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_8) == 0x0001F8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_8' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_8) == 0x000228, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000258, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_7) == 0x000288, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_7) == 0x0002B8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_6) == 0x0002E8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_6) == 0x000318, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000348, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_5) == 0x000378, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_5) == 0x0003A8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x0003D8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000408, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000438, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000468, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_4) == 0x000498, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x0004C8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x0004F8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000528, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x000558, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000588, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x0005B8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0005E8, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000618, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000648, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");

// ScriptStruct ABP_Astronaut_Hands.ABP_Astronaut_Hands_C.AnimBlueprintGeneratedMutableData
// 0x001F (0x0020 - 0x0001)
struct ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0006(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_5;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_6;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData) == 0x000020, "Wrong size on ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000004, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000005, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __BoolProperty_4) == 0x000006, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__BoolProperty_4' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __ArrayProperty_5) == 0x000008, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__ArrayProperty_5' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __BoolProperty_6) == 0x000018, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__BoolProperty_6' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000019, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x00001A, "Member 'ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");

}

