#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Tuto_Mannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Tuto_Mannequin.ABP_Tuto_Mannequin_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Tuto_Mannequin_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Tuto_Mannequin_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Tuto_Mannequin_C_AnimGraph");
static_assert(sizeof(ABP_Tuto_Mannequin_C_AnimGraph) == 0x000010, "Wrong size on ABP_Tuto_Mannequin_C_AnimGraph");
static_assert(offsetof(ABP_Tuto_Mannequin_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Tuto_Mannequin_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Tuto_Mannequin.ABP_Tuto_Mannequin_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Tuto_Mannequin_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Tuto_Mannequin_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Tuto_Mannequin_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Tuto_Mannequin_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Tuto_Mannequin_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Tuto_Mannequin_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Tuto_Mannequin_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Tuto_Mannequin.ABP_Tuto_Mannequin_C.Draw Segment
// 0x0110 (0x0110 - 0x0000)
struct ABP_Tuto_Mannequin_C_Draw_Segment final
{
public:
	struct FVector                                From;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                To;                                                // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Start;                                             // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         End;                                               // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Thickness;                                         // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue_1;           // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Tuto_Mannequin_C_Draw_Segment) == 0x000008, "Wrong alignment on ABP_Tuto_Mannequin_C_Draw_Segment");
static_assert(sizeof(ABP_Tuto_Mannequin_C_Draw_Segment) == 0x000110, "Wrong size on ABP_Tuto_Mannequin_C_Draw_Segment");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, From) == 0x000000, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::From' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, To) == 0x000018, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::To' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, Start) == 0x000030, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::Start' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, End) == 0x000034, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::End' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, Color) == 0x000038, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::Color' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, Thickness) == 0x000048, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::Thickness' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, CallFunc_FindLookAtRotation_ReturnValue) == 0x000050, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, CallFunc_Conv_IntToVector_ReturnValue) == 0x000068, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, CallFunc_GetForwardVector_ReturnValue) == 0x000080, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, CallFunc_Conv_IntToVector_ReturnValue_1) == 0x000098, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::CallFunc_Conv_IntToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000B0, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_Draw_Segment, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000F8, "Member 'ABP_Tuto_Mannequin_C_Draw_Segment::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function ABP_Tuto_Mannequin.ABP_Tuto_Mannequin_C.ExecuteUbergraph_ABP_Tuto_Mannequin
// 0x0028 (0x0028 - 0x0000)
struct ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATuto_Mannequin_C*                      K2Node_DynamicCast_AsTuto_Mannequin;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin) == 0x000008, "Wrong alignment on ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin");
static_assert(sizeof(ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin) == 0x000028, "Wrong size on ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin");
static_assert(offsetof(ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin, EntryPoint) == 0x000000, "Member 'ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin, CallFunc_GetOwningActor_ReturnValue) == 0x000010, "Member 'ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin, K2Node_DynamicCast_AsTuto_Mannequin) == 0x000018, "Member 'ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin::K2Node_DynamicCast_AsTuto_Mannequin' has a wrong offset!");
static_assert(offsetof(ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_Tuto_Mannequin_C_ExecuteUbergraph_ABP_Tuto_Mannequin::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

