#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Astronaut_Body

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Astronaut_Body.ABP_Astronaut_Body_C.AnimBlueprintGeneratedConstantData
// 0x165F (0x1660 - 0x0001)
struct ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_785;                               // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_786;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_787;                               // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_788;                                // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_789;                               // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_790;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_791;                               // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_792;                               // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_793;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_794;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_795;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_796;                                  // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_797;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_798;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_799;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_800;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_801;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_802;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_803;                                 // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMirrorDataTable*                       __MirrorDataTable_804;                             // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_805;                                // 0x00E0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_806;                                // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_807;                                 // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_808;                                // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_809;                               // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_810;                              // 0x00F8(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_811;                               // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_812;                                // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_813;                                // 0x0129(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_814;                                // 0x012A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_815;                                // 0x012C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_816;                                // 0x0134(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_817;                                 // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_818;                              // 0x0140(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_819;                                // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_820;                                // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0170(0x0080)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x01F0(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0208(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;               // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_7;                // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;                    // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;                // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_2;             // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_10;             // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_9;              // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_34;              // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_33;              // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_8;              // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                // 0x0490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;              // 0x04C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;             // 0x04F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_32;              // 0x0520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;               // 0x0550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;              // 0x0580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_31;              // 0x05B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;              // 0x05E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x0610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;              // 0x0640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x06A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x06D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_30;              // 0x0700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;              // 0x0730(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_29;              // 0x0760(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_28;              // 0x0790(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_27;              // 0x07C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x07F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;              // 0x0820(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_26;              // 0x0850(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x0880(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_25;              // 0x08B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;             // 0x08E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;             // 0x0910(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_24;              // 0x0940(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0970(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_23;              // 0x09A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                  // 0x09D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0A00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                     // 0x0A30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x0A60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                 // 0x0A90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x0AC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x0AF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0B20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0B50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0B80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0BB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_22;              // 0x0BE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_21;      // 0x0C10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_21;              // 0x0C40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_20;      // 0x0C70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceGraph_1;              // 0x0CA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x0CD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mirror_2;                       // 0x0D00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_20;              // 0x0D30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_19;      // 0x0D60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_19;              // 0x0D90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_18;      // 0x0DC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;              // 0x0DF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_17;      // 0x0E20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;              // 0x0E50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_16;      // 0x0E80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;              // 0x0EB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_15;      // 0x0EE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;              // 0x0F10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_14;      // 0x0F40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;              // 0x0F70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_13;      // 0x0FA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;              // 0x0FD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_12;      // 0x1000(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mirror_1;                       // 0x1030(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;              // 0x1060(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_11;      // 0x1090(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;              // 0x10C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_10;      // 0x10F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;              // 0x1120(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_9;       // 0x1150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;               // 0x1180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_8;       // 0x11B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mirror;                         // 0x11E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;               // 0x1210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_7;       // 0x1240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;               // 0x1270(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_6;       // 0x12A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;               // 0x12D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_5;       // 0x1300(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;               // 0x1330(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_4;       // 0x1360(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;               // 0x1390(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_3;       // 0x13C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x13F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_2;       // 0x1420(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x1450(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult_1;       // 0x1480(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x14B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceSampleResult;         // 0x14E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceGraph;                // 0x1510(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x1540(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x1570(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x15A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x15D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x1600(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x1630(0x0030)()
};
static_assert(alignof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData) == 0x001660, "Wrong size on ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __ArrayProperty_785) == 0x000008, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__ArrayProperty_785' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __ArrayProperty_786) == 0x000018, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__ArrayProperty_786' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __ArrayProperty_787) == 0x000028, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__ArrayProperty_787' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __EnumProperty_788) == 0x000038, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__EnumProperty_788' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __ArrayProperty_789) == 0x000040, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__ArrayProperty_789' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __EnumProperty_790) == 0x000050, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__EnumProperty_790' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __ArrayProperty_791) == 0x000058, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__ArrayProperty_791' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __ArrayProperty_792) == 0x000068, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__ArrayProperty_792' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __ArrayProperty_793) == 0x000078, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__ArrayProperty_793' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __EnumProperty_794) == 0x000088, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__EnumProperty_794' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __BlendProfile_795) == 0x000090, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__BlendProfile_795' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __CurveFloat_796) == 0x000098, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__CurveFloat_796' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __EnumProperty_797) == 0x0000A0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__EnumProperty_797' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __EnumProperty_798) == 0x0000A1, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__EnumProperty_798' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __ArrayProperty_799) == 0x0000A8, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__ArrayProperty_799' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __NameProperty_800) == 0x0000B8, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__NameProperty_800' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __NameProperty_801) == 0x0000C0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__NameProperty_801' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __NameProperty_802) == 0x0000C8, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__NameProperty_802' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __IntProperty_803) == 0x0000D0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__IntProperty_803' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __MirrorDataTable_804) == 0x0000D8, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__MirrorDataTable_804' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __EnumProperty_805) == 0x0000E0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__EnumProperty_805' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __NameProperty_806) == 0x0000E4, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__NameProperty_806' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __IntProperty_807) == 0x0000EC, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__IntProperty_807' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __BoolProperty_808) == 0x0000F0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__BoolProperty_808' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __FloatProperty_809) == 0x0000F4, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__FloatProperty_809' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __StructProperty_810) == 0x0000F8, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__StructProperty_810' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __FloatProperty_811) == 0x000124, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__FloatProperty_811' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __BoolProperty_812) == 0x000128, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__BoolProperty_812' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __EnumProperty_813) == 0x000129, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__EnumProperty_813' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __ByteProperty_814) == 0x00012A, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__ByteProperty_814' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __NameProperty_815) == 0x00012C, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__NameProperty_815' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __NameProperty_816) == 0x000134, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__NameProperty_816' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __IntProperty_817) == 0x00013C, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__IntProperty_817' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __StructProperty_818) == 0x000140, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__StructProperty_818' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __NameProperty_819) == 0x000160, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__NameProperty_819' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, __NameProperty_820) == 0x000168, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::__NameProperty_820' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000170, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x0001F0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000208, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_3) == 0x000220, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_7) == 0x000250, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TwoWayBlend) == 0x000280, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_6) == 0x0002B0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_5) == 0x0002E0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend_2) == 0x000310, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_10) == 0x000340, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_10' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_9) == 0x000370, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_9' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_34) == 0x0003A0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_34' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_33) == 0x0003D0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_33' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_8) == 0x000400, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_8' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_4) == 0x000430, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x000460, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_3) == 0x000490, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_7) == 0x0004C0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend_1) == 0x0004F0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_32) == 0x000520, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_32' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_2) == 0x000550, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_6) == 0x000580, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_31) == 0x0005B0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_31' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_5) == 0x0005E0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x000610, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_4) == 0x000640, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000670, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x0006A0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x0006D0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_30) == 0x000700, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_30' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x000730, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_29) == 0x000760, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_29' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_28) == 0x000790, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_28' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_27) == 0x0007C0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_27' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x0007F0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x000820, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_26) == 0x000850, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_26' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000880, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_25) == 0x0008B0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_25' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_7) == 0x0008E0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_6) == 0x000910, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_24) == 0x000940, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_24' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000970, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_23) == 0x0009A0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_23' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x0009D0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000A00, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000A30, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000A60, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_1) == 0x000A90, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x000AC0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000AF0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000B20, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000B50, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000B80, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000BB0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_22) == 0x000BE0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_22' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_21) == 0x000C10, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_21' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_21) == 0x000C40, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_21' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_20) == 0x000C70, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_20' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceGraph_1) == 0x000CA0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceGraph_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000CD0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Mirror_2) == 0x000D00, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Mirror_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_20) == 0x000D30, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_20' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_19) == 0x000D60, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_19' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_19) == 0x000D90, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_19' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_18) == 0x000DC0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_18' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_18) == 0x000DF0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_17) == 0x000E20, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_17' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_17) == 0x000E50, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_16) == 0x000E80, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_16' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_16) == 0x000EB0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_15) == 0x000EE0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_15' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_15) == 0x000F10, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_14) == 0x000F40, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_14' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_14) == 0x000F70, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_13) == 0x000FA0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_13' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_13) == 0x000FD0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_12) == 0x001000, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_12' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Mirror_1) == 0x001030, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Mirror_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_12) == 0x001060, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_11) == 0x001090, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_11' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_11) == 0x0010C0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_10) == 0x0010F0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_10' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_10) == 0x001120, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_9) == 0x001150, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_9' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_9) == 0x001180, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_8) == 0x0011B0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_8' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Mirror) == 0x0011E0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Mirror' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_8) == 0x001210, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_7) == 0x001240, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_7' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_7) == 0x001270, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_6) == 0x0012A0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_6' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_6) == 0x0012D0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_5) == 0x001300, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_5' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_5) == 0x001330, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_4) == 0x001360, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_4' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x001390, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_3) == 0x0013C0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x0013F0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_2) == 0x001420, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x001450, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult_1) == 0x001480, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0014B0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceSampleResult) == 0x0014E0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceSampleResult' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceGraph) == 0x001510, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x001540, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x001570, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0015A0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0015D0, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x001600, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x001630, "Member 'ABP_Astronaut_Body::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct ABP_Astronaut_Body.ABP_Astronaut_Body_C.AnimBlueprintGeneratedMutableData
// 0x005B (0x005C - 0x0001)
struct ABP_Astronaut_Body::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0006(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0007(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x000A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
