#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Astronaut_Hands

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_Astronaut_Hands_structs.hpp"
#include "Enum_Corner_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Astronaut_Hands.ABP_Astronaut_Hands_C
// 0x0DE0 (0x11A0 - 0x03C0)
class UABP_Astronaut_Hands_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Astronaut_Hands::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;          // 0x03C8(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0418(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x0460(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x04A8(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x04F0(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x09D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0A18(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x0A60(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0AA8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0AF0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x0B38(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0B80(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0BC8(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0CB0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0D30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0D58(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0D80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0DC8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0E10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0E58(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0EA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0EE8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0F30(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0F78(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0FC0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1008(0x0048)()
	struct FVector                                __CustomProperty_Hands_Intensity_9FC680C54CC4CA5AF3F6B6A81530ABEE; // 0x1050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Main_Intensity_9FC680C54CC4CA5AF3F6B6A81530ABEE; // 0x1068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_Hands_Damping_9FC680C54CC4CA5AF3F6B6A81530ABEE; // 0x1070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_Hands_Strength_9FC680C54CC4CA5AF3F6B6A81530ABEE; // 0x1074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_Main_Damping_9FC680C54CC4CA5AF3F6B6A81530ABEE; // 0x1078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_Main_Strength_9FC680C54CC4CA5AF3F6B6A81530ABEE; // 0x107C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_Main_Rotation_9FC680C54CC4CA5AF3F6B6A81530ABEE; // 0x1080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_Axis_Target_9FC680C54CC4CA5AF3F6B6A81530ABEE; // 0x1098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Pointing;                                          // 0x10B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B9[0x7];                                     // 0x10B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Axis_Target;                                       // 0x10C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rotation_Target;                                   // 0x10D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Main_Strength;                                     // 0x10F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Main_Damping;                                      // 0x10F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Hands_Strength;                                    // 0x10F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Hands_Damping;                                     // 0x10FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hands_Intensity;                                   // 0x1100(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Main_Intensity;                                    // 0x1118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Item;                                              // 0x1130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1131[0x7];                                     // 0x1131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Item_Idle;                                         // 0x1138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Secondary;                                         // 0x1140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1141[0x7];                                     // 0x1141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Item_Inspect;                                      // 0x1148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_Player_C*                         Player_Data;                                       // 0x1150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Item_Move_Spring;                                  // 0x1158(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hand_Ratio;                                        // 0x1170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Item_Switching;                                    // 0x1178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HandsUp;                                           // 0x1179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Tablet;                                            // 0x117A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Run;                                               // 0x117B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_117C[0x4];                                     // 0x117C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Item_Run;                                          // 0x1180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Run_Recover;                                       // 0x1188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Corner;                                            // 0x1190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Try_Interaction;                                   // 0x1198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Astronaut_Hands_AnimGraphNode_BlendListByBool_A5141128454C0AC1C20B04A349E66514();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Astronaut_Hands_AnimGraphNode_BlendListByBool_E817F9BE41086EE32240E294F05545B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Astronaut_Hands_AnimGraphNode_ControlRig_9FC680C54CC4CA5AF3F6B6A81530ABEE();
	void ExecuteUbergraph_ABP_Astronaut_Hands(int32 EntryPoint);
	void Set_Hands_Move_Settings();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Astronaut_Hands_C">();
	}
	static class UABP_Astronaut_Hands_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Astronaut_Hands_C>();
	}
};
static_assert(alignof(UABP_Astronaut_Hands_C) == 0x000010, "Wrong alignment on UABP_Astronaut_Hands_C");
static_assert(sizeof(UABP_Astronaut_Hands_C) == 0x0011A0, "Wrong size on UABP_Astronaut_Hands_C");
static_assert(offsetof(UABP_Astronaut_Hands_C, UberGraphFrame) == 0x0003C0, "Member 'UABP_Astronaut_Hands_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, __AnimBlueprintMutables) == 0x0003C8, "Member 'UABP_Astronaut_Hands_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimBlueprintExtension_PropertyAccess) == 0x0003E8, "Member 'UABP_Astronaut_Hands_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimBlueprintExtension_Base) == 0x0003F0, "Member 'UABP_Astronaut_Hands_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_Root) == 0x0003F8, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer_9) == 0x000418, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_BlendListByBool_8) == 0x000460, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_BlendListByBool_8' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer_8) == 0x0004A8, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_ControlRig) == 0x0004F0, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_BlendListByBool_7) == 0x0009D0, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer_7) == 0x000A18, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_BlendListByBool_6) == 0x000A60, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer_6) == 0x000AA8, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_Slot) == 0x000AF0, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_BlendListByBool_5) == 0x000B38, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer_5) == 0x000B80, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_LayeredBoneBlend) == 0x000BC8, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SaveCachedPose) == 0x000CB0, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_UseCachedPose_1) == 0x000D30, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_UseCachedPose) == 0x000D58, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_BlendListByBool_4) == 0x000D80, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer_4) == 0x000DC8, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_BlendListByBool_3) == 0x000E10, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer_3) == 0x000E58, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_BlendListByBool_2) == 0x000EA0, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer_2) == 0x000EE8, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_BlendListByBool_1) == 0x000F30, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer_1) == 0x000F78, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_BlendListByBool) == 0x000FC0, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, AnimGraphNode_SequencePlayer) == 0x001008, "Member 'UABP_Astronaut_Hands_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, __CustomProperty_Hands_Intensity_9FC680C54CC4CA5AF3F6B6A81530ABEE) == 0x001050, "Member 'UABP_Astronaut_Hands_C::__CustomProperty_Hands_Intensity_9FC680C54CC4CA5AF3F6B6A81530ABEE' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, __CustomProperty_Main_Intensity_9FC680C54CC4CA5AF3F6B6A81530ABEE) == 0x001068, "Member 'UABP_Astronaut_Hands_C::__CustomProperty_Main_Intensity_9FC680C54CC4CA5AF3F6B6A81530ABEE' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, __CustomProperty_Hands_Damping_9FC680C54CC4CA5AF3F6B6A81530ABEE) == 0x001070, "Member 'UABP_Astronaut_Hands_C::__CustomProperty_Hands_Damping_9FC680C54CC4CA5AF3F6B6A81530ABEE' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, __CustomProperty_Hands_Strength_9FC680C54CC4CA5AF3F6B6A81530ABEE) == 0x001074, "Member 'UABP_Astronaut_Hands_C::__CustomProperty_Hands_Strength_9FC680C54CC4CA5AF3F6B6A81530ABEE' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, __CustomProperty_Main_Damping_9FC680C54CC4CA5AF3F6B6A81530ABEE) == 0x001078, "Member 'UABP_Astronaut_Hands_C::__CustomProperty_Main_Damping_9FC680C54CC4CA5AF3F6B6A81530ABEE' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, __CustomProperty_Main_Strength_9FC680C54CC4CA5AF3F6B6A81530ABEE) == 0x00107C, "Member 'UABP_Astronaut_Hands_C::__CustomProperty_Main_Strength_9FC680C54CC4CA5AF3F6B6A81530ABEE' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, __CustomProperty_Main_Rotation_9FC680C54CC4CA5AF3F6B6A81530ABEE) == 0x001080, "Member 'UABP_Astronaut_Hands_C::__CustomProperty_Main_Rotation_9FC680C54CC4CA5AF3F6B6A81530ABEE' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, __CustomProperty_Axis_Target_9FC680C54CC4CA5AF3F6B6A81530ABEE) == 0x001098, "Member 'UABP_Astronaut_Hands_C::__CustomProperty_Axis_Target_9FC680C54CC4CA5AF3F6B6A81530ABEE' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Mec_Ref) == 0x0010B0, "Member 'UABP_Astronaut_Hands_C::Mec_Ref' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Pointing) == 0x0010B8, "Member 'UABP_Astronaut_Hands_C::Pointing' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Axis_Target) == 0x0010C0, "Member 'UABP_Astronaut_Hands_C::Axis_Target' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Rotation_Target) == 0x0010D8, "Member 'UABP_Astronaut_Hands_C::Rotation_Target' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Main_Strength) == 0x0010F0, "Member 'UABP_Astronaut_Hands_C::Main_Strength' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Main_Damping) == 0x0010F4, "Member 'UABP_Astronaut_Hands_C::Main_Damping' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Hands_Strength) == 0x0010F8, "Member 'UABP_Astronaut_Hands_C::Hands_Strength' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Hands_Damping) == 0x0010FC, "Member 'UABP_Astronaut_Hands_C::Hands_Damping' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Hands_Intensity) == 0x001100, "Member 'UABP_Astronaut_Hands_C::Hands_Intensity' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Main_Intensity) == 0x001118, "Member 'UABP_Astronaut_Hands_C::Main_Intensity' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Item) == 0x001130, "Member 'UABP_Astronaut_Hands_C::Item' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Item_Idle) == 0x001138, "Member 'UABP_Astronaut_Hands_C::Item_Idle' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Secondary) == 0x001140, "Member 'UABP_Astronaut_Hands_C::Secondary' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Item_Inspect) == 0x001148, "Member 'UABP_Astronaut_Hands_C::Item_Inspect' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Player_Data) == 0x001150, "Member 'UABP_Astronaut_Hands_C::Player_Data' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Item_Move_Spring) == 0x001158, "Member 'UABP_Astronaut_Hands_C::Item_Move_Spring' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Hand_Ratio) == 0x001170, "Member 'UABP_Astronaut_Hands_C::Hand_Ratio' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Item_Switching) == 0x001178, "Member 'UABP_Astronaut_Hands_C::Item_Switching' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, HandsUp) == 0x001179, "Member 'UABP_Astronaut_Hands_C::HandsUp' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Tablet) == 0x00117A, "Member 'UABP_Astronaut_Hands_C::Tablet' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Run) == 0x00117B, "Member 'UABP_Astronaut_Hands_C::Run' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Item_Run) == 0x001180, "Member 'UABP_Astronaut_Hands_C::Item_Run' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Run_Recover) == 0x001188, "Member 'UABP_Astronaut_Hands_C::Run_Recover' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Corner) == 0x001190, "Member 'UABP_Astronaut_Hands_C::Corner' has a wrong offset!");
static_assert(offsetof(UABP_Astronaut_Hands_C, Try_Interaction) == 0x001198, "Member 'UABP_Astronaut_Hands_C::Try_Interaction' has a wrong offset!");

}

