#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlarmSpeaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AlarmSpeaker.AlarmSpeaker_C
// 0x0040 (0x02E8 - 0x02A8)
class AAlarmSpeaker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio_Wall;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Standard;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SoundPath;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ASoundPath_C*                           Sound_Path;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Sound_Ref;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AlarmSpeaker(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Set_Alarm(bool Activate);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AlarmSpeaker_C">();
	}
	static class AAlarmSpeaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAlarmSpeaker_C>();
	}
};
static_assert(alignof(AAlarmSpeaker_C) == 0x000008, "Wrong alignment on AAlarmSpeaker_C");
static_assert(sizeof(AAlarmSpeaker_C) == 0x0002E8, "Wrong size on AAlarmSpeaker_C");
static_assert(offsetof(AAlarmSpeaker_C, UberGraphFrame) == 0x0002A8, "Member 'AAlarmSpeaker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAlarmSpeaker_C, Audio_Wall) == 0x0002B0, "Member 'AAlarmSpeaker_C::Audio_Wall' has a wrong offset!");
static_assert(offsetof(AAlarmSpeaker_C, Audio_Standard) == 0x0002B8, "Member 'AAlarmSpeaker_C::Audio_Standard' has a wrong offset!");
static_assert(offsetof(AAlarmSpeaker_C, C_SoundPath) == 0x0002C0, "Member 'AAlarmSpeaker_C::C_SoundPath' has a wrong offset!");
static_assert(offsetof(AAlarmSpeaker_C, Cube) == 0x0002C8, "Member 'AAlarmSpeaker_C::Cube' has a wrong offset!");
static_assert(offsetof(AAlarmSpeaker_C, Root) == 0x0002D0, "Member 'AAlarmSpeaker_C::Root' has a wrong offset!");
static_assert(offsetof(AAlarmSpeaker_C, Sound_Path) == 0x0002D8, "Member 'AAlarmSpeaker_C::Sound_Path' has a wrong offset!");
static_assert(offsetof(AAlarmSpeaker_C, Sound_Ref) == 0x0002E0, "Member 'AAlarmSpeaker_C::Sound_Ref' has a wrong offset!");

}

