#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlarmButton

#include "Basic.hpp"

#include "E_AlarmState_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_Sectors_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AlarmButton.AlarmButton_C
// 0x0070 (0x0318 - 0x02A8)
class AAlarmButton_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   C_Fuse;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_Button;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Sector;                                            // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              Button;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_AlarmState                                  State;                                             // 0x02E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAlarmSpeaker_C*>                Speakers;                                          // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AItemSlot_C*                            Fuse;                                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           Materials;                                         // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__AlarmButton_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature(class AMec_C* Source);
	void BndEvt__AlarmButton_Fuse_K2Node_ComponentBoundEvent_1_Place_Item__DelegateSignature();
	void BndEvt__AlarmButton_Fuse_K2Node_ComponentBoundEvent_2_Take_Item__DelegateSignature();
	void Clear();
	void ExecuteUbergraph_AlarmButton(int32 EntryPoint);
	void OnRep_State();
	void ReceiveBeginPlay();
	void Set_Ready();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AlarmButton_C">();
	}
	static class AAlarmButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAlarmButton_C>();
	}
};
static_assert(alignof(AAlarmButton_C) == 0x000008, "Wrong alignment on AAlarmButton_C");
static_assert(sizeof(AAlarmButton_C) == 0x000318, "Wrong size on AAlarmButton_C");
static_assert(offsetof(AAlarmButton_C, UberGraphFrame) == 0x0002A8, "Member 'AAlarmButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, C_Fuse) == 0x0002B0, "Member 'AAlarmButton_C::C_Fuse' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, Cube) == 0x0002B8, "Member 'AAlarmButton_C::Cube' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, C_Button) == 0x0002C0, "Member 'AAlarmButton_C::C_Button' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, Root) == 0x0002C8, "Member 'AAlarmButton_C::Root' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, Sector) == 0x0002D0, "Member 'AAlarmButton_C::Sector' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, Button) == 0x0002D8, "Member 'AAlarmButton_C::Button' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, State) == 0x0002E0, "Member 'AAlarmButton_C::State' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, Speakers) == 0x0002E8, "Member 'AAlarmButton_C::Speakers' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, Fuse) == 0x0002F8, "Member 'AAlarmButton_C::Fuse' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, GM_Ref) == 0x000300, "Member 'AAlarmButton_C::GM_Ref' has a wrong offset!");
static_assert(offsetof(AAlarmButton_C, Materials) == 0x000308, "Member 'AAlarmButton_C::Materials' has a wrong offset!");

}

