#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlarmSpeaker

#include "Basic.hpp"


namespace SDK::Params
{

// Function AlarmSpeaker.AlarmSpeaker_C.ExecuteUbergraph_AlarmSpeaker
// 0x0008 (0x0008 - 0x0000)
struct AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Activate;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker) == 0x000004, "Wrong alignment on AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker");
static_assert(sizeof(AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker) == 0x000008, "Wrong size on AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker");
static_assert(offsetof(AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker, EntryPoint) == 0x000000, "Member 'AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker::EntryPoint' has a wrong offset!");
static_assert(offsetof(AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker, K2Node_CustomEvent_Activate) == 0x000004, "Member 'AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker::K2Node_CustomEvent_Activate' has a wrong offset!");
static_assert(offsetof(AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000005, "Member 'AlarmSpeaker_C_ExecuteUbergraph_AlarmSpeaker::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function AlarmSpeaker.AlarmSpeaker_C.Set Alarm
// 0x0001 (0x0001 - 0x0000)
struct AlarmSpeaker_C_Set_Alarm final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AlarmSpeaker_C_Set_Alarm) == 0x000001, "Wrong alignment on AlarmSpeaker_C_Set_Alarm");
static_assert(sizeof(AlarmSpeaker_C_Set_Alarm) == 0x000001, "Wrong size on AlarmSpeaker_C_Set_Alarm");
static_assert(offsetof(AlarmSpeaker_C_Set_Alarm, Activate) == 0x000000, "Member 'AlarmSpeaker_C_Set_Alarm::Activate' has a wrong offset!");

// Function AlarmSpeaker.AlarmSpeaker_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct AlarmSpeaker_C_UserConstructionScript final
{
public:
	class ASoundPath_C*                           K2Node_DynamicCast_AsSound_Path;                   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AlarmSpeaker_C_UserConstructionScript) == 0x000008, "Wrong alignment on AlarmSpeaker_C_UserConstructionScript");
static_assert(sizeof(AlarmSpeaker_C_UserConstructionScript) == 0x000010, "Wrong size on AlarmSpeaker_C_UserConstructionScript");
static_assert(offsetof(AlarmSpeaker_C_UserConstructionScript, K2Node_DynamicCast_AsSound_Path) == 0x000000, "Member 'AlarmSpeaker_C_UserConstructionScript::K2Node_DynamicCast_AsSound_Path' has a wrong offset!");
static_assert(offsetof(AlarmSpeaker_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'AlarmSpeaker_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

