#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Analysis_PC

#include "Basic.hpp"

#include "E_ItemType_structs.hpp"
#include "Str_ItemState_structs.hpp"
#include "E_AnalysisPC_State_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Analysis_PC.Analysis_PC_C.All Set State
// 0x0001 (0x0001 - 0x0000)
struct Analysis_PC_C_All_Set_State final
{
public:
	E_AnalysisPC_State                            State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_All_Set_State) == 0x000001, "Wrong alignment on Analysis_PC_C_All_Set_State");
static_assert(sizeof(Analysis_PC_C_All_Set_State) == 0x000001, "Wrong size on Analysis_PC_C_All_Set_State");
static_assert(offsetof(Analysis_PC_C_All_Set_State, State_0) == 0x000000, "Member 'Analysis_PC_C_All_Set_State::State_0' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.BndEvt__Analysis_PC_Button_K2Node_ComponentBoundEvent_0_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Analysis_PC_C_BndEvt__Analysis_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_BndEvt__Analysis_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on Analysis_PC_C_BndEvt__Analysis_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(sizeof(Analysis_PC_C_BndEvt__Analysis_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong size on Analysis_PC_C_BndEvt__Analysis_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(offsetof(Analysis_PC_C_BndEvt__Analysis_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'Analysis_PC_C_BndEvt__Analysis_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Check Ingredients
// 0x0030 (0x0030 - 0x0000)
struct Analysis_PC_C_Check_Ingredients final
{
public:
	bool                                          Finish;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Count;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          All;                                               // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_Check_Ingredients) == 0x000004, "Wrong alignment on Analysis_PC_C_Check_Ingredients");
static_assert(sizeof(Analysis_PC_C_Check_Ingredients) == 0x000030, "Wrong size on Analysis_PC_C_Check_Ingredients");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, Finish) == 0x000000, "Member 'Analysis_PC_C_Check_Ingredients::Finish' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, Count) == 0x000004, "Member 'Analysis_PC_C_Check_Ingredients::Count' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, _Count) == 0x000008, "Member 'Analysis_PC_C_Check_Ingredients::_Count' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, All) == 0x00000C, "Member 'Analysis_PC_C_Check_Ingredients::All' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Analysis_PC_C_Check_Ingredients::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Analysis_PC_C_Check_Ingredients::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Analysis_PC_C_Check_Ingredients::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, Temp_int_Variable) == 0x00001C, "Member 'Analysis_PC_C_Check_Ingredients::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Analysis_PC_C_Check_Ingredients::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'Analysis_PC_C_Check_Ingredients::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'Analysis_PC_C_Check_Ingredients::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, CallFunc_Array_Get_Item) == 0x00002C, "Member 'Analysis_PC_C_Check_Ingredients::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Check_Ingredients, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'Analysis_PC_C_Check_Ingredients::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Check Result
// 0x0008 (0x0008 - 0x0000)
struct Analysis_PC_C_Check_Result final
{
public:
	struct FStr_ItemState                         Result;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_Check_Result) == 0x000004, "Wrong alignment on Analysis_PC_C_Check_Result");
static_assert(sizeof(Analysis_PC_C_Check_Result) == 0x000008, "Wrong size on Analysis_PC_C_Check_Result");
static_assert(offsetof(Analysis_PC_C_Check_Result, Result) == 0x000000, "Member 'Analysis_PC_C_Check_Result::Result' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Create List
// 0x0020 (0x0020 - 0x0000)
struct Analysis_PC_C_Create_List final
{
public:
	TArray<struct FStr_ItemState>                 Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<bool>                                  List;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Analysis_PC_C_Create_List) == 0x000008, "Wrong alignment on Analysis_PC_C_Create_List");
static_assert(sizeof(Analysis_PC_C_Create_List) == 0x000020, "Wrong size on Analysis_PC_C_Create_List");
static_assert(offsetof(Analysis_PC_C_Create_List, Results) == 0x000000, "Member 'Analysis_PC_C_Create_List::Results' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Create_List, List) == 0x000010, "Member 'Analysis_PC_C_Create_List::List' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.ExecuteUbergraph_Analysis_PC
// 0x0168 (0x0168 - 0x0000)
struct Analysis_PC_C_ExecuteUbergraph_Analysis_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_AnalysisPC_UI_C*                     K2Node_DynamicCast_AsW_Analysis_PC_UI;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_List_Size_1;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_CustomEvent_Result;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemState>                 K2Node_CustomEvent_Results;                        // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	TArray<bool>                                  K2Node_CustomEvent_List_1;                         // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	TArray<bool>                                  K2Node_CustomEvent_List;                           // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Ingredients_Finish;                 // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Check_Ingredients_Count;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_List_Size;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         CallFunc_Generate_Item_State_ReturnValue;          // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0148(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AnalysisPC_State                            K2Node_CustomEvent_State_1;                        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AnalysisPC_State                            K2Node_CustomEvent_State;                          // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC) == 0x000008, "Wrong alignment on Analysis_PC_C_ExecuteUbergraph_Analysis_PC");
static_assert(sizeof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC) == 0x000168, "Wrong size on Analysis_PC_C_ExecuteUbergraph_Analysis_PC");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, EntryPoint) == 0x000000, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::EntryPoint' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_MakeStruct_Str_ItemState) == 0x000004, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_Event_Index_2) == 0x000010, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_Event_Source_2) == 0x000018, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_Event_Item_State_2) == 0x000020, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_Event_Index_1) == 0x000028, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_Event_Source_1) == 0x000030, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_Event_Item_State_1) == 0x000038, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_Event_Index) == 0x000040, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_Event_Source) == 0x000048, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_Event_Item_State) == 0x000050, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_HasAuthority_ReturnValue) == 0x000058, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_GetWidget_ReturnValue) == 0x000060, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_DynamicCast_AsW_Analysis_PC_UI) == 0x000068, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_DynamicCast_AsW_Analysis_PC_UI' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CustomEvent_List_Size_1) == 0x000074, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CustomEvent_List_Size_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Clamp_ReturnValue) == 0x000078, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CustomEvent_Result) == 0x000080, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Array_Contains_ReturnValue) == 0x000088, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Array_Find_ReturnValue) == 0x00008C, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, Temp_bool_Variable) == 0x000090, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Array_Contains_ReturnValue_1) == 0x000091, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Array_Add_ReturnValue) == 0x000094, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Array_Add_ReturnValue_1) == 0x00009C, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CustomEvent_Results) == 0x0000A8, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CustomEvent_List_1) == 0x0000B8, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CustomEvent_List_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CustomEvent_List) == 0x0000C8, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CustomEvent_List' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Greater_IntInt_ReturnValue) == 0x0000DC, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Check_Ingredients_Finish) == 0x0000DD, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Check_Ingredients_Finish' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Check_Ingredients_Count) == 0x0000E0, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Check_Ingredients_Count' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E4, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Clamp_ReturnValue_1) == 0x0000E8, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_ComponentBoundEvent_Source) == 0x0000F0, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_ComponentBoundEvent_Source' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CustomEvent_List_Size) == 0x0000F8, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CustomEvent_List_Size' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_GetGameMode_ReturnValue) == 0x000100, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CreateDelegate_OutputDelegate) == 0x000108, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_DynamicCast_AsGM) == 0x000118, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000121, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000122, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Generate_Item_State_ReturnValue) == 0x000124, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Generate_Item_State_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00012C, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000140, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, Temp_bool_Variable_1) == 0x000148, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000149, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00014A, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_SelectInt_ReturnValue) == 0x00014C, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CustomEvent_State_1) == 0x000150, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CustomEvent_State_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_SelectInt_ReturnValue_1) == 0x000154, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Add_IntInt_ReturnValue_2) == 0x000158, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_SwitchEnum_CmpSuccess_1) == 0x00015C, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, K2Node_CustomEvent_State) == 0x00015D, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_ExecuteUbergraph_Analysis_PC, CallFunc_Array_Length_ReturnValue_2) == 0x000160, "Member 'Analysis_PC_C_ExecuteUbergraph_Analysis_PC::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Generate Item State
// 0x008C (0x008C - 0x0000)
struct Analysis_PC_C_Generate_Item_State final
{
public:
	bool                                          NoDebuff;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemType                                    Type;                                              // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemType                                    Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemType                                    Temp_byte_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_12;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_18;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_20;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemType                                    Temp_byte_Variable_2;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemType                                    Temp_byte_Variable_3;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemType                                    Temp_byte_Variable_4;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemType                                    Temp_byte_Variable_5;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemType                                    Temp_byte_Variable_6;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ItemType                                    K2Node_Select_Default_2;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_Generate_Item_State) == 0x000004, "Wrong alignment on Analysis_PC_C_Generate_Item_State");
static_assert(sizeof(Analysis_PC_C_Generate_Item_State) == 0x00008C, "Wrong size on Analysis_PC_C_Generate_Item_State");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, NoDebuff) == 0x000000, "Member 'Analysis_PC_C_Generate_Item_State::NoDebuff' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, ReturnValue) == 0x000004, "Member 'Analysis_PC_C_Generate_Item_State::ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Type) == 0x00000C, "Member 'Analysis_PC_C_Generate_Item_State::Type' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_byte_Variable) == 0x00000D, "Member 'Analysis_PC_C_Generate_Item_State::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable) == 0x000010, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_1) == 0x000014, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_2) == 0x000018, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_3) == 0x00001C, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_4) == 0x000020, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_5) == 0x000024, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_6) == 0x000028, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_7) == 0x00002C, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_8) == 0x000030, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_9) == 0x000034, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_10) == 0x000038, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_11) == 0x00003C, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_byte_Variable_1) == 0x000040, "Member 'Analysis_PC_C_Generate_Item_State::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_12) == 0x000044, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_13) == 0x000048, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_14) == 0x00004C, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_15) == 0x000050, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_15' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_16) == 0x000054, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_16' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_17) == 0x000058, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_17' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_18) == 0x00005C, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_18' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_19) == 0x000060, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_19' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_int_Variable_20) == 0x000064, "Member 'Analysis_PC_C_Generate_Item_State::Temp_int_Variable_20' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_byte_Variable_2) == 0x000068, "Member 'Analysis_PC_C_Generate_Item_State::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_byte_Variable_3) == 0x000069, "Member 'Analysis_PC_C_Generate_Item_State::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_byte_Variable_4) == 0x00006A, "Member 'Analysis_PC_C_Generate_Item_State::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_byte_Variable_5) == 0x00006B, "Member 'Analysis_PC_C_Generate_Item_State::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, Temp_byte_Variable_6) == 0x00006C, "Member 'Analysis_PC_C_Generate_Item_State::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, CallFunc_RandomBool_ReturnValue) == 0x00006D, "Member 'Analysis_PC_C_Generate_Item_State::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, CallFunc_BooleanOR_ReturnValue) == 0x00006E, "Member 'Analysis_PC_C_Generate_Item_State::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, CallFunc_SelectInt_ReturnValue) == 0x000070, "Member 'Analysis_PC_C_Generate_Item_State::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, K2Node_Select_Default) == 0x000074, "Member 'Analysis_PC_C_Generate_Item_State::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000078, "Member 'Analysis_PC_C_Generate_Item_State::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, K2Node_Select_Default_1) == 0x00007C, "Member 'Analysis_PC_C_Generate_Item_State::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, K2Node_MakeStruct_Str_ItemState) == 0x000080, "Member 'Analysis_PC_C_Generate_Item_State::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Generate_Item_State, K2Node_Select_Default_2) == 0x000088, "Member 'Analysis_PC_C_Generate_Item_State::K2Node_Select_Default_2' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Generate List
// 0x0004 (0x0004 - 0x0000)
struct Analysis_PC_C_Generate_List final
{
public:
	int32                                         List_Size_0;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_Generate_List) == 0x000004, "Wrong alignment on Analysis_PC_C_Generate_List");
static_assert(sizeof(Analysis_PC_C_Generate_List) == 0x000004, "Wrong size on Analysis_PC_C_Generate_List");
static_assert(offsetof(Analysis_PC_C_Generate_List, List_Size_0) == 0x000000, "Member 'Analysis_PC_C_Generate_List::List_Size_0' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct Analysis_PC_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_Get_Key) == 0x000008, "Wrong alignment on Analysis_PC_C_Get_Key");
static_assert(sizeof(Analysis_PC_C_Get_Key) == 0x000008, "Wrong size on Analysis_PC_C_Get_Key");
static_assert(offsetof(Analysis_PC_C_Get_Key, Key) == 0x000000, "Member 'Analysis_PC_C_Get_Key::Key' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct Analysis_PC_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_Get_Name) == 0x000008, "Wrong alignment on Analysis_PC_C_Get_Name");
static_assert(sizeof(Analysis_PC_C_Get_Name) == 0x000018, "Wrong size on Analysis_PC_C_Get_Name");
static_assert(offsetof(Analysis_PC_C_Get_Name, Mec) == 0x000000, "Member 'Analysis_PC_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Get_Name, Name_0) == 0x000008, "Member 'Analysis_PC_C_Get_Name::Name_0' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct Analysis_PC_C_Local_Interaction final
{
public:
	int32                                         Param_Index_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State_0;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_Local_Interaction) == 0x000008, "Wrong alignment on Analysis_PC_C_Local_Interaction");
static_assert(sizeof(Analysis_PC_C_Local_Interaction) == 0x000018, "Wrong size on Analysis_PC_C_Local_Interaction");
static_assert(offsetof(Analysis_PC_C_Local_Interaction, Param_Index_0) == 0x000000, "Member 'Analysis_PC_C_Local_Interaction::Param_Index_0' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Local_Interaction, Source) == 0x000008, "Member 'Analysis_PC_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Local_Interaction, Item_State_0) == 0x000010, "Member 'Analysis_PC_C_Local_Interaction::Item_State_0' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct Analysis_PC_C_Net_Interaction final
{
public:
	int32                                         Param_Index_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State_0;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_Net_Interaction) == 0x000008, "Wrong alignment on Analysis_PC_C_Net_Interaction");
static_assert(sizeof(Analysis_PC_C_Net_Interaction) == 0x000018, "Wrong size on Analysis_PC_C_Net_Interaction");
static_assert(offsetof(Analysis_PC_C_Net_Interaction, Param_Index_0) == 0x000000, "Member 'Analysis_PC_C_Net_Interaction::Param_Index_0' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Net_Interaction, Source) == 0x000008, "Member 'Analysis_PC_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_Net_Interaction, Item_State_0) == 0x000010, "Member 'Analysis_PC_C_Net_Interaction::Item_State_0' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.OnRep_State
// 0x0010 (0x0010 - 0x0000)
struct Analysis_PC_C_OnRep_State final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Analysis_PC_C_OnRep_State) == 0x000004, "Wrong alignment on Analysis_PC_C_OnRep_State");
static_assert(sizeof(Analysis_PC_C_OnRep_State) == 0x000010, "Wrong size on Analysis_PC_C_OnRep_State");
static_assert(offsetof(Analysis_PC_C_OnRep_State, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'Analysis_PC_C_OnRep_State::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_OnRep_State, K2Node_MakeStruct_Str_ItemState) == 0x000004, "Member 'Analysis_PC_C_OnRep_State::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(Analysis_PC_C_OnRep_State, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'Analysis_PC_C_OnRep_State::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Analysis_PC.Analysis_PC_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct Analysis_PC_C_Other_Interaction final
{
public:
