#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_C4Blast_FX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_C4Blast_FX.BP_C4Blast_FX_C
// 0x0080 (0x0328 - 0x02A8)
class ABP_C4Blast_FX_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Smoke;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   yellow;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Red;                                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Timeline_NewTrack_5_06E3389C4E24A4786D4E7C88C2F387C5; // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Timeline_Scales_06E3389C4E24A4786D4E7C88C2F387C5;  // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_06E3389C4E24A4786D4E7C88C2F387C5; // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Opacity;                                           // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blast_state;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_C4Blast_FX(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_C4Blast_FX_C">();
	}
	static class ABP_C4Blast_FX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_C4Blast_FX_C>();
	}
};
static_assert(alignof(ABP_C4Blast_FX_C) == 0x000008, "Wrong alignment on ABP_C4Blast_FX_C");
static_assert(sizeof(ABP_C4Blast_FX_C) == 0x000328, "Wrong size on ABP_C4Blast_FX_C");
static_assert(offsetof(ABP_C4Blast_FX_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_C4Blast_FX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, PointLight) == 0x0002B0, "Member 'ABP_C4Blast_FX_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, Smoke) == 0x0002B8, "Member 'ABP_C4Blast_FX_C::Smoke' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, yellow) == 0x0002C0, "Member 'ABP_C4Blast_FX_C::yellow' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, Red) == 0x0002C8, "Member 'ABP_C4Blast_FX_C::Red' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_C4Blast_FX_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, Timeline_NewTrack_5_06E3389C4E24A4786D4E7C88C2F387C5) == 0x0002D8, "Member 'ABP_C4Blast_FX_C::Timeline_NewTrack_5_06E3389C4E24A4786D4E7C88C2F387C5' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, Timeline_Scales_06E3389C4E24A4786D4E7C88C2F387C5) == 0x0002F0, "Member 'ABP_C4Blast_FX_C::Timeline_Scales_06E3389C4E24A4786D4E7C88C2F387C5' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, Timeline__Direction_06E3389C4E24A4786D4E7C88C2F387C5) == 0x000308, "Member 'ABP_C4Blast_FX_C::Timeline__Direction_06E3389C4E24A4786D4E7C88C2F387C5' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, Timeline) == 0x000310, "Member 'ABP_C4Blast_FX_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, Opacity) == 0x000318, "Member 'ABP_C4Blast_FX_C::Opacity' has a wrong offset!");
static_assert(offsetof(ABP_C4Blast_FX_C, Blast_state) == 0x000320, "Member 'ABP_C4Blast_FX_C::Blast_state' has a wrong offset!");

}

