#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletImpact

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BulletImpact.BulletImpact_C.ExecuteUbergraph_BulletImpact
// 0x0310 (0x0310 - 0x0000)
struct BulletImpact_C_ExecuteUbergraph_BulletImpact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Power_sign__Returne_Value;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Power_sign__Returne_Value_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Power_sign__Returne_Value_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Power_sign__Returne_Value_3;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_3;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0240(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASoundPath_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance;                        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location;                        // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Power_sign__Base_ImplicitCast;            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Power_sign__Base_ImplicitCast_1;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Power_sign__Base_ImplicitCast_2;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Power_sign__Base_ImplicitCast_3;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletImpact_C_ExecuteUbergraph_BulletImpact) == 0x000010, "Wrong alignment on BulletImpact_C_ExecuteUbergraph_BulletImpact");
static_assert(sizeof(BulletImpact_C_ExecuteUbergraph_BulletImpact) == 0x000310, "Wrong size on BulletImpact_C_ExecuteUbergraph_BulletImpact");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, EntryPoint) == 0x000000, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Power_sign__Returne_Value) == 0x000008, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Power_sign__Returne_Value' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Power_sign__Returne_Value_1) == 0x000010, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Power_sign__Returne_Value_1' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Power_sign__Returne_Value_2) == 0x000020, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Power_sign__Returne_Value_2' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Power_sign__Returne_Value_3) == 0x000028, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Power_sign__Returne_Value_3' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Lerp_ReturnValue_1) == 0x000030, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_int_Variable) == 0x000038, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_struct_Variable) == 0x00003C, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_struct_Variable_1) == 0x00004C, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_struct_Variable_2) == 0x00005C, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_struct_Variable_3) == 0x00006C, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_int_Variable_1) == 0x00007C, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_struct_Variable_4) == 0x000080, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_struct_Variable_5) == 0x000090, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_struct_Variable_6) == 0x0000A0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_struct_Variable_7) == 0x0000B0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_int_Variable_2) == 0x0000C0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_real_Variable) == 0x0000C8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_real_Variable_1) == 0x0000D0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_real_Variable_2) == 0x0000D8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_real_Variable_3) == 0x0000E0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_int_Variable_3) == 0x0000E8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_object_Variable) == 0x0000F0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_object_Variable_1) == 0x0000F8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_object_Variable_2) == 0x000100, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, Temp_object_Variable_3) == 0x000108, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, K2Node_Select_Default) == 0x000110, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000118, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, K2Node_Select_Default_1) == 0x000120, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, K2Node_Select_Default_2) == 0x000130, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_LinearColorLerp_ReturnValue) == 0x000140, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_GetPlayerPawn_ReturnValue) == 0x000150, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, K2Node_DynamicCast_AsMec) == 0x000158, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, K2Node_Select_Default_3) == 0x000168, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000170, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000188, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Vector_Distance_ReturnValue) == 0x0001A0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001A8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Lerp_ReturnValue_2) == 0x0001B0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0001B8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_VLerp_ReturnValue) == 0x0001D0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001E8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000200, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000218, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000220, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_MakeTransform_ReturnValue) == 0x000240, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002A0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002A8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Get_Path_Distance) == 0x0002B0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Get_Path_Distance' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Get_Path_Location) == 0x0002B8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Get_Path_Location' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0002D0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Power_sign__Base_ImplicitCast) == 0x0002D8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Power_sign__Base_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Power_sign__Base_ImplicitCast_1) == 0x0002E0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Power_sign__Base_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Power_sign__Base_ImplicitCast_2) == 0x0002E8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Power_sign__Base_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_Power_sign__Base_ImplicitCast_3) == 0x0002F0, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_Power_sign__Base_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_VLerp_Alpha_ImplicitCast) == 0x0002F8, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0002FC, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_LinearColorLerp_Alpha_ImplicitCast) == 0x000300, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_LinearColorLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BulletImpact_C_ExecuteUbergraph_BulletImpact, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000304, "Member 'BulletImpact_C_ExecuteUbergraph_BulletImpact::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

}

