#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button

#include "Basic.hpp"

#include "Str_ActionTarget_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Button.Button_C
// 0x0138 (0x03E0 - 0x02A8)
class AButton_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FrameMesh;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CA_Interaction;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ButtonMesh;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Light_78413ACF44CAE085C25F3797831C6F29; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_78413ACF44CAE085C25F3797831C6F29; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ActionTarget>              Action_Targets;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible)
	class AInteraction_C*                         Interaction;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AMec_C* Source)> Button_Push;                                // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           Color;                                             // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ButtonMesh;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Mesh_T;                                            // 0x0330(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            FrameMesh;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Push_Depth;                                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_Button_Push;                                 // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Base_Luminosity;                                   // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Push_Sound;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAttenuation*                      Push_Attenuation;                                  // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Local_Push;                                        // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Get_Name(class AMec_C* Mec, class FString* Name_0);
	void Get_Key(class AActor** Key);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Net_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Local_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Other_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature(class AMec_C* Source, const struct FStr_ItemState& State);
	void BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature(class AMec_C* Source, const struct FStr_ItemState& State);
	void BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_3_Focus__DelegateSignature(bool TRUE_0);
	void BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_4_Focusable__DelegateSignature(bool TRUE_0);
	void All_Trigger(class AMec_C* Source);
	void Scalar_Materials(const class FName Name_0, double Value);
	void Color_Materials(const class FName Name_0, const struct FLinearColor& Color_0);
	void ReceiveBeginPlay();
	void Play_Sound();
	void Hit_Interaction(class AMec_C* Source);
	void ExecuteUbergraph_Button(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Button_C">();
	}
	static class AButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AButton_C>();
	}
};
static_assert(alignof(AButton_C) == 0x000010, "Wrong alignment on AButton_C");
static_assert(sizeof(AButton_C) == 0x0003E0, "Wrong size on AButton_C");
static_assert(offsetof(AButton_C, UberGraphFrame) == 0x0002A8, "Member 'AButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AButton_C, Sphere) == 0x0002B0, "Member 'AButton_C::Sphere' has a wrong offset!");
static_assert(offsetof(AButton_C, SM_FrameMesh) == 0x0002B8, "Member 'AButton_C::SM_FrameMesh' has a wrong offset!");
static_assert(offsetof(AButton_C, Arrow) == 0x0002C0, "Member 'AButton_C::Arrow' has a wrong offset!");
static_assert(offsetof(AButton_C, CA_Interaction) == 0x0002C8, "Member 'AButton_C::CA_Interaction' has a wrong offset!");
static_assert(offsetof(AButton_C, SM_ButtonMesh) == 0x0002D0, "Member 'AButton_C::SM_ButtonMesh' has a wrong offset!");
static_assert(offsetof(AButton_C, Root) == 0x0002D8, "Member 'AButton_C::Root' has a wrong offset!");
static_assert(offsetof(AButton_C, Timeline_0_Light_78413ACF44CAE085C25F3797831C6F29) == 0x0002E0, "Member 'AButton_C::Timeline_0_Light_78413ACF44CAE085C25F3797831C6F29' has a wrong offset!");
static_assert(offsetof(AButton_C, Timeline_0__Direction_78413ACF44CAE085C25F3797831C6F29) == 0x0002E4, "Member 'AButton_C::Timeline_0__Direction_78413ACF44CAE085C25F3797831C6F29' has a wrong offset!");
static_assert(offsetof(AButton_C, Timeline_0) == 0x0002E8, "Member 'AButton_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AButton_C, Action_Targets) == 0x0002F0, "Member 'AButton_C::Action_Targets' has a wrong offset!");
static_assert(offsetof(AButton_C, Interaction) == 0x000300, "Member 'AButton_C::Interaction' has a wrong offset!");
static_assert(offsetof(AButton_C, Button_Push) == 0x000308, "Member 'AButton_C::Button_Push' has a wrong offset!");
static_assert(offsetof(AButton_C, Color) == 0x000318, "Member 'AButton_C::Color' has a wrong offset!");
static_assert(offsetof(AButton_C, ButtonMesh) == 0x000328, "Member 'AButton_C::ButtonMesh' has a wrong offset!");
static_assert(offsetof(AButton_C, Mesh_T) == 0x000330, "Member 'AButton_C::Mesh_T' has a wrong offset!");
static_assert(offsetof(AButton_C, Material) == 0x000390, "Member 'AButton_C::Material' has a wrong offset!");
static_assert(offsetof(AButton_C, FrameMesh) == 0x000398, "Member 'AButton_C::FrameMesh' has a wrong offset!");
static_assert(offsetof(AButton_C, Push_Depth) == 0x0003A0, "Member 'AButton_C::Push_Depth' has a wrong offset!");
static_assert(offsetof(AButton_C, Debug_Button_Push) == 0x0003A8, "Member 'AButton_C::Debug_Button_Push' has a wrong offset!");
static_assert(offsetof(AButton_C, Base_Luminosity) == 0x0003B0, "Member 'AButton_C::Base_Luminosity' has a wrong offset!");
static_assert(offsetof(AButton_C, Push_Sound) == 0x0003B8, "Member 'AButton_C::Push_Sound' has a wrong offset!");
static_assert(offsetof(AButton_C, Push_Attenuation) == 0x0003C0, "Member 'AButton_C::Push_Attenuation' has a wrong offset!");
static_assert(offsetof(AButton_C, Local_Push) == 0x0003C8, "Member 'AButton_C::Local_Push' has a wrong offset!");

}

