#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Str_ActionTarget_structs.hpp"
#include "Engine_structs.hpp"
#include "Str_ItemState_structs.hpp"


namespace SDK::Params
{

// Function Button.Button_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct Button_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_Get_Name) == 0x000008, "Wrong alignment on Button_C_Get_Name");
static_assert(sizeof(Button_C_Get_Name) == 0x000018, "Wrong size on Button_C_Get_Name");
static_assert(offsetof(Button_C_Get_Name, Mec) == 0x000000, "Member 'Button_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(Button_C_Get_Name, Name_0) == 0x000008, "Member 'Button_C_Get_Name::Name_0' has a wrong offset!");

// Function Button.Button_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct Button_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_Get_Key) == 0x000008, "Wrong alignment on Button_C_Get_Key");
static_assert(sizeof(Button_C_Get_Key) == 0x000008, "Wrong size on Button_C_Get_Key");
static_assert(offsetof(Button_C_Get_Key, Key) == 0x000000, "Member 'Button_C_Get_Key::Key' has a wrong offset!");

// Function Button.Button_C.UserConstructionScript
// 0x0148 (0x0148 - 0x0000)
struct Button_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0028(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AInteraction_C*                         K2Node_DynamicCast_AsInteraction;                  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_UserConstructionScript) == 0x000008, "Wrong alignment on Button_C_UserConstructionScript");
static_assert(sizeof(Button_C_UserConstructionScript) == 0x000148, "Wrong size on Button_C_UserConstructionScript");
static_assert(offsetof(Button_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Button_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'Button_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'Button_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'Button_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'Button_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000028, "Member 'Button_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000128, "Member 'Button_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000129, "Member 'Button_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, K2Node_DynamicCast_AsInteraction) == 0x000130, "Member 'Button_C_UserConstructionScript::K2Node_DynamicCast_AsInteraction' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'Button_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Button_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000140, "Member 'Button_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function Button.Button_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct Button_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_Net_Interaction) == 0x000008, "Wrong alignment on Button_C_Net_Interaction");
static_assert(sizeof(Button_C_Net_Interaction) == 0x000018, "Wrong size on Button_C_Net_Interaction");
static_assert(offsetof(Button_C_Net_Interaction, Index_0) == 0x000000, "Member 'Button_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Button_C_Net_Interaction, Source) == 0x000008, "Member 'Button_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Button_C_Net_Interaction, Item_State) == 0x000010, "Member 'Button_C_Net_Interaction::Item_State' has a wrong offset!");

// Function Button.Button_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct Button_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_Local_Interaction) == 0x000008, "Wrong alignment on Button_C_Local_Interaction");
static_assert(sizeof(Button_C_Local_Interaction) == 0x000018, "Wrong size on Button_C_Local_Interaction");
static_assert(offsetof(Button_C_Local_Interaction, Index_0) == 0x000000, "Member 'Button_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Button_C_Local_Interaction, Source) == 0x000008, "Member 'Button_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Button_C_Local_Interaction, Item_State) == 0x000010, "Member 'Button_C_Local_Interaction::Item_State' has a wrong offset!");

// Function Button.Button_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct Button_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_Other_Interaction) == 0x000008, "Wrong alignment on Button_C_Other_Interaction");
static_assert(sizeof(Button_C_Other_Interaction) == 0x000018, "Wrong size on Button_C_Other_Interaction");
static_assert(offsetof(Button_C_Other_Interaction, Index_0) == 0x000000, "Member 'Button_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Button_C_Other_Interaction, Source) == 0x000008, "Member 'Button_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Button_C_Other_Interaction, Item_State) == 0x000010, "Member 'Button_C_Other_Interaction::Item_State' has a wrong offset!");

// Function Button.Button_C.BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local Trigger__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         State;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature) == 0x000008, "Wrong alignment on Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature");
static_assert(sizeof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature) == 0x000010, "Wrong size on Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature");
static_assert(offsetof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature, Source) == 0x000000, "Member 'Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature::Source' has a wrong offset!");
static_assert(offsetof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature, State) == 0x000008, "Member 'Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_0_Local_Trigger__DelegateSignature::State' has a wrong offset!");

// Function Button.Button_C.BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net Trigger__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         State;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature) == 0x000008, "Wrong alignment on Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature");
static_assert(sizeof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature) == 0x000010, "Wrong size on Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature");
static_assert(offsetof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature, Source) == 0x000000, "Member 'Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature::Source' has a wrong offset!");
static_assert(offsetof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature, State) == 0x000008, "Member 'Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_1_Net_Trigger__DelegateSignature::State' has a wrong offset!");

// Function Button.Button_C.BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_3_Focus__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_3_Focus__DelegateSignature final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_3_Focus__DelegateSignature) == 0x000001, "Wrong alignment on Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_3_Focus__DelegateSignature");
static_assert(sizeof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_3_Focus__DelegateSignature) == 0x000001, "Wrong size on Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_3_Focus__DelegateSignature");
static_assert(offsetof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_3_Focus__DelegateSignature, TRUE_0) == 0x000000, "Member 'Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_3_Focus__DelegateSignature::TRUE_0' has a wrong offset!");

// Function Button.Button_C.BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_4_Focusable__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_4_Focusable__DelegateSignature final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_4_Focusable__DelegateSignature) == 0x000001, "Wrong alignment on Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_4_Focusable__DelegateSignature");
static_assert(sizeof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_4_Focusable__DelegateSignature) == 0x000001, "Wrong size on Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_4_Focusable__DelegateSignature");
static_assert(offsetof(Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_4_Focusable__DelegateSignature, TRUE_0) == 0x000000, "Member 'Button_C_BndEvt__Button_Interaction_K2Node_ComponentBoundEvent_4_Focusable__DelegateSignature::TRUE_0' has a wrong offset!");

// Function Button.Button_C.All Trigger
// 0x0008 (0x0008 - 0x0000)
struct Button_C_All_Trigger final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_All_Trigger) == 0x000008, "Wrong alignment on Button_C_All_Trigger");
static_assert(sizeof(Button_C_All_Trigger) == 0x000008, "Wrong size on Button_C_All_Trigger");
static_assert(offsetof(Button_C_All_Trigger, Source) == 0x000000, "Member 'Button_C_All_Trigger::Source' has a wrong offset!");

// Function Button.Button_C.Scalar Materials
// 0x0010 (0x0010 - 0x0000)
struct Button_C_Scalar_Materials final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_Scalar_Materials) == 0x000008, "Wrong alignment on Button_C_Scalar_Materials");
static_assert(sizeof(Button_C_Scalar_Materials) == 0x000010, "Wrong size on Button_C_Scalar_Materials");
static_assert(offsetof(Button_C_Scalar_Materials, Name_0) == 0x000000, "Member 'Button_C_Scalar_Materials::Name_0' has a wrong offset!");
static_assert(offsetof(Button_C_Scalar_Materials, Value) == 0x000008, "Member 'Button_C_Scalar_Materials::Value' has a wrong offset!");

// Function Button.Button_C.Color Materials
// 0x0018 (0x0018 - 0x0000)
struct Button_C_Color_Materials final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_0;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_Color_Materials) == 0x000004, "Wrong alignment on Button_C_Color_Materials");
static_assert(sizeof(Button_C_Color_Materials) == 0x000018, "Wrong size on Button_C_Color_Materials");
static_assert(offsetof(Button_C_Color_Materials, Name_0) == 0x000000, "Member 'Button_C_Color_Materials::Name_0' has a wrong offset!");
static_assert(offsetof(Button_C_Color_Materials, Color_0) == 0x000008, "Member 'Button_C_Color_Materials::Color_0' has a wrong offset!");

// Function Button.Button_C.Hit Interaction
// 0x0008 (0x0008 - 0x0000)
struct Button_C_Hit_Interaction final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_Hit_Interaction) == 0x000008, "Wrong alignment on Button_C_Hit_Interaction");
static_assert(sizeof(Button_C_Hit_Interaction) == 0x000008, "Wrong size on Button_C_Hit_Interaction");
static_assert(offsetof(Button_C_Hit_Interaction, Source) == 0x000000, "Member 'Button_C_Hit_Interaction::Source' has a wrong offset!");

// Function Button.Button_C.ExecuteUbergraph_Button
// 0x05A0 (0x05A0 - 0x0000)
struct Button_C_ExecuteUbergraph_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ActionTarget                      CallFunc_Array_Get_Item;                           // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction;              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source_1;               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_ComponentBoundEvent_State_1;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_ComponentBoundEvent_State;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_True_1;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_True;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_CustomEvent_Source_1;                       // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Name_1;                         // 0x013C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Value;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Name;                           // 0x0150(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0188(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x02A0(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x03A0(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASoundPath_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_CustomEvent_Source;                         // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance;                        // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location;                        // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0558(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStr_ActionTarget                      CallFunc_Array_Get_Item_1;                         // 0x0560(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction_1;            // 0x0578(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0598(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_C_ExecuteUbergraph_Button) == 0x000010, "Wrong alignment on Button_C_ExecuteUbergraph_Button");
static_assert(sizeof(Button_C_ExecuteUbergraph_Button) == 0x0005A0, "Wrong size on Button_C_ExecuteUbergraph_Button");
static_assert(offsetof(Button_C_ExecuteUbergraph_Button, EntryPoint) == 0x000000, "Member 'Button_C_ExecuteUbergraph_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(Button_C_ExecuteUbergraph_Button, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'Button_C_ExecuteUbergraph_Button::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_C_ExecuteUbergraph_Button, CallFunc_MakeVector_ReturnValue_1) == 0x000020, "Member 'Button_C_ExecuteUbergraph_Button::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
