#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraRoomHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraRoomHandler.CameraRoomHandler_C
// 0x0078 (0x0320 - 0x02A8)
class ACameraRoomHandler_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Extent;                                            // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Camera_On;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Start_Screens;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Stop_Screens;                                      // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class ACameraScreen_C*>                Screens;                                           // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class APC_Cameras_C*                          PC_Ref;                                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void Check_Tick();
	void ExecuteUbergraph_CameraRoomHandler(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraRoomHandler_C">();
	}
	static class ACameraRoomHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraRoomHandler_C>();
	}
};
static_assert(alignof(ACameraRoomHandler_C) == 0x000008, "Wrong alignment on ACameraRoomHandler_C");
static_assert(sizeof(ACameraRoomHandler_C) == 0x000320, "Wrong size on ACameraRoomHandler_C");
static_assert(offsetof(ACameraRoomHandler_C, UberGraphFrame) == 0x0002A8, "Member 'ACameraRoomHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACameraRoomHandler_C, Box) == 0x0002B0, "Member 'ACameraRoomHandler_C::Box' has a wrong offset!");
static_assert(offsetof(ACameraRoomHandler_C, DefaultSceneRoot) == 0x0002B8, "Member 'ACameraRoomHandler_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACameraRoomHandler_C, Extent) == 0x0002C0, "Member 'ACameraRoomHandler_C::Extent' has a wrong offset!");
static_assert(offsetof(ACameraRoomHandler_C, Mec_Ref) == 0x0002D8, "Member 'ACameraRoomHandler_C::Mec_Ref' has a wrong offset!");
static_assert(offsetof(ACameraRoomHandler_C, Camera_On) == 0x0002E0, "Member 'ACameraRoomHandler_C::Camera_On' has a wrong offset!");
static_assert(offsetof(ACameraRoomHandler_C, Start_Screens) == 0x0002E8, "Member 'ACameraRoomHandler_C::Start_Screens' has a wrong offset!");
static_assert(offsetof(ACameraRoomHandler_C, Stop_Screens) == 0x0002F8, "Member 'ACameraRoomHandler_C::Stop_Screens' has a wrong offset!");
static_assert(offsetof(ACameraRoomHandler_C, Screens) == 0x000308, "Member 'ACameraRoomHandler_C::Screens' has a wrong offset!");
static_assert(offsetof(ACameraRoomHandler_C, PC_Ref) == 0x000318, "Member 'ACameraRoomHandler_C::PC_Ref' has a wrong offset!");

}

