#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Centrifuge

#include "Basic.hpp"

#include "Str_ItemState_structs.hpp"
#include "E_GenericMachine_State_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Centrifuge.Centrifuge_C.All PLay Bip
// 0x0001 (0x0001 - 0x0000)
struct Centrifuge_C_All_PLay_Bip final
{
public:
	bool                                          Finish;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_All_PLay_Bip) == 0x000001, "Wrong alignment on Centrifuge_C_All_PLay_Bip");
static_assert(sizeof(Centrifuge_C_All_PLay_Bip) == 0x000001, "Wrong size on Centrifuge_C_All_PLay_Bip");
static_assert(offsetof(Centrifuge_C_All_PLay_Bip, Finish) == 0x000000, "Member 'Centrifuge_C_All_PLay_Bip::Finish' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.Apply State
// 0x0001 (0x0001 - 0x0000)
struct Centrifuge_C_Apply_State final
{
public:
	E_GenericMachine_State                        State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_Apply_State) == 0x000001, "Wrong alignment on Centrifuge_C_Apply_State");
static_assert(sizeof(Centrifuge_C_Apply_State) == 0x000001, "Wrong size on Centrifuge_C_Apply_State");
static_assert(offsetof(Centrifuge_C_Apply_State, State_0) == 0x000000, "Member 'Centrifuge_C_Apply_State::State_0' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Centrifuge_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on Centrifuge_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature");
static_assert(sizeof(Centrifuge_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature) == 0x000008, "Wrong size on Centrifuge_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature");
static_assert(offsetof(Centrifuge_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'Centrifuge_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.ExecuteUbergraph_Centrifuge
// 0x01E0 (0x01E0 - 0x0000)
struct Centrifuge_C_ExecuteUbergraph_Centrifuge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Content_Container;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         CallFunc_Get_Content_Content;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location;                        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Content_Container_1;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         CallFunc_Get_Content_Content_1;                    // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_1;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_1;                      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_2;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_2;                      // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_3;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_3;                      // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_GenericMachine_Jauge_C*              K2Node_DynamicCast_AsW_Generic_Machine_Jauge;      // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Content_Container_2;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         CallFunc_Get_Content_Content_2;                    // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GenericMachine_State                        K2Node_CustomEvent_State;                          // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A7[0x1];                                      // 0x01A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState_1;                 // 0x01AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Finish;                         // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x01B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x01B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput; // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1; // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_ExecuteUbergraph_Centrifuge) == 0x000008, "Wrong alignment on Centrifuge_C_ExecuteUbergraph_Centrifuge");
static_assert(sizeof(Centrifuge_C_ExecuteUbergraph_Centrifuge) == 0x0001E0, "Wrong size on Centrifuge_C_ExecuteUbergraph_Centrifuge");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, EntryPoint) == 0x000000, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::EntryPoint' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_MakeStruct_Str_ItemState) == 0x000004, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Content_Container) == 0x00000C, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Content_Container' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Content_Content) == 0x000010, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Content_Content' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000020, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Path_Distance) == 0x000028, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Path_Distance' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Path_Location) == 0x000030, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Path_Location' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Content_Container_1) == 0x000048, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Content_Container_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Content_Content_1) == 0x00004C, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Content_Content_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000058, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Path_Distance_1) == 0x000060, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Path_Distance_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Path_Location_1) == 0x000068, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Path_Location_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000080, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x000088, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Path_Distance_2) == 0x000090, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Path_Distance_2' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Path_Location_2) == 0x000098, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Path_Location_2' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Path_Distance_3) == 0x0000B0, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Path_Distance_3' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Path_Location_3) == 0x0000B8, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Path_Location_3' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x0000D0, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_Event_Index_2) == 0x0000D8, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_Event_Source_2) == 0x0000E0, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_Event_Item_State_2) == 0x0000E8, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_Event_Index_1) == 0x0000F0, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_Event_Source_1) == 0x0000F8, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_Event_Item_State_1) == 0x000100, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_Event_Index) == 0x000108, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_Event_Source) == 0x000110, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_Event_Item_State) == 0x000118, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Add_IntInt_ReturnValue) == 0x000120, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_SwitchEnum_CmpSuccess) == 0x000124, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_GetWidget_ReturnValue) == 0x000128, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_DynamicCast_AsW_Generic_Machine_Jauge) == 0x000130, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_DynamicCast_AsW_Generic_Machine_Jauge' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_ComponentBoundEvent_Source) == 0x000140, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_ComponentBoundEvent_Source' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000148, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Clamp_ReturnValue) == 0x000150, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000154, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_CreateDelegate_OutputDelegate) == 0x000158, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_GetGameMode_ReturnValue) == 0x000168, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_DynamicCast_AsGM) == 0x000170, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_CreateDelegate_OutputDelegate_1) == 0x00017C, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000190, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Content_Container_2) == 0x000198, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Content_Container_2' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_Get_Content_Content_2) == 0x00019C, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_Get_Content_Content_2' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_CustomEvent_State) == 0x0001A4, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001A5, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001A6, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_SelectInt_ReturnValue) == 0x0001A8, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_MakeStruct_Str_ItemState_1) == 0x0001AC, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_MakeStruct_Str_ItemState_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_HasAuthority_ReturnValue) == 0x0001B4, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_CustomEvent_Finish) == 0x0001B5, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_CustomEvent_Finish' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_SwitchEnum_CmpSuccess_2) == 0x0001B6, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, K2Node_SwitchEnum_CmpSuccess_3) == 0x0001B7, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_SetFloatParameter_self_CastInput) == 0x0001B8, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_SetFloatParameter_self_CastInput_1) == 0x0001C8, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0001D8, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_ExecuteUbergraph_Centrifuge, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0001DC, "Member 'Centrifuge_C_ExecuteUbergraph_Centrifuge::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct Centrifuge_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_Get_Key) == 0x000008, "Wrong alignment on Centrifuge_C_Get_Key");
static_assert(sizeof(Centrifuge_C_Get_Key) == 0x000008, "Wrong size on Centrifuge_C_Get_Key");
static_assert(offsetof(Centrifuge_C_Get_Key, Key) == 0x000000, "Member 'Centrifuge_C_Get_Key::Key' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct Centrifuge_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_Get_Name) == 0x000008, "Wrong alignment on Centrifuge_C_Get_Name");
static_assert(sizeof(Centrifuge_C_Get_Name) == 0x000018, "Wrong size on Centrifuge_C_Get_Name");
static_assert(offsetof(Centrifuge_C_Get_Name, Mec) == 0x000000, "Member 'Centrifuge_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_Get_Name, Name_0) == 0x000008, "Member 'Centrifuge_C_Get_Name::Name_0' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct Centrifuge_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_Local_Interaction) == 0x000008, "Wrong alignment on Centrifuge_C_Local_Interaction");
static_assert(sizeof(Centrifuge_C_Local_Interaction) == 0x000018, "Wrong size on Centrifuge_C_Local_Interaction");
static_assert(offsetof(Centrifuge_C_Local_Interaction, Index_0) == 0x000000, "Member 'Centrifuge_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_Local_Interaction, Source) == 0x000008, "Member 'Centrifuge_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_Local_Interaction, Item_State) == 0x000010, "Member 'Centrifuge_C_Local_Interaction::Item_State' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct Centrifuge_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_Net_Interaction) == 0x000008, "Wrong alignment on Centrifuge_C_Net_Interaction");
static_assert(sizeof(Centrifuge_C_Net_Interaction) == 0x000018, "Wrong size on Centrifuge_C_Net_Interaction");
static_assert(offsetof(Centrifuge_C_Net_Interaction, Index_0) == 0x000000, "Member 'Centrifuge_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_Net_Interaction, Source) == 0x000008, "Member 'Centrifuge_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_Net_Interaction, Item_State) == 0x000010, "Member 'Centrifuge_C_Net_Interaction::Item_State' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.OnRep_State
// 0x0001 (0x0001 - 0x0000)
struct Centrifuge_C_OnRep_State final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_OnRep_State) == 0x000001, "Wrong alignment on Centrifuge_C_OnRep_State");
static_assert(sizeof(Centrifuge_C_OnRep_State) == 0x000001, "Wrong size on Centrifuge_C_OnRep_State");
static_assert(offsetof(Centrifuge_C_OnRep_State, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'Centrifuge_C_OnRep_State::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct Centrifuge_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_Other_Interaction) == 0x000008, "Wrong alignment on Centrifuge_C_Other_Interaction");
static_assert(sizeof(Centrifuge_C_Other_Interaction) == 0x000018, "Wrong size on Centrifuge_C_Other_Interaction");
static_assert(offsetof(Centrifuge_C_Other_Interaction, Index_0) == 0x000000, "Member 'Centrifuge_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_Other_Interaction, Source) == 0x000008, "Member 'Centrifuge_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_Other_Interaction, Item_State) == 0x000010, "Member 'Centrifuge_C_Other_Interaction::Item_State' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.Set Process Screen
// 0x0001 (0x0001 - 0x0000)
struct Centrifuge_C_Set_Process_Screen final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_Set_Process_Screen) == 0x000001, "Wrong alignment on Centrifuge_C_Set_Process_Screen");
static_assert(sizeof(Centrifuge_C_Set_Process_Screen) == 0x000001, "Wrong size on Centrifuge_C_Set_Process_Screen");
static_assert(offsetof(Centrifuge_C_Set_Process_Screen, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Centrifuge_C_Set_Process_Screen::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Centrifuge.Centrifuge_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct Centrifuge_C_UserConstructionScript final
{
public:
	class ASampleSlot_C*                          K2Node_DynamicCast_AsSample_Slot;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASoundPath_C*                           K2Node_DynamicCast_AsSound_Path;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AContainerSlot_C*                       K2Node_DynamicCast_AsContainer_Slot;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Centrifuge_C_UserConstructionScript) == 0x000008, "Wrong alignment on Centrifuge_C_UserConstructionScript");
static_assert(sizeof(Centrifuge_C_UserConstructionScript) == 0x000040, "Wrong size on Centrifuge_C_UserConstructionScript");
static_assert(offsetof(Centrifuge_C_UserConstructionScript, K2Node_DynamicCast_AsSample_Slot) == 0x000000, "Member 'Centrifuge_C_UserConstructionScript::K2Node_DynamicCast_AsSample_Slot' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Centrifuge_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Centrifuge_C_UserConstructionScript, K2Node_DynamicCast_AsSound_Path) == 0x000010, "Member 'Centrifuge_C_UserConstructionScript::K2Node_DynamicCast_AsSound_Path' has a wrong offset!");
