#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContainerSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ContainerSlot_State_structs.hpp"
#include "Str_ItemState_structs.hpp"
#include "E_ContainerSlot_Position_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ContainerSlot.ContainerSlot_C
// 0x0188 (0x0430 - 0x02A8)
class AContainerSlot_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        MS_ContainerSlot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SoundPath;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SupportMesh;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CA_Container;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FrameMesh;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Timeline_Sound_30535D114D895EE7EBADD68B634FD85A;   // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Timeline_In_30535D114D895EE7EBADD68B634FD85A;      // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_30535D114D895EE7EBADD68B634FD85A; // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Container;                                         // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Place_Container;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Take_Container;                                    // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	E_ContainerSlot_State                         State;                                             // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         Content;                                           // 0x0344(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ContainerSlot_Position                      position;                                          // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASoundPath_C*                           SoundPath;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Frame_Mesh;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Support_Mesh;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Random_Pitch;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             T_Up;                                              // 0x0370(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             T_Down;                                            // 0x03D0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Anim_Container(bool In);
	void BndEvt__ContainerSlot_Container_K2Node_ComponentBoundEvent_0_Place_Item__DelegateSignature();
	void BndEvt__ContainerSlot_Container_K2Node_ComponentBoundEvent_1_Take_Item__DelegateSignature();
	void ExecuteUbergraph_ContainerSlot(int32 EntryPoint);
	void Force_State(E_ContainerSlot_State State_0, const struct FStr_ItemState& Content_0);
	void Get_Content(bool* Container_0, struct FStr_ItemState* Content_0);
	void Lock(bool Lock_0);
	void Move_In();
	void Move_Out(const struct FStr_ItemState& Content_0, bool Locked);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void Update_Location(const struct FTransform& Transform);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ContainerSlot_C">();
	}
	static class AContainerSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AContainerSlot_C>();
	}
};
static_assert(alignof(AContainerSlot_C) == 0x000010, "Wrong alignment on AContainerSlot_C");
static_assert(sizeof(AContainerSlot_C) == 0x000430, "Wrong size on AContainerSlot_C");
static_assert(offsetof(AContainerSlot_C, UberGraphFrame) == 0x0002A8, "Member 'AContainerSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, MS_ContainerSlot) == 0x0002B0, "Member 'AContainerSlot_C::MS_ContainerSlot' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, C_SoundPath) == 0x0002B8, "Member 'AContainerSlot_C::C_SoundPath' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, SM_SupportMesh) == 0x0002C0, "Member 'AContainerSlot_C::SM_SupportMesh' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, CA_Container) == 0x0002C8, "Member 'AContainerSlot_C::CA_Container' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, SM_FrameMesh) == 0x0002D0, "Member 'AContainerSlot_C::SM_FrameMesh' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Timeline_Sound_30535D114D895EE7EBADD68B634FD85A) == 0x0002D8, "Member 'AContainerSlot_C::Timeline_Sound_30535D114D895EE7EBADD68B634FD85A' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Timeline_In_30535D114D895EE7EBADD68B634FD85A) == 0x0002F0, "Member 'AContainerSlot_C::Timeline_In_30535D114D895EE7EBADD68B634FD85A' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Timeline__Direction_30535D114D895EE7EBADD68B634FD85A) == 0x000308, "Member 'AContainerSlot_C::Timeline__Direction_30535D114D895EE7EBADD68B634FD85A' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Timeline) == 0x000310, "Member 'AContainerSlot_C::Timeline' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Container) == 0x000318, "Member 'AContainerSlot_C::Container' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Place_Container) == 0x000320, "Member 'AContainerSlot_C::Place_Container' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Take_Container) == 0x000330, "Member 'AContainerSlot_C::Take_Container' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, State) == 0x000340, "Member 'AContainerSlot_C::State' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Content) == 0x000344, "Member 'AContainerSlot_C::Content' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, position) == 0x00034C, "Member 'AContainerSlot_C::position' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, SoundPath) == 0x000350, "Member 'AContainerSlot_C::SoundPath' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Frame_Mesh) == 0x000358, "Member 'AContainerSlot_C::Frame_Mesh' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Support_Mesh) == 0x000360, "Member 'AContainerSlot_C::Support_Mesh' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, Random_Pitch) == 0x000368, "Member 'AContainerSlot_C::Random_Pitch' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, T_Up) == 0x000370, "Member 'AContainerSlot_C::T_Up' has a wrong offset!");
static_assert(offsetof(AContainerSlot_C, T_Down) == 0x0003D0, "Member 'AContainerSlot_C::T_Down' has a wrong offset!");

}

