#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContainerSlot

#include "Basic.hpp"

#include "Str_ItemState_structs.hpp"
#include "E_ContainerSlot_State_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ContainerSlot.ContainerSlot_C.Anim Container
// 0x0001 (0x0001 - 0x0000)
struct ContainerSlot_C_Anim_Container final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerSlot_C_Anim_Container) == 0x000001, "Wrong alignment on ContainerSlot_C_Anim_Container");
static_assert(sizeof(ContainerSlot_C_Anim_Container) == 0x000001, "Wrong size on ContainerSlot_C_Anim_Container");
static_assert(offsetof(ContainerSlot_C_Anim_Container, In) == 0x000000, "Member 'ContainerSlot_C_Anim_Container::In' has a wrong offset!");

// Function ContainerSlot.ContainerSlot_C.ExecuteUbergraph_ContainerSlot
// 0x06E0 (0x06E0 - 0x0000)
struct ContainerSlot_C_ExecuteUbergraph_ContainerSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput_1; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Temp_struct_Variable_2;                            // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput_2; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_2; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_3; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput_3; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_4; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_5; // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Temp_struct_Variable_3;                            // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_6; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput_4; // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_7; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_8; // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_4;         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput_5; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_9; // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_10; // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable_1;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_5;         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_11; // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput_6; // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_12; // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_13; // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_6;         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_In;                             // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ContainerSlot_State                         K2Node_CustomEvent_State;                          // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         K2Node_CustomEvent_Content_1;                      // 0x0204(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         K2Node_CustomEvent_Content;                        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Locked;                         // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Lock;                           // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput_7; // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform;                      // 0x0240(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x02E8(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_14; // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_15; // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default;                             // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1; // 0x0468(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_2; // 0x0580(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_7;         // 0x0698(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_16; // 0x06A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_17; // 0x06B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast_1; // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot) == 0x000010, "Wrong alignment on ContainerSlot_C_ExecuteUbergraph_ContainerSlot");
static_assert(sizeof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot) == 0x0006E0, "Wrong size on ContainerSlot_C_ExecuteUbergraph_ContainerSlot");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, EntryPoint) == 0x000000, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, Temp_struct_Variable) == 0x000008, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput) == 0x000020, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, Temp_struct_Variable_1) == 0x000030, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000048, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetTriggerParameter_self_CastInput) == 0x000058, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetTriggerParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000068, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, Temp_byte_Variable) == 0x000070, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetTriggerParameter_self_CastInput_1) == 0x000078, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetTriggerParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000088, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, Temp_struct_Variable_2) == 0x000090, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetTriggerParameter_self_CastInput_2) == 0x0000A8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetTriggerParameter_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_2) == 0x0000B8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_3) == 0x0000C8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x0000D8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetTriggerParameter_self_CastInput_3) == 0x0000E0, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetTriggerParameter_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_4) == 0x0000F0, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_5) == 0x000100, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x000110, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, Temp_struct_Variable_3) == 0x000118, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_6) == 0x000130, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_6' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetTriggerParameter_self_CastInput_4) == 0x000140, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetTriggerParameter_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_7) == 0x000150, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_7' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_8) == 0x000160, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_8' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SpawnSoundAttached_ReturnValue_4) == 0x000170, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SpawnSoundAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetTriggerParameter_self_CastInput_5) == 0x000178, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetTriggerParameter_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_9) == 0x000188, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_9' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_10) == 0x000198, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_10' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, Temp_byte_Variable_1) == 0x0001A8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SpawnSoundAttached_ReturnValue_5) == 0x0001B0, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SpawnSoundAttached_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_11) == 0x0001B8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_11' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetTriggerParameter_self_CastInput_6) == 0x0001C8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetTriggerParameter_self_CastInput_6' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_12) == 0x0001D8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_12' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_13) == 0x0001E8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_13' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SpawnSoundAttached_ReturnValue_6) == 0x0001F8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SpawnSoundAttached_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_CustomEvent_In) == 0x000200, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_CustomEvent_In' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_CustomEvent_State) == 0x000201, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_CustomEvent_Content_1) == 0x000204, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_CustomEvent_Content_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_SwitchEnum_CmpSuccess) == 0x00020C, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_CustomEvent_Content) == 0x000210, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_CustomEvent_Content' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_CustomEvent_Locked) == 0x000218, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_CustomEvent_Locked' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_CustomEvent_Lock) == 0x000219, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_CustomEvent_Lock' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetTriggerParameter_self_CastInput_7) == 0x000220, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetTriggerParameter_self_CastInput_7' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_RandomFloatInRange_ReturnValue) == 0x000230, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000238, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_CustomEvent_Transform) == 0x000240, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_CustomEvent_Transform' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_BreakTransform_Location) == 0x0002A0, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_BreakTransform_Rotation) == 0x0002B8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_BreakTransform_Scale) == 0x0002D0, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x0002E8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_14) == 0x0003E8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_14' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_15) == 0x0003F8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_15' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_BreakVector_X) == 0x000408, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_BreakVector_Y) == 0x000410, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_BreakVector_Z) == 0x000418, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_Select_Default) == 0x000420, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_MakeRotator_ReturnValue) == 0x000438, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_MakeVector_ReturnValue) == 0x000450, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1) == 0x000468, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, K2Node_Select_Default_1) == 0x000568, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_2) == 0x000580, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_BreakVector_X_1) == 0x000680, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_BreakVector_Y_1) == 0x000688, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_BreakVector_Z_1) == 0x000690, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SpawnSoundAttached_ReturnValue_7) == 0x000698, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SpawnSoundAttached_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_16) == 0x0006A0, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_16' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0006B0, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_self_CastInput_17) == 0x0006B8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_self_CastInput_17' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0006C8, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x0006CC, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_ExecuteUbergraph_ContainerSlot, CallFunc_SetFloatParameter_InFloat_ImplicitCast_1) == 0x0006D0, "Member 'ContainerSlot_C_ExecuteUbergraph_ContainerSlot::CallFunc_SetFloatParameter_InFloat_ImplicitCast_1' has a wrong offset!");

// Function ContainerSlot.ContainerSlot_C.Force State
// 0x000C (0x000C - 0x0000)
struct ContainerSlot_C_Force_State final
{
public:
	E_ContainerSlot_State                         State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         Content_0;                                         // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerSlot_C_Force_State) == 0x000004, "Wrong alignment on ContainerSlot_C_Force_State");
static_assert(sizeof(ContainerSlot_C_Force_State) == 0x00000C, "Wrong size on ContainerSlot_C_Force_State");
static_assert(offsetof(ContainerSlot_C_Force_State, State_0) == 0x000000, "Member 'ContainerSlot_C_Force_State::State_0' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_Force_State, Content_0) == 0x000004, "Member 'ContainerSlot_C_Force_State::Content_0' has a wrong offset!");

// Function ContainerSlot.ContainerSlot_C.Get Content
// 0x000C (0x000C - 0x0000)
struct ContainerSlot_C_Get_Content final
{
public:
	bool                                          Container_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         Content_0;                                         // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerSlot_C_Get_Content) == 0x000004, "Wrong alignment on ContainerSlot_C_Get_Content");
static_assert(sizeof(ContainerSlot_C_Get_Content) == 0x00000C, "Wrong size on ContainerSlot_C_Get_Content");
static_assert(offsetof(ContainerSlot_C_Get_Content, Container_0) == 0x000000, "Member 'ContainerSlot_C_Get_Content::Container_0' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_Get_Content, Content_0) == 0x000004, "Member 'ContainerSlot_C_Get_Content::Content_0' has a wrong offset!");

// Function ContainerSlot.ContainerSlot_C.Lock
// 0x0001 (0x0001 - 0x0000)
struct ContainerSlot_C_Lock final
{
public:
	bool                                          Lock_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerSlot_C_Lock) == 0x000001, "Wrong alignment on ContainerSlot_C_Lock");
static_assert(sizeof(ContainerSlot_C_Lock) == 0x000001, "Wrong size on ContainerSlot_C_Lock");
static_assert(offsetof(ContainerSlot_C_Lock, Lock_0) == 0x000000, "Member 'ContainerSlot_C_Lock::Lock_0' has a wrong offset!");

// Function ContainerSlot.ContainerSlot_C.Move Out
// 0x000C (0x000C - 0x0000)
struct ContainerSlot_C_Move_Out final
{
public:
	struct FStr_ItemState                         Content_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Locked;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerSlot_C_Move_Out) == 0x000004, "Wrong alignment on ContainerSlot_C_Move_Out");
static_assert(sizeof(ContainerSlot_C_Move_Out) == 0x00000C, "Wrong size on ContainerSlot_C_Move_Out");
static_assert(offsetof(ContainerSlot_C_Move_Out, Content_0) == 0x000000, "Member 'ContainerSlot_C_Move_Out::Content_0' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_Move_Out, Locked) == 0x000008, "Member 'ContainerSlot_C_Move_Out::Locked' has a wrong offset!");

// Function ContainerSlot.ContainerSlot_C.Update Location
// 0x0060 (0x0060 - 0x0000)
struct ContainerSlot_C_Update_Location final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerSlot_C_Update_Location) == 0x000010, "Wrong alignment on ContainerSlot_C_Update_Location");
static_assert(sizeof(ContainerSlot_C_Update_Location) == 0x000060, "Wrong size on ContainerSlot_C_Update_Location");
static_assert(offsetof(ContainerSlot_C_Update_Location, Transform) == 0x000000, "Member 'ContainerSlot_C_Update_Location::Transform' has a wrong offset!");

// Function ContainerSlot.ContainerSlot_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct ContainerSlot_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ASoundPath_C*                           K2Node_DynamicCast_AsSound_Path;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemSlot_C*                            K2Node_DynamicCast_AsItem_Slot;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerSlot_C_UserConstructionScript) == 0x000008, "Wrong alignment on ContainerSlot_C_UserConstructionScript");
static_assert(sizeof(ContainerSlot_C_UserConstructionScript) == 0x000030, "Wrong size on ContainerSlot_C_UserConstructionScript");
static_assert(offsetof(ContainerSlot_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ContainerSlot_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'ContainerSlot_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContainerSlot_C_UserConstructionScript, K2Node_MakeStruct_Str_ItemState) == 0x000004, "Member 'ContainerSlot_C_UserConstructionScript::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
