#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContainerCleaner

#include "Basic.hpp"

#include "Str_ItemState_structs.hpp"
#include "E_GenericMachine_State_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ContainerCleaner.ContainerCleaner_C.All Set Process
// 0x0004 (0x0004 - 0x0000)
struct ContainerCleaner_C_All_Set_Process final
{
public:
	int32                                         Process_0;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_All_Set_Process) == 0x000004, "Wrong alignment on ContainerCleaner_C_All_Set_Process");
static_assert(sizeof(ContainerCleaner_C_All_Set_Process) == 0x000004, "Wrong size on ContainerCleaner_C_All_Set_Process");
static_assert(offsetof(ContainerCleaner_C_All_Set_Process, Process_0) == 0x000000, "Member 'ContainerCleaner_C_All_Set_Process::Process_0' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.All Set State
// 0x0001 (0x0001 - 0x0000)
struct ContainerCleaner_C_All_Set_State final
{
public:
	E_GenericMachine_State                        State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_All_Set_State) == 0x000001, "Wrong alignment on ContainerCleaner_C_All_Set_State");
static_assert(sizeof(ContainerCleaner_C_All_Set_State) == 0x000001, "Wrong size on ContainerCleaner_C_All_Set_State");
static_assert(offsetof(ContainerCleaner_C_All_Set_State, State_0) == 0x000000, "Member 'ContainerCleaner_C_All_Set_State::State_0' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ContainerCleaner_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on ContainerCleaner_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature");
static_assert(sizeof(ContainerCleaner_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature) == 0x000008, "Wrong size on ContainerCleaner_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature");
static_assert(offsetof(ContainerCleaner_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'ContainerCleaner_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.ExecuteUbergraph_ContainerCleaner
// 0x0140 (0x0140 - 0x0000)
struct ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Content_Container;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         CallFunc_Get_Content_Content;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_GenericMachine_Jauge_C*              K2Node_DynamicCast_AsW_Generic_Machine_Jauge;      // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GenericMachine_State                        K2Node_CustomEvent_Selection;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GenericMachine_State                        K2Node_CustomEvent_State;                          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Process_1;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Process;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput; // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1; // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner) == 0x000008, "Wrong alignment on ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner");
static_assert(sizeof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner) == 0x000140, "Wrong size on ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, EntryPoint) == 0x000000, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::EntryPoint' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_Get_Content_Container) == 0x000004, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_Get_Content_Container' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_Get_Content_Content) == 0x000008, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_Get_Content_Content' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000010, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000020, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x000028, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x000030, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_Event_Index_2) == 0x000038, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_Event_Source_2) == 0x000040, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_Event_Item_State_2) == 0x000048, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_Event_Index_1) == 0x000050, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_Event_Source_1) == 0x000058, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_Event_Item_State_1) == 0x000060, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_Event_Index) == 0x000068, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_Event_Source) == 0x000070, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_Event_Item_State) == 0x000078, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_SwitchEnum_CmpSuccess) == 0x000084, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_ComponentBoundEvent_Source) == 0x000098, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_ComponentBoundEvent_Source' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_GetWidget_ReturnValue) == 0x0000A0, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_DynamicCast_AsW_Generic_Machine_Jauge) == 0x0000A8, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_DynamicCast_AsW_Generic_Machine_Jauge' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_Clamp_ReturnValue) == 0x0000B4, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000BC, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_GetGameMode_ReturnValue) == 0x0000D0, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_DynamicCast_AsGM) == 0x0000D8, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000E8, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_CustomEvent_Selection) == 0x0000F0, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_CustomEvent_Selection' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000100, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_SwitchEnum_CmpSuccess_1) == 0x000108, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_CustomEvent_State) == 0x000109, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_CustomEvent_Process_1) == 0x00010C, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_CustomEvent_Process_1' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, K2Node_CustomEvent_Process) == 0x000110, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::K2Node_CustomEvent_Process' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000114, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_SetFloatParameter_self_CastInput) == 0x000118, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000128, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_HasAuthority_ReturnValue) == 0x000138, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x00013C, "Member 'ContainerCleaner_C_ExecuteUbergraph_ContainerCleaner::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct ContainerCleaner_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_Get_Key) == 0x000008, "Wrong alignment on ContainerCleaner_C_Get_Key");
static_assert(sizeof(ContainerCleaner_C_Get_Key) == 0x000008, "Wrong size on ContainerCleaner_C_Get_Key");
static_assert(offsetof(ContainerCleaner_C_Get_Key, Key) == 0x000000, "Member 'ContainerCleaner_C_Get_Key::Key' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct ContainerCleaner_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_Get_Name) == 0x000008, "Wrong alignment on ContainerCleaner_C_Get_Name");
static_assert(sizeof(ContainerCleaner_C_Get_Name) == 0x000018, "Wrong size on ContainerCleaner_C_Get_Name");
static_assert(offsetof(ContainerCleaner_C_Get_Name, Mec) == 0x000000, "Member 'ContainerCleaner_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_Get_Name, Name_0) == 0x000008, "Member 'ContainerCleaner_C_Get_Name::Name_0' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct ContainerCleaner_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_Local_Interaction) == 0x000008, "Wrong alignment on ContainerCleaner_C_Local_Interaction");
static_assert(sizeof(ContainerCleaner_C_Local_Interaction) == 0x000018, "Wrong size on ContainerCleaner_C_Local_Interaction");
static_assert(offsetof(ContainerCleaner_C_Local_Interaction, Index_0) == 0x000000, "Member 'ContainerCleaner_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_Local_Interaction, Source) == 0x000008, "Member 'ContainerCleaner_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_Local_Interaction, Item_State) == 0x000010, "Member 'ContainerCleaner_C_Local_Interaction::Item_State' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct ContainerCleaner_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_Net_Interaction) == 0x000008, "Wrong alignment on ContainerCleaner_C_Net_Interaction");
static_assert(sizeof(ContainerCleaner_C_Net_Interaction) == 0x000018, "Wrong size on ContainerCleaner_C_Net_Interaction");
static_assert(offsetof(ContainerCleaner_C_Net_Interaction, Index_0) == 0x000000, "Member 'ContainerCleaner_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_Net_Interaction, Source) == 0x000008, "Member 'ContainerCleaner_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_Net_Interaction, Item_State) == 0x000010, "Member 'ContainerCleaner_C_Net_Interaction::Item_State' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct ContainerCleaner_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_Other_Interaction) == 0x000008, "Wrong alignment on ContainerCleaner_C_Other_Interaction");
static_assert(sizeof(ContainerCleaner_C_Other_Interaction) == 0x000018, "Wrong size on ContainerCleaner_C_Other_Interaction");
static_assert(offsetof(ContainerCleaner_C_Other_Interaction, Index_0) == 0x000000, "Member 'ContainerCleaner_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_Other_Interaction, Source) == 0x000008, "Member 'ContainerCleaner_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_Other_Interaction, Item_State) == 0x000010, "Member 'ContainerCleaner_C_Other_Interaction::Item_State' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.Set Process
// 0x0004 (0x0004 - 0x0000)
struct ContainerCleaner_C_Set_Process final
{
public:
	int32                                         Process_0;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_Set_Process) == 0x000004, "Wrong alignment on ContainerCleaner_C_Set_Process");
static_assert(sizeof(ContainerCleaner_C_Set_Process) == 0x000004, "Wrong size on ContainerCleaner_C_Set_Process");
static_assert(offsetof(ContainerCleaner_C_Set_Process, Process_0) == 0x000000, "Member 'ContainerCleaner_C_Set_Process::Process_0' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.Set Process Screen
// 0x0001 (0x0001 - 0x0000)
struct ContainerCleaner_C_Set_Process_Screen final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_Set_Process_Screen) == 0x000001, "Wrong alignment on ContainerCleaner_C_Set_Process_Screen");
static_assert(sizeof(ContainerCleaner_C_Set_Process_Screen) == 0x000001, "Wrong size on ContainerCleaner_C_Set_Process_Screen");
static_assert(offsetof(ContainerCleaner_C_Set_Process_Screen, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ContainerCleaner_C_Set_Process_Screen::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.Set State
// 0x0001 (0x0001 - 0x0000)
struct ContainerCleaner_C_Set_State final
{
public:
	E_GenericMachine_State                        Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_Set_State) == 0x000001, "Wrong alignment on ContainerCleaner_C_Set_State");
static_assert(sizeof(ContainerCleaner_C_Set_State) == 0x000001, "Wrong size on ContainerCleaner_C_Set_State");
static_assert(offsetof(ContainerCleaner_C_Set_State, Selection) == 0x000000, "Member 'ContainerCleaner_C_Set_State::Selection' has a wrong offset!");

// Function ContainerCleaner.ContainerCleaner_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct ContainerCleaner_C_UserConstructionScript final
{
public:
	class ASoundPath_C*                           K2Node_DynamicCast_AsSound_Path;                   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AContainerSlot_C*                       K2Node_DynamicCast_AsContainer_Slot;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContainerCleaner_C_UserConstructionScript) == 0x000008, "Wrong alignment on ContainerCleaner_C_UserConstructionScript");
static_assert(sizeof(ContainerCleaner_C_UserConstructionScript) == 0x000030, "Wrong size on ContainerCleaner_C_UserConstructionScript");
static_assert(offsetof(ContainerCleaner_C_UserConstructionScript, K2Node_DynamicCast_AsSound_Path) == 0x000000, "Member 'ContainerCleaner_C_UserConstructionScript::K2Node_DynamicCast_AsSound_Path' has a wrong offset!");
static_assert(offsetof(ContainerCleaner_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'ContainerCleaner_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
