#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_Skin_Element

#include "Basic.hpp"

#include "Enum_SkinElement_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Data_Skin_Element.Data_Skin_Element_C
// 0x0040 (0x0070 - 0x0030)
class UData_Skin_Element_C : public UPrimaryDataAsset
{
public:
	class FString                                 Name_0;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	Enum_SkinElement                              Type;                                              // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Image;                                             // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         DLC;                                               // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DLC_Link;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Data_Skin_Element_C">();
	}
	static class UData_Skin_Element_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UData_Skin_Element_C>();
	}
};
static_assert(alignof(UData_Skin_Element_C) == 0x000008, "Wrong alignment on UData_Skin_Element_C");
static_assert(sizeof(UData_Skin_Element_C) == 0x000070, "Wrong size on UData_Skin_Element_C");
static_assert(offsetof(UData_Skin_Element_C, Name_0) == 0x000030, "Member 'UData_Skin_Element_C::Name_0' has a wrong offset!");
static_assert(offsetof(UData_Skin_Element_C, Type) == 0x000040, "Member 'UData_Skin_Element_C::Type' has a wrong offset!");
static_assert(offsetof(UData_Skin_Element_C, Image) == 0x000048, "Member 'UData_Skin_Element_C::Image' has a wrong offset!");
static_assert(offsetof(UData_Skin_Element_C, DLC) == 0x000050, "Member 'UData_Skin_Element_C::DLC' has a wrong offset!");
static_assert(offsetof(UData_Skin_Element_C, DLC_Link) == 0x000058, "Member 'UData_Skin_Element_C::DLC_Link' has a wrong offset!");
static_assert(offsetof(UData_Skin_Element_C, Visible) == 0x000068, "Member 'UData_Skin_Element_C::Visible' has a wrong offset!");

}

