#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_Skin_Charm

#include "Basic.hpp"

#include "Enum_SelectedColor_structs.hpp"
#include "Str_SkinMaterial_structs.hpp"


namespace SDK::Params
{

// Function Data_Skin_Charm.Data_Skin_Charm_C.Set Charm
// 0x0098 (0x0098 - 0x0000)
struct Data_Skin_Charm_C_Set_Charm final
{
public:
	class UStaticMeshComponent*                   Charm_Mesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	Enum_SelectedColor                            Color;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_SelectedColor                            Temp_byte_Variable;                                // 0x0009(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_SkinMaterial                      CallFunc_Array_Get_Item;                           // 0x0018(0x0058)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Map_Find_Value;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Map_Find_Value_1;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Data_Skin_Charm_C_Set_Charm) == 0x000008, "Wrong alignment on Data_Skin_Charm_C_Set_Charm");
static_assert(sizeof(Data_Skin_Charm_C_Set_Charm) == 0x000098, "Wrong size on Data_Skin_Charm_C_Set_Charm");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, Charm_Mesh) == 0x000000, "Member 'Data_Skin_Charm_C_Set_Charm::Charm_Mesh' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, Color) == 0x000008, "Member 'Data_Skin_Charm_C_Set_Charm::Color' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, Temp_byte_Variable) == 0x000009, "Member 'Data_Skin_Charm_C_Set_Charm::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Data_Skin_Charm_C_Set_Charm::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Data_Skin_Charm_C_Set_Charm::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Data_Skin_Charm_C_Set_Charm::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, CallFunc_Array_Get_Item) == 0x000018, "Member 'Data_Skin_Charm_C_Set_Charm::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'Data_Skin_Charm_C_Set_Charm::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'Data_Skin_Charm_C_Set_Charm::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, CallFunc_Map_Find_Value) == 0x000078, "Member 'Data_Skin_Charm_C_Set_Charm::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'Data_Skin_Charm_C_Set_Charm::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, CallFunc_Map_Find_Value_1) == 0x000088, "Member 'Data_Skin_Charm_C_Set_Charm::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, CallFunc_Map_Find_ReturnValue_1) == 0x000090, "Member 'Data_Skin_Charm_C_Set_Charm::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Charm_C_Set_Charm, CallFunc_SetStaticMesh_ReturnValue) == 0x000091, "Member 'Data_Skin_Charm_C_Set_Charm::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

