#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_Melee

#include "Basic.hpp"

#include "Data_Item_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Data_Melee.Data_Melee_C
// 0x0010 (0x02E0 - 0x02D0)
class UData_Melee_C final : public UData_Item_C
{
public:
	class UAnimMontage*                           AM_Body_Attack;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AM_Hands_Attack;                                   // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_MeleeType_C*                      Melee_Type;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Data_Melee_C">();
	}
	static class UData_Melee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UData_Melee_C>();
	}
};
static_assert(alignof(UData_Melee_C) == 0x000010, "Wrong alignment on UData_Melee_C");
static_assert(sizeof(UData_Melee_C) == 0x0002E0, "Wrong size on UData_Melee_C");
static_assert(offsetof(UData_Melee_C, AM_Body_Attack) == 0x0002C8, "Member 'UData_Melee_C::AM_Body_Attack' has a wrong offset!");
static_assert(offsetof(UData_Melee_C, AM_Hands_Attack) == 0x0002D0, "Member 'UData_Melee_C::AM_Hands_Attack' has a wrong offset!");
static_assert(offsetof(UData_Melee_C, Melee_Type) == 0x0002D8, "Member 'UData_Melee_C::Melee_Type' has a wrong offset!");

}

