#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_Gun

#include "Basic.hpp"


namespace SDK::Params
{

// Function Data_Gun.Data_Gun_C.Get Random Ammo
// 0x0018 (0x0018 - 0x0000)
struct Data_Gun_C_Get_Random_Ammo final
{
public:
	bool                                          Crate;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Data_Gun_C_Get_Random_Ammo) == 0x000004, "Wrong alignment on Data_Gun_C_Get_Random_Ammo");
static_assert(sizeof(Data_Gun_C_Get_Random_Ammo) == 0x000018, "Wrong size on Data_Gun_C_Get_Random_Ammo");
static_assert(offsetof(Data_Gun_C_Get_Random_Ammo, Crate) == 0x000000, "Member 'Data_Gun_C_Get_Random_Ammo::Crate' has a wrong offset!");
static_assert(offsetof(Data_Gun_C_Get_Random_Ammo, Value) == 0x000004, "Member 'Data_Gun_C_Get_Random_Ammo::Value' has a wrong offset!");
static_assert(offsetof(Data_Gun_C_Get_Random_Ammo, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000008, "Member 'Data_Gun_C_Get_Random_Ammo::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Gun_C_Get_Random_Ammo, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x00000C, "Member 'Data_Gun_C_Get_Random_Ammo::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Data_Gun_C_Get_Random_Ammo, CallFunc_SelectInt_ReturnValue) == 0x000010, "Member 'Data_Gun_C_Get_Random_Ammo::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Gun_C_Get_Random_Ammo, CallFunc_Clamp_ReturnValue) == 0x000014, "Member 'Data_Gun_C_Get_Random_Ammo::CallFunc_Clamp_ReturnValue' has a wrong offset!");

}

