#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_ItemThrowType

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Data_ItemThrowType.Data_ItemThrowType_C
// 0x0030 (0x0060 - 0x0030)
class UData_ItemThrowType_C final : public UPrimaryDataAsset
{
public:
	int32                                         Throw_Force;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Vertical_Force;                                    // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Vertical_Offset;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Restitution;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Gravity;                                           // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Drag;                                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Data_ItemThrowType_C">();
	}
	static class UData_ItemThrowType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UData_ItemThrowType_C>();
	}
};
static_assert(alignof(UData_ItemThrowType_C) == 0x000008, "Wrong alignment on UData_ItemThrowType_C");
static_assert(sizeof(UData_ItemThrowType_C) == 0x000060, "Wrong size on UData_ItemThrowType_C");
static_assert(offsetof(UData_ItemThrowType_C, Throw_Force) == 0x000030, "Member 'UData_ItemThrowType_C::Throw_Force' has a wrong offset!");
static_assert(offsetof(UData_ItemThrowType_C, Vertical_Force) == 0x000034, "Member 'UData_ItemThrowType_C::Vertical_Force' has a wrong offset!");
static_assert(offsetof(UData_ItemThrowType_C, Vertical_Offset) == 0x000038, "Member 'UData_ItemThrowType_C::Vertical_Offset' has a wrong offset!");
static_assert(offsetof(UData_ItemThrowType_C, Restitution) == 0x000040, "Member 'UData_ItemThrowType_C::Restitution' has a wrong offset!");
static_assert(offsetof(UData_ItemThrowType_C, Gravity) == 0x000048, "Member 'UData_ItemThrowType_C::Gravity' has a wrong offset!");
static_assert(offsetof(UData_ItemThrowType_C, Drag) == 0x000050, "Member 'UData_ItemThrowType_C::Drag' has a wrong offset!");
static_assert(offsetof(UData_ItemThrowType_C, Radius) == 0x000058, "Member 'UData_ItemThrowType_C::Radius' has a wrong offset!");

}

