#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_Skin_Ghost

#include "Basic.hpp"

#include "Enum_SelectedColor_structs.hpp"
#include "Str_SkinMaterial_structs.hpp"


namespace SDK::Params
{

// Function Data_Skin_Ghost.Data_Skin_Ghost_C.Set Ghost
// 0x01B0 (0x01B0 - 0x0000)
struct Data_Skin_Ghost_C_Set_Ghost final
{
public:
	class UStaticMeshComponent*                   Mesh_H_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_V_0;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	Enum_SelectedColor                            Color;                                             // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UData_Face_C*                           Face;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_SelectedColor                            Temp_byte_Variable;                                // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_SelectedColor                            Temp_byte_Variable_1;                              // 0x0040(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_SkinMaterial                      CallFunc_Array_Get_Item;                           // 0x0048(0x0058)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Map_Find_Value;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Map_Find_Value_1;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0108(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_SkinMaterial                      CallFunc_Array_Get_Item_2;                         // 0x0128(0x0058)(HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Map_Find_Value_2;                         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Map_Find_Value_3;                         // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Data_Skin_Ghost_C_Set_Ghost) == 0x000008, "Wrong alignment on Data_Skin_Ghost_C_Set_Ghost");
static_assert(sizeof(Data_Skin_Ghost_C_Set_Ghost) == 0x0001B0, "Wrong size on Data_Skin_Ghost_C_Set_Ghost");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Mesh_H_0) == 0x000000, "Member 'Data_Skin_Ghost_C_Set_Ghost::Mesh_H_0' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Mesh_V_0) == 0x000008, "Member 'Data_Skin_Ghost_C_Set_Ghost::Mesh_V_0' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Color) == 0x000010, "Member 'Data_Skin_Ghost_C_Set_Ghost::Color' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Face) == 0x000018, "Member 'Data_Skin_Ghost_C_Set_Ghost::Face' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Temp_byte_Variable) == 0x000020, "Member 'Data_Skin_Ghost_C_Set_Ghost::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'Data_Skin_Ghost_C_Set_Ghost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'Data_Skin_Ghost_C_Set_Ghost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'Data_Skin_Ghost_C_Set_Ghost::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'Data_Skin_Ghost_C_Set_Ghost::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Temp_int_Array_Index_Variable_2) == 0x00003C, "Member 'Data_Skin_Ghost_C_Set_Ghost::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Temp_byte_Variable_1) == 0x000040, "Member 'Data_Skin_Ghost_C_Set_Ghost::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_SetStaticMesh_ReturnValue) == 0x000041, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Array_Get_Item) == 0x000048, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Conv_BoolToString_ReturnValue) == 0x0000A0, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Map_Find_Value) == 0x0000C0, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Map_Find_ReturnValue) == 0x0000C8, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Map_Find_Value_1) == 0x0000D0, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Map_Find_ReturnValue_1) == 0x0000D8, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0000D9, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000E0, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x0000E8, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F8, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000108, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Array_Get_Item_1) == 0x000118, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000124, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Less_IntInt_ReturnValue) == 0x000125, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Array_Get_Item_2) == 0x000128, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Map_Find_Value_2) == 0x000180, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Map_Find_ReturnValue_2) == 0x000188, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Array_Length_ReturnValue_2) == 0x00018C, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Less_IntInt_ReturnValue_1) == 0x000190, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, Temp_int_Loop_Counter_Variable_2) == 0x000194, "Member 'Data_Skin_Ghost_C_Set_Ghost::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Less_IntInt_ReturnValue_2) == 0x000198, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Add_IntInt_ReturnValue_2) == 0x00019C, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Map_Find_Value_3) == 0x0001A0, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(Data_Skin_Ghost_C_Set_Ghost, CallFunc_Map_Find_ReturnValue_3) == 0x0001A8, "Member 'Data_Skin_Ghost_C_Set_Ghost::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");

}

