#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Discord_Plane_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Discord_Plane_Blueprint.Discord_Plane_Blueprint_C
// 0x0020 (0x02C8 - 0x02A8)
class ADiscord_Plane_Blueprint_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Material;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Discord_Plane_Blueprint(int32 EntryPoint);
	void Go_Crab();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Discord_Plane_Blueprint_C">();
	}
	static class ADiscord_Plane_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADiscord_Plane_Blueprint_C>();
	}
};
static_assert(alignof(ADiscord_Plane_Blueprint_C) == 0x000008, "Wrong alignment on ADiscord_Plane_Blueprint_C");
static_assert(sizeof(ADiscord_Plane_Blueprint_C) == 0x0002C8, "Wrong size on ADiscord_Plane_Blueprint_C");
static_assert(offsetof(ADiscord_Plane_Blueprint_C, UberGraphFrame) == 0x0002A8, "Member 'ADiscord_Plane_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADiscord_Plane_Blueprint_C, StaticMeshComponent0) == 0x0002B0, "Member 'ADiscord_Plane_Blueprint_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ADiscord_Plane_Blueprint_C, Scene) == 0x0002B8, "Member 'ADiscord_Plane_Blueprint_C::Scene' has a wrong offset!");
static_assert(offsetof(ADiscord_Plane_Blueprint_C, Material) == 0x0002C0, "Member 'ADiscord_Plane_Blueprint_C::Material' has a wrong offset!");

}

