#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DLC_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DLC_Button.DLC_Button_C
// 0x0028 (0x02D0 - 0x02A8)
class ADLC_Button_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Button;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 URL;                                               // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DLC_Button(int32 EntryPoint);
	void Open_Link();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DLC_Button_C">();
	}
	static class ADLC_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADLC_Button_C>();
	}
};
static_assert(alignof(ADLC_Button_C) == 0x000008, "Wrong alignment on ADLC_Button_C");
static_assert(sizeof(ADLC_Button_C) == 0x0002D0, "Wrong size on ADLC_Button_C");
static_assert(offsetof(ADLC_Button_C, UberGraphFrame) == 0x0002A8, "Member 'ADLC_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADLC_Button_C, Button) == 0x0002B0, "Member 'ADLC_Button_C::Button' has a wrong offset!");
static_assert(offsetof(ADLC_Button_C, DefaultSceneRoot) == 0x0002B8, "Member 'ADLC_Button_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ADLC_Button_C, URL) == 0x0002C0, "Member 'ADLC_Button_C::URL' has a wrong offset!");

}

