#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Door_Unlocker

#include "Basic.hpp"

#include "Str_ItemState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Door_Unlocker.Door_Unlocker_C.ExecuteUbergraph_Door_Unlocker
// 0x05A0 (0x05A0 - 0x0000)
struct Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable;                                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location;                        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_1;                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_1;                      // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Path_Distance_2;                      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_2;                      // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_3;                      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_3;                      // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_4;         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_4;                      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_4;                      // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_5;         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_5;                      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_5;                      // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_6;         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_6;                      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_6;                      // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0220(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALocked_Door_C*                         CallFunc_Array_Get_Item;                           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25E[0x2];                                      // 0x025E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALocked_Door_C*                         CallFunc_Array_Get_Item_1;                         // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0278(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0378(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0478(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput; // 0x0578(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1; // 0x0588(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast_1; // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker) == 0x000008, "Wrong alignment on Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker");
static_assert(sizeof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker) == 0x0005A0, "Wrong size on Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, EntryPoint) == 0x000000, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::EntryPoint' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, Temp_real_Variable) == 0x000008, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, Temp_real_Variable_1) == 0x000010, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_IsValid_ReturnValue_2) == 0x000032, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_HasAuthority_ReturnValue) == 0x00003C, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_HasAuthority_ReturnValue_1) == 0x00003D, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_BreakVector_X) == 0x000040, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_BreakVector_Y) == 0x000048, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_BreakVector_Z) == 0x000050, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_MakeVector_ReturnValue_1) == 0x000058, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, Temp_byte_Variable) == 0x000071, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Select_Default) == 0x000078, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_MakeVector_ReturnValue_2) == 0x000080, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000098, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Distance) == 0x0000A0, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Distance' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Location) == 0x0000A8, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Location' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_IsValid_ReturnValue_4) == 0x0000C0, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0000C8, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Distance_1) == 0x0000D0, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Distance_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Location_1) == 0x0000D8, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Location_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x0000F0, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_HasAuthority_ReturnValue_2) == 0x0000F8, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Distance_2) == 0x000100, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Distance_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Location_2) == 0x000108, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Location_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_IsValid_ReturnValue_5) == 0x000120, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x000128, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Distance_3) == 0x000130, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Distance_3' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Location_3) == 0x000138, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Location_3' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, Temp_int_Array_Index_Variable) == 0x000150, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_HasAuthority_ReturnValue_3) == 0x000154, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_MakeLiteralByte_ReturnValue) == 0x000155, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_SwitchEnum_CmpSuccess) == 0x000156, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SpawnSoundAttached_ReturnValue_4) == 0x000158, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SpawnSoundAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Distance_4) == 0x000160, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Distance_4' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Location_4) == 0x000168, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Location_4' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SpawnSoundAttached_ReturnValue_5) == 0x000180, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SpawnSoundAttached_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Distance_5) == 0x000188, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Distance_5' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Location_5) == 0x000190, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Location_5' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_IsValid_ReturnValue_6) == 0x0001A8, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SpawnSoundAttached_ReturnValue_6) == 0x0001B0, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SpawnSoundAttached_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Distance_6) == 0x0001B8, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Distance_6' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Get_Path_Location_6) == 0x0001C0, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Get_Path_Location_6' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Event_Index_2) == 0x0001D8, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Event_Source_2) == 0x0001E0, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Event_Item_State_2) == 0x0001E8, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Event_Index_1) == 0x0001F0, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Event_Source_1) == 0x0001F8, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Event_Item_State_1) == 0x000200, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Event_Index) == 0x000208, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Event_Source) == 0x000210, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_Event_Item_State) == 0x000218, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_CreateDelegate_OutputDelegate) == 0x000220, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_GetGameMode_ReturnValue) == 0x000230, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_DynamicCast_AsGM) == 0x000238, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_SwitchEnum_CmpSuccess_1) == 0x000241, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Array_Get_Item) == 0x000248, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, Temp_int_Loop_Counter_Variable_1) == 0x000254, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Array_Length_ReturnValue_1) == 0x000258, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Less_IntInt_ReturnValue) == 0x00025C, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Less_IntInt_ReturnValue_1) == 0x00025D, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Add_IntInt_ReturnValue_1) == 0x000260, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, Temp_int_Array_Index_Variable_1) == 0x000264, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_Array_Get_Item_1) == 0x000268, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_HasAuthority_ReturnValue_4) == 0x000270, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000271, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, K2Node_SwitchEnum_CmpSuccess_2) == 0x000272, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000278, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000378, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000478, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SetFloatParameter_self_CastInput) == 0x000578, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000588, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x000598, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker, CallFunc_SetFloatParameter_InFloat_ImplicitCast_1) == 0x00059C, "Member 'Door_Unlocker_C_ExecuteUbergraph_Door_Unlocker::CallFunc_SetFloatParameter_InFloat_ImplicitCast_1' has a wrong offset!");

// Function Door_Unlocker.Door_Unlocker_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct Door_Unlocker_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_Unlocker_C_Get_Key) == 0x000008, "Wrong alignment on Door_Unlocker_C_Get_Key");
static_assert(sizeof(Door_Unlocker_C_Get_Key) == 0x000008, "Wrong size on Door_Unlocker_C_Get_Key");
static_assert(offsetof(Door_Unlocker_C_Get_Key, Key) == 0x000000, "Member 'Door_Unlocker_C_Get_Key::Key' has a wrong offset!");

// Function Door_Unlocker.Door_Unlocker_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct Door_Unlocker_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_Unlocker_C_Get_Name) == 0x000008, "Wrong alignment on Door_Unlocker_C_Get_Name");
static_assert(sizeof(Door_Unlocker_C_Get_Name) == 0x000018, "Wrong size on Door_Unlocker_C_Get_Name");
static_assert(offsetof(Door_Unlocker_C_Get_Name, Mec) == 0x000000, "Member 'Door_Unlocker_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_Get_Name, Name_0) == 0x000008, "Member 'Door_Unlocker_C_Get_Name::Name_0' has a wrong offset!");

// Function Door_Unlocker.Door_Unlocker_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct Door_Unlocker_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_Unlocker_C_Local_Interaction) == 0x000008, "Wrong alignment on Door_Unlocker_C_Local_Interaction");
static_assert(sizeof(Door_Unlocker_C_Local_Interaction) == 0x000018, "Wrong size on Door_Unlocker_C_Local_Interaction");
static_assert(offsetof(Door_Unlocker_C_Local_Interaction, Index_0) == 0x000000, "Member 'Door_Unlocker_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_Local_Interaction, Source) == 0x000008, "Member 'Door_Unlocker_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_Local_Interaction, Item_State) == 0x000010, "Member 'Door_Unlocker_C_Local_Interaction::Item_State' has a wrong offset!");

// Function Door_Unlocker.Door_Unlocker_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct Door_Unlocker_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_Unlocker_C_Net_Interaction) == 0x000008, "Wrong alignment on Door_Unlocker_C_Net_Interaction");
static_assert(sizeof(Door_Unlocker_C_Net_Interaction) == 0x000018, "Wrong size on Door_Unlocker_C_Net_Interaction");
static_assert(offsetof(Door_Unlocker_C_Net_Interaction, Index_0) == 0x000000, "Member 'Door_Unlocker_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_Net_Interaction, Source) == 0x000008, "Member 'Door_Unlocker_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_Net_Interaction, Item_State) == 0x000010, "Member 'Door_Unlocker_C_Net_Interaction::Item_State' has a wrong offset!");

// Function Door_Unlocker.Door_Unlocker_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct Door_Unlocker_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_Unlocker_C_Other_Interaction) == 0x000008, "Wrong alignment on Door_Unlocker_C_Other_Interaction");
static_assert(sizeof(Door_Unlocker_C_Other_Interaction) == 0x000018, "Wrong size on Door_Unlocker_C_Other_Interaction");
static_assert(offsetof(Door_Unlocker_C_Other_Interaction, Index_0) == 0x000000, "Member 'Door_Unlocker_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_Other_Interaction, Source) == 0x000008, "Member 'Door_Unlocker_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_Other_Interaction, Item_State) == 0x000010, "Member 'Door_Unlocker_C_Other_Interaction::Item_State' has a wrong offset!");

// Function Door_Unlocker.Door_Unlocker_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct Door_Unlocker_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASoundPath_C*                           K2Node_DynamicCast_AsSound_Path;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemSlot_C*                            K2Node_DynamicCast_AsItem_Slot;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_Unlocker_C_UserConstructionScript) == 0x000008, "Wrong alignment on Door_Unlocker_C_UserConstructionScript");
static_assert(sizeof(Door_Unlocker_C_UserConstructionScript) == 0x000030, "Wrong size on Door_Unlocker_C_UserConstructionScript");
static_assert(offsetof(Door_Unlocker_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'Door_Unlocker_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_Unlocker_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Door_Unlocker_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
