#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Explosion.Explosion_C.ExecuteUbergraph_Explosion
// 0x01C0 (0x01C0 - 0x0000)
struct Explosion_C_ExecuteUbergraph_Explosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_C4Blast_FX_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMec_C*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x00E0(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x01B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_C_ExecuteUbergraph_Explosion) == 0x000010, "Wrong alignment on Explosion_C_ExecuteUbergraph_Explosion");
static_assert(sizeof(Explosion_C_ExecuteUbergraph_Explosion) == 0x0001C0, "Wrong size on Explosion_C_ExecuteUbergraph_Explosion");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, EntryPoint) == 0x000000, "Member 'Explosion_C_ExecuteUbergraph_Explosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, Temp_int_Variable) == 0x000080, "Member 'Explosion_C_ExecuteUbergraph_Explosion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, Temp_object_Variable) == 0x000088, "Member 'Explosion_C_ExecuteUbergraph_Explosion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, Temp_object_Variable_1) == 0x000090, "Member 'Explosion_C_ExecuteUbergraph_Explosion::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, Temp_int_Array_Index_Variable) == 0x000098, "Member 'Explosion_C_ExecuteUbergraph_Explosion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_BreakVector_X) == 0x0000A0, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_BreakVector_Y) == 0x0000A8, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_BreakVector_Z) == 0x0000B0, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000B8, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, Temp_int_Loop_Counter_Variable) == 0x0000D0, "Member 'Explosion_C_ExecuteUbergraph_Explosion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_HasAuthority_ReturnValue) == 0x0000D4, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_HasAuthority_ReturnValue_1) == 0x0000DC, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_HasAuthority_ReturnValue_2) == 0x0000DD, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000E0, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_Array_Get_Item) == 0x000108, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000118, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_Less_IntInt_ReturnValue) == 0x000130, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_Vector_Distance_ReturnValue) == 0x000138, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000140, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000148, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000160, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000168, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000180, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000198, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, K2Node_Select_Default) == 0x0001A0, "Member 'Explosion_C_ExecuteUbergraph_Explosion::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0001A8, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_Explosion, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x0001B0, "Member 'Explosion_C_ExecuteUbergraph_Explosion::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function Explosion.Explosion_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Explosion_C_UserConstructionScript final
{
public:
	class ASoundPath_C*                           K2Node_DynamicCast_AsSound_Path;                   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_C_UserConstructionScript) == 0x000008, "Wrong alignment on Explosion_C_UserConstructionScript");
static_assert(sizeof(Explosion_C_UserConstructionScript) == 0x000010, "Wrong size on Explosion_C_UserConstructionScript");
static_assert(offsetof(Explosion_C_UserConstructionScript, K2Node_DynamicCast_AsSound_Path) == 0x000000, "Member 'Explosion_C_UserConstructionScript::K2Node_DynamicCast_AsSound_Path' has a wrong offset!");
static_assert(offsetof(Explosion_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Explosion_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

