#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fish_Machine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Fish_Machine.Fish_Machine_C
// 0x0070 (0x0318 - 0x02A8)
class AFish_Machine_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   MapMesh_TaskMachine_PizzushiCooker_FishSlot;       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CA_Button_3;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CA_Button_2;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CA_Container;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CA_Button_1;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Container_Placed;                                  // 0x02E8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Process;                                           // 0x02EC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AButton_C*                              Button_1;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Fish_Slot;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Step;                                              // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Fish_Type;                                         // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AButton_C*                              Button_2;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AButton_C*                              Button_3;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void All_Set_Step(int32 Step_0, int32 Fish_Type_0);
	void BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature(class AMec_C* Source);
	void BndEvt__Centrifuge_Sample_K2Node_ComponentBoundEvent_1_Take_Item__DelegateSignature();
	void BndEvt__Fish_Machine_Button_2_K2Node_ComponentBoundEvent_5_Button_Push__DelegateSignature(class AMec_C* Source);
	void BndEvt__Fish_Machine_Button_3_K2Node_ComponentBoundEvent_6_Button_Push__DelegateSignature(class AMec_C* Source);
	void Clear();
	void ExecuteUbergraph_Fish_Machine(int32 EntryPoint);
	void Get_Key(class AActor** Key);
	void Get_Name(class AMec_C* Mec, class FString* Name_0);
	void Local_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Net_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Other_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fish_Machine_C">();
	}
	static class AFish_Machine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFish_Machine_C>();
	}
};
static_assert(alignof(AFish_Machine_C) == 0x000008, "Wrong alignment on AFish_Machine_C");
static_assert(sizeof(AFish_Machine_C) == 0x000318, "Wrong size on AFish_Machine_C");
static_assert(offsetof(AFish_Machine_C, UberGraphFrame) == 0x0002A8, "Member 'AFish_Machine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, MapMesh_TaskMachine_PizzushiCooker_FishSlot) == 0x0002B0, "Member 'AFish_Machine_C::MapMesh_TaskMachine_PizzushiCooker_FishSlot' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, CA_Button_3) == 0x0002B8, "Member 'AFish_Machine_C::CA_Button_3' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, CA_Button_2) == 0x0002C0, "Member 'AFish_Machine_C::CA_Button_2' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, TextRender) == 0x0002C8, "Member 'AFish_Machine_C::TextRender' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, CA_Container) == 0x0002D0, "Member 'AFish_Machine_C::CA_Container' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, CA_Button_1) == 0x0002D8, "Member 'AFish_Machine_C::CA_Button_1' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, Root) == 0x0002E0, "Member 'AFish_Machine_C::Root' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, Container_Placed) == 0x0002E8, "Member 'AFish_Machine_C::Container_Placed' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, Process) == 0x0002EC, "Member 'AFish_Machine_C::Process' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, Button_1) == 0x0002F0, "Member 'AFish_Machine_C::Button_1' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, Fish_Slot) == 0x0002F8, "Member 'AFish_Machine_C::Fish_Slot' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, Step) == 0x000300, "Member 'AFish_Machine_C::Step' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, Fish_Type) == 0x000304, "Member 'AFish_Machine_C::Fish_Type' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, Button_2) == 0x000308, "Member 'AFish_Machine_C::Button_2' has a wrong offset!");
static_assert(offsetof(AFish_Machine_C, Button_3) == 0x000310, "Member 'AFish_Machine_C::Button_3' has a wrong offset!");

}

