#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Item_Placer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Item_Placer.Item_Placer_C.ExecuteUbergraph_Item_Placer
// 0x0150 (0x0150 - 0x0000)
struct Item_Placer_C_ExecuteUbergraph_Item_Placer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWorldItem_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_Placer_C_ExecuteUbergraph_Item_Placer) == 0x000010, "Wrong alignment on Item_Placer_C_ExecuteUbergraph_Item_Placer");
static_assert(sizeof(Item_Placer_C_ExecuteUbergraph_Item_Placer) == 0x000150, "Wrong size on Item_Placer_C_ExecuteUbergraph_Item_Placer");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, EntryPoint) == 0x000000, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_BreakTransform_Location) == 0x000070, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_BreakRotator_Roll) == 0x0000B8, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_BreakRotator_Pitch) == 0x0000BC, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_BreakRotator_Yaw) == 0x0000C0, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000130, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_FinishSpawningActor_ReturnValue) == 0x000138, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_RandomInteger_ReturnValue) == 0x000140, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_Greater_IntInt_ReturnValue) == 0x000144, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_ExecuteUbergraph_Item_Placer, CallFunc_SetDoublePropertyByName_Value_ImplicitCast) == 0x000148, "Member 'Item_Placer_C_ExecuteUbergraph_Item_Placer::CallFunc_SetDoublePropertyByName_Value_ImplicitCast' has a wrong offset!");

// Function Item_Placer.Item_Placer_C.UserConstructionScript
// 0x0160 (0x0160 - 0x0000)
struct Item_Placer_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0050(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AItemDynamicMesh_C*                     K2Node_DynamicCast_AsItem_Dynamic_Mesh;            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_Placer_C_UserConstructionScript) == 0x000008, "Wrong alignment on Item_Placer_C_UserConstructionScript");
static_assert(sizeof(Item_Placer_C_UserConstructionScript) == 0x000160, "Wrong size on Item_Placer_C_UserConstructionScript");
static_assert(offsetof(Item_Placer_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000000, "Member 'Item_Placer_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x000018, "Member 'Item_Placer_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000030, "Member 'Item_Placer_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Item_Placer_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_UserConstructionScript, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000050, "Member 'Item_Placer_C_UserConstructionScript::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_UserConstructionScript, K2Node_DynamicCast_AsItem_Dynamic_Mesh) == 0x000150, "Member 'Item_Placer_C_UserConstructionScript::K2Node_DynamicCast_AsItem_Dynamic_Mesh' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'Item_Placer_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Item_Placer_C_UserConstructionScript, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x00015C, "Member 'Item_Placer_C_UserConstructionScript::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");

}

