#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Str_ItemState_structs.hpp"


namespace SDK::Params
{

// Function Item.Item_C.All Impact Sound
// 0x0008 (0x0008 - 0x0000)
struct Item_C_All_Impact_Sound final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_All_Impact_Sound) == 0x000008, "Wrong alignment on Item_C_All_Impact_Sound");
static_assert(sizeof(Item_C_All_Impact_Sound) == 0x000008, "Wrong size on Item_C_All_Impact_Sound");
static_assert(offsetof(Item_C_All_Impact_Sound, Value) == 0x000000, "Member 'Item_C_All_Impact_Sound::Value' has a wrong offset!");

// Function Item.Item_C.BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local Trigger__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local_Trigger__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         State;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local_Trigger__DelegateSignature) == 0x000008, "Wrong alignment on Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local_Trigger__DelegateSignature");
static_assert(sizeof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local_Trigger__DelegateSignature) == 0x000010, "Wrong size on Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local_Trigger__DelegateSignature");
static_assert(offsetof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local_Trigger__DelegateSignature, Source) == 0x000000, "Member 'Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local_Trigger__DelegateSignature::Source' has a wrong offset!");
static_assert(offsetof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local_Trigger__DelegateSignature, State) == 0x000008, "Member 'Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_3_Local_Trigger__DelegateSignature::State' has a wrong offset!");

// Function Item.Item_C.BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_4_Focus__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_4_Focus__DelegateSignature final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_4_Focus__DelegateSignature) == 0x000001, "Wrong alignment on Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_4_Focus__DelegateSignature");
static_assert(sizeof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_4_Focus__DelegateSignature) == 0x000001, "Wrong size on Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_4_Focus__DelegateSignature");
static_assert(offsetof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_4_Focus__DelegateSignature, TRUE_0) == 0x000000, "Member 'Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_4_Focus__DelegateSignature::TRUE_0' has a wrong offset!");

// Function Item.Item_C.BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_5_Focusable__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_5_Focusable__DelegateSignature final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_5_Focusable__DelegateSignature) == 0x000001, "Wrong alignment on Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_5_Focusable__DelegateSignature");
static_assert(sizeof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_5_Focusable__DelegateSignature) == 0x000001, "Wrong size on Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_5_Focusable__DelegateSignature");
static_assert(offsetof(Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_5_Focusable__DelegateSignature, TRUE_0) == 0x000000, "Member 'Item_C_BndEvt__Item_Interaction_K2Node_ComponentBoundEvent_5_Focusable__DelegateSignature::TRUE_0' has a wrong offset!");

// Function Item.Item_C.BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature) == 0x000008, "Wrong alignment on Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature");
static_assert(sizeof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature) == 0x000010, "Wrong size on Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature");
static_assert(offsetof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature, SleepingComponent) == 0x000000, "Member 'Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature::SleepingComponent' has a wrong offset!");
static_assert(offsetof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature, BoneName) == 0x000008, "Member 'Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature::BoneName' has a wrong offset!");

// Function Item.Item_C.BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    WakingComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature) == 0x000008, "Wrong alignment on Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature");
static_assert(sizeof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature) == 0x000010, "Wrong size on Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature");
static_assert(offsetof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature, WakingComponent) == 0x000000, "Member 'Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature::WakingComponent' has a wrong offset!");
static_assert(offsetof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature, BoneName) == 0x000008, "Member 'Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentWakeSignature__DelegateSignature::BoneName' has a wrong offset!");

// Function Item.Item_C.BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature
// 0x0130 (0x0130 - 0x0000)
struct Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x0100)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature) == 0x000130, "Wrong size on Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'Item_C_BndEvt__World_Item_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function Item.Item_C.ExecuteUbergraph_Item
// 0x0840 (0x0840 - 0x0000)
struct Item_C_ExecuteUbergraph_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_SleepingComponent;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_BoneName_1;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_WakingComponent;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_BoneName;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0088(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Value;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x028C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_ComponentBoundEvent_State;                  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_True_1;                 // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_True;                   // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x02C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0320(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue;     // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Delta__;                                  // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformRotation_ReturnValue;            // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x03E8(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Delta___1;                                // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0538(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0550(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Delta___2;                                // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0588(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0688(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_Constant_ReturnValue;           // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue_1;                  // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0710(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        K2Node_VariableSet_Place_Marge_ImplicitCast;       // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Set_Volume_Volume_ImplicitCast;           // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Set_Pitch_Pitch_ImplicitCast;             // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast;         // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast_1;       // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_Constant_DeltaTime_ImplicitCast; // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_ExecuteUbergraph_Item) == 0x000010, "Wrong alignment on Item_C_ExecuteUbergraph_Item");
static_assert(sizeof(Item_C_ExecuteUbergraph_Item) == 0x000840, "Wrong size on Item_C_ExecuteUbergraph_Item");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, EntryPoint) == 0x000000, "Member 'Item_C_ExecuteUbergraph_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_SleepingComponent) == 0x000010, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_SleepingComponent' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_BoneName_1) == 0x000018, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_BoneName_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_HasAuthority_ReturnValue_2) == 0x000020, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_WakingComponent) == 0x000028, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_WakingComponent' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_BoneName) == 0x000030, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_BoneName' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_HasAuthority_ReturnValue_3) == 0x000038, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_HasAuthority_ReturnValue_4) == 0x000039, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Conv_IntToVector_ReturnValue) == 0x000040, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_HitComponent) == 0x000058, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_OtherActor) == 0x000060, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_OtherComp) == 0x000068, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000070, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_Hit) == 0x000088, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_VSize_ReturnValue) == 0x000188, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000190, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_GetPlayerPawn_ReturnValue) == 0x000198, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_DynamicCast_AsMec) == 0x0001A0, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_CustomEvent_Value) == 0x0001B0, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_MapRangeClamped_ReturnValue) == 0x0001B8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001C0, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0001C8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0001D0, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_IsValid_ReturnValue) == 0x0001D8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_GetComponentVelocity_ReturnValue) == 0x0001E0, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_VSize_ReturnValue_1) == 0x0001F8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000200, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_SwitchEnum_CmpSuccess) == 0x000208, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_SwitchEnum_CmpSuccess_1) == 0x000209, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000210, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_FindLookAtRotation_ReturnValue) == 0x000228, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_GetForwardVector_ReturnValue) == 0x000240, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000258, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Not_PreBool_ReturnValue) == 0x000270, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_BooleanAND_ReturnValue) == 0x000271, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_SwitchEnum_CmpSuccess_2) == 0x000272, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_SwitchEnum_CmpSuccess_3) == 0x000273, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_GetGameMode_ReturnValue) == 0x000278, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_DynamicCast_AsGM) == 0x000280, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_DynamicCast_bSuccess_1) == 0x000288, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_CreateDelegate_OutputDelegate) == 0x00028C, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_Source) == 0x0002A0, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_Source' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_State) == 0x0002A8, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_State' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_True_1) == 0x0002B0, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_True_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_ComponentBoundEvent_True) == 0x0002B1, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_ComponentBoundEvent_True' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_SelectInt_ReturnValue) == 0x0002B4, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0002C0, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000320, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_InverseTransformRotation_ReturnValue) == 0x000380, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_InverseTransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Delta__) == 0x000398, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Delta__' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_RInterpTo_ReturnValue) == 0x0003A0, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0003B8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_TransformRotation_ReturnValue) == 0x0003D0, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_TransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0003E8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Delta___1) == 0x0004E8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Delta___1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0004F0, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000508, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Add_VectorVector_ReturnValue) == 0x000520, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_SelectVector_ReturnValue) == 0x000538, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_SelectVector_ReturnValue_1) == 0x000550, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Delta___2) == 0x000568, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Delta___2' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_VInterpTo_ReturnValue) == 0x000570, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000588, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_MakeVector_ReturnValue) == 0x000688, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_SwitchEnum_CmpSuccess_4) == 0x0006A0, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0006A8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0006B0, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0006C8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_VInterpTo_Constant_ReturnValue) == 0x0006E0, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_VInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_VInterpTo_ReturnValue_1) == 0x0006F8, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_VInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000710, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, K2Node_VariableSet_Place_Marge_ImplicitCast) == 0x000810, "Member 'Item_C_ExecuteUbergraph_Item::K2Node_VariableSet_Place_Marge_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Set_Volume_Volume_ImplicitCast) == 0x000818, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Set_Volume_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Set_Pitch_Pitch_ImplicitCast) == 0x00081C, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Set_Pitch_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_Delay_Duration_ImplicitCast) == 0x000820, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x000824, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_VInterpTo_DeltaTime_ImplicitCast) == 0x000828, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_VInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_VInterpTo_DeltaTime_ImplicitCast_1) == 0x00082C, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_VInterpTo_DeltaTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Item_C_ExecuteUbergraph_Item, CallFunc_VInterpTo_Constant_DeltaTime_ImplicitCast) == 0x000830, "Member 'Item_C_ExecuteUbergraph_Item::CallFunc_VInterpTo_Constant_DeltaTime_ImplicitCast' has a wrong offset!");

// Function Item.Item_C.Initiate
// 0x0128 (0x0128 - 0x0000)
struct Item_C_Initiate final
{
public:
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0010(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_Initiate) == 0x000008, "Wrong alignment on Item_C_Initiate");
static_assert(sizeof(Item_C_Initiate) == 0x000128, "Wrong size on Item_C_Initiate");
static_assert(offsetof(Item_C_Initiate, CallFunc_Concat_StrStr_ReturnValue) == 0x000000, "Member 'Item_C_Initiate::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Initiate, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000010, "Member 'Item_C_Initiate::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Item_C_Initiate, CallFunc_RandomFloatInRange_ReturnValue) == 0x000110, "Member 'Item_C_Initiate::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Initiate, CallFunc_K2_SetTimer_ReturnValue) == 0x000118, "Member 'Item_C_Initiate::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Initiate, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000120, "Member 'Item_C_Initiate::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function Item.Item_C.OnRep_Mesh
// 0x0001 (0x0001 - 0x0000)
struct Item_C_OnRep_Mesh final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_OnRep_Mesh) == 0x000001, "Wrong alignment on Item_C_OnRep_Mesh");
static_assert(sizeof(Item_C_OnRep_Mesh) == 0x000001, "Wrong size on Item_C_OnRep_Mesh");
static_assert(offsetof(Item_C_OnRep_Mesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'Item_C_OnRep_Mesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function Item.Item_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Item_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_ReceiveTick) == 0x000004, "Wrong alignment on Item_C_ReceiveTick");
static_assert(sizeof(Item_C_ReceiveTick) == 0x000004, "Wrong size on Item_C_ReceiveTick");
static_assert(offsetof(Item_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Item_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Item.Item_C.Set Movement
// 0x0050 (0x0050 - 0x0000)
struct Item_C_Set_Movement final
{
public:
	bool                                          Velocity;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Item_C_Set_Movement) == 0x000008, "Wrong alignment on Item_C_Set_Movement");
static_assert(sizeof(Item_C_Set_Movement) == 0x000050, "Wrong size on Item_C_Set_Movement");
static_assert(offsetof(Item_C_Set_Movement, Velocity) == 0x000000, "Member 'Item_C_Set_Movement::Velocity' has a wrong offset!");
static_assert(offsetof(Item_C_Set_Movement, CallFunc_GetComponentVelocity_ReturnValue) == 0x000008, "Member 'Item_C_Set_Movement::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Set_Movement, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'Item_C_Set_Movement::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_Set_Movement, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000038, "Member 'Item_C_Set_Movement::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");

// Function Item.Item_C.Update Shadow
// 0x0001 (0x0001 - 0x0000)
struct Item_C_Update_Shadow final
{
public:
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_Update_Shadow) == 0x000001, "Wrong alignment on Item_C_Update_Shadow");
static_assert(sizeof(Item_C_Update_Shadow) == 0x000001, "Wrong size on Item_C_Update_Shadow");
static_assert(offsetof(Item_C_Update_Shadow, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000000, "Member 'Item_C_Update_Shadow::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");

// Function Item.Item_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct Item_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UData_Gun_C*                            K2Node_DynamicCast_AsData_Gun;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASoundSource_C*                         K2Node_DynamicCast_AsSound_Source;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInteraction_C*                         K2Node_DynamicCast_AsInteraction;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Item_C_UserConstructionScript) == 0x000008, "Wrong alignment on Item_C_UserConstructionScript");
static_assert(sizeof(Item_C_UserConstructionScript) == 0x000038, "Wrong size on Item_C_UserConstructionScript");
static_assert(offsetof(Item_C_UserConstructionScript, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'Item_C_UserConstructionScript::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Item_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Item_C_UserConstructionScript, CallFunc_HasAuthority_ReturnValue_1) == 0x000002, "Member 'Item_C_UserConstructionScript::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
