#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Item_Spawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Str_ItemSpawnLocation_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Item_Spawner.Item_Spawner_C
// 0x0030 (0x02D8 - 0x02A8)
class AItem_Spawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Used;                                              // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Zone;                                              // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 Location;                                          // 0x02D0(0x0002)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Clear_Used();
	void ExecuteUbergraph_Item_Spawner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Spawn_Item(const struct FStr_Item& Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Item_Spawner_C">();
	}
	static class AItem_Spawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItem_Spawner_C>();
	}
};
static_assert(alignof(AItem_Spawner_C) == 0x000008, "Wrong alignment on AItem_Spawner_C");
static_assert(sizeof(AItem_Spawner_C) == 0x0002D8, "Wrong size on AItem_Spawner_C");
static_assert(offsetof(AItem_Spawner_C, UberGraphFrame) == 0x0002A8, "Member 'AItem_Spawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AItem_Spawner_C, Arrow) == 0x0002B0, "Member 'AItem_Spawner_C::Arrow' has a wrong offset!");
static_assert(offsetof(AItem_Spawner_C, Cylinder) == 0x0002B8, "Member 'AItem_Spawner_C::Cylinder' has a wrong offset!");
static_assert(offsetof(AItem_Spawner_C, Root) == 0x0002C0, "Member 'AItem_Spawner_C::Root' has a wrong offset!");
static_assert(offsetof(AItem_Spawner_C, Used) == 0x0002C8, "Member 'AItem_Spawner_C::Used' has a wrong offset!");
static_assert(offsetof(AItem_Spawner_C, Zone) == 0x0002CC, "Member 'AItem_Spawner_C::Zone' has a wrong offset!");
static_assert(offsetof(AItem_Spawner_C, Location) == 0x0002D0, "Member 'AItem_Spawner_C::Location' has a wrong offset!");

}

