#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemSpawn_Handler

#include "Basic.hpp"

#include "Str_ItemSpawnLocation_structs.hpp"
#include "Str_ItemPlacerRef_structs.hpp"
#include "Str_ItemSpawnRef_structs.hpp"
#include "Str_ItemSpawnRequest_structs.hpp"
#include "Str_Item_structs.hpp"
#include "Enum_Sectors_structs.hpp"


namespace SDK::Params
{

// Function ItemSpawn_Handler.ItemSpawn_Handler_C.ExecuteUbergraph_ItemSpawn_Handler
// 0x01A0 (0x01A0 - 0x0000)
struct ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStr_ItemSpawnLocation>         CallFunc_Map_Keys_Keys;                            // 0x0020(0x0010)(ReferenceParm)
	struct FStr_ItemSpawnLocation                 CallFunc_Array_Get_Item;                           // 0x0030(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRef                      CallFunc_Map_Find_Value;                           // 0x0060(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnLocation>         CallFunc_Map_Keys_Keys_1;                          // 0x00E8(0x0010)(ReferenceParm)
	struct FStr_ItemSpawnLocation                 CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemPlacerRef                     CallFunc_Map_Find_Value_1;                         // 0x0100(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue_1;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler) == 0x000008, "Wrong alignment on ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler");
static_assert(sizeof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler) == 0x0001A0, "Wrong size on ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, EntryPoint) == 0x000000, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Map_Keys_Keys) == 0x000020, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Array_Get_Item) == 0x000030, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Conv_ByteToString_ReturnValue) == 0x000040, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000050, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Map_Find_Value) == 0x000060, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A8, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Conv_IntToString_ReturnValue) == 0x0000B8, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000C8, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000D8, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Map_Keys_Keys_1) == 0x0000E8, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Array_Length_ReturnValue_2) == 0x0000FC, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Map_Find_Value_1) == 0x000100, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Map_Find_ReturnValue_1) == 0x000118, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Less_IntInt_ReturnValue_1) == 0x000119, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Array_Length_ReturnValue_3) == 0x00011C, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000120, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Conv_ByteToString_ReturnValue_1) == 0x000130, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Conv_ByteToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000140, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000150, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000160, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000170, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000180, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000190, "Member 'ItemSpawn_Handler_C_ExecuteUbergraph_ItemSpawn_Handler::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");

// Function ItemSpawn_Handler.ItemSpawn_Handler_C.Place Items
// 0x0050 (0x0050 - 0x0000)
struct ItemSpawn_Handler_C_Place_Items final
{
public:
	struct FStr_ItemSpawnRequest                  NewLocalVar;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  _Selected_Sector;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AItem_Spawner_C*>                _Spanwers;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FStr_ItemSpawnLocation>         _Locations;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	struct FStr_ItemSpawnLocation                 _Selected_Spawner;                                 // 0x0030(0x0002)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AItem_Placer_C*                         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemSpawn_Handler_C_Place_Items) == 0x000008, "Wrong alignment on ItemSpawn_Handler_C_Place_Items");
static_assert(sizeof(ItemSpawn_Handler_C_Place_Items) == 0x000050, "Wrong size on ItemSpawn_Handler_C_Place_Items");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, NewLocalVar) == 0x000000, "Member 'ItemSpawn_Handler_C_Place_Items::NewLocalVar' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, _Selected_Sector) == 0x000008, "Member 'ItemSpawn_Handler_C_Place_Items::_Selected_Sector' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, _Spanwers) == 0x000010, "Member 'ItemSpawn_Handler_C_Place_Items::_Spanwers' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, _Locations) == 0x000020, "Member 'ItemSpawn_Handler_C_Place_Items::_Locations' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, _Selected_Spawner) == 0x000030, "Member 'ItemSpawn_Handler_C_Place_Items::_Selected_Spawner' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'ItemSpawn_Handler_C_Place_Items::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'ItemSpawn_Handler_C_Place_Items::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'ItemSpawn_Handler_C_Place_Items::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'ItemSpawn_Handler_C_Place_Items::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, Temp_int_Array_Index_Variable) == 0x000044, "Member 'ItemSpawn_Handler_C_Place_Items::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Place_Items, CallFunc_Array_Get_Item) == 0x000048, "Member 'ItemSpawn_Handler_C_Place_Items::CallFunc_Array_Get_Item' has a wrong offset!");

// Function ItemSpawn_Handler.ItemSpawn_Handler_C.Search Spawners
// 0x0148 (0x0148 - 0x0000)
struct ItemSpawn_Handler_C_Search_Spawners final
{
public:
	TArray<class AItem_Spawner_C*>                Temp_Spanwers;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AItem_Placer_C*>                 Temp_Placers;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AItem_Placer_C*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AItem_Placer_C*>                 K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemPlacerRef                     K2Node_MakeStruct_Str_ItemPlacerRef;               // 0x0050(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AItem_Spawner_C*                        CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemPlacerRef                     K2Node_MakeStruct_Str_ItemPlacerRef_1;             // 0x0080(0x0018)(HasGetValueTypeHash)
	TArray<class AItem_Spawner_C*>                K2Node_MakeArray_Array_1;                          // 0x0098(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRef                      K2Node_MakeStruct_Str_ItemSpawnRef;                // 0x00B0(0x0018)(HasGetValueTypeHash)
	struct FStr_ItemSpawnRef                      K2Node_MakeStruct_Str_ItemSpawnRef_1;              // 0x00C8(0x0018)(HasGetValueTypeHash)
	struct FStr_ItemPlacerRef                     CallFunc_Map_Find_Value;                           // 0x00E0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AItem_Placer_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0100(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRef                      CallFunc_Map_Find_Value_1;                         // 0x0118(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue_1;               // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AItem_Spawner_C*>                CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0138(0x0010)(ReferenceParm)
};
static_assert(alignof(ItemSpawn_Handler_C_Search_Spawners) == 0x000008, "Wrong alignment on ItemSpawn_Handler_C_Search_Spawners");
static_assert(sizeof(ItemSpawn_Handler_C_Search_Spawners) == 0x000148, "Wrong size on ItemSpawn_Handler_C_Search_Spawners");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, Temp_Spanwers) == 0x000000, "Member 'ItemSpawn_Handler_C_Search_Spawners::Temp_Spanwers' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, Temp_Placers) == 0x000010, "Member 'ItemSpawn_Handler_C_Search_Spawners::Temp_Placers' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, Temp_int_Array_Index_Variable) == 0x000024, "Member 'ItemSpawn_Handler_C_Search_Spawners::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Array_Get_Item) == 0x000030, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, K2Node_MakeArray_Array) == 0x000038, "Member 'ItemSpawn_Handler_C_Search_Spawners::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'ItemSpawn_Handler_C_Search_Spawners::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, K2Node_MakeStruct_Str_ItemPlacerRef) == 0x000050, "Member 'ItemSpawn_Handler_C_Search_Spawners::K2Node_MakeStruct_Str_ItemPlacerRef' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'ItemSpawn_Handler_C_Search_Spawners::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, K2Node_MakeStruct_Str_ItemPlacerRef_1) == 0x000080, "Member 'ItemSpawn_Handler_C_Search_Spawners::K2Node_MakeStruct_Str_ItemPlacerRef_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, K2Node_MakeArray_Array_1) == 0x000098, "Member 'ItemSpawn_Handler_C_Search_Spawners::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Array_Add_ReturnValue) == 0x0000A8, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Array_Add_ReturnValue_1) == 0x0000AC, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, K2Node_MakeStruct_Str_ItemSpawnRef) == 0x0000B0, "Member 'ItemSpawn_Handler_C_Search_Spawners::K2Node_MakeStruct_Str_ItemSpawnRef' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, K2Node_MakeStruct_Str_ItemSpawnRef_1) == 0x0000C8, "Member 'ItemSpawn_Handler_C_Search_Spawners::K2Node_MakeStruct_Str_ItemSpawnRef_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Map_Find_Value) == 0x0000E0, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Map_Find_ReturnValue) == 0x0000F8, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Map_Contains_ReturnValue) == 0x0000F9, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, Temp_int_Loop_Counter_Variable_1) == 0x0000FC, "Member 'ItemSpawn_Handler_C_Search_Spawners::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_GetAllActorsOfClass_OutActors) == 0x000100, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Less_IntInt_ReturnValue_1) == 0x000110, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Add_IntInt_ReturnValue_1) == 0x000114, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Map_Find_Value_1) == 0x000118, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Map_Find_ReturnValue_1) == 0x000130, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_Map_Contains_ReturnValue_1) == 0x000131, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_Map_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Search_Spawners, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000138, "Member 'ItemSpawn_Handler_C_Search_Spawners::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");

// Function ItemSpawn_Handler.ItemSpawn_Handler_C.Spawn Item
// 0x0158 (0x0158 - 0x0000)
struct ItemSpawn_Handler_C_Spawn_Item final
{
public:
	struct FStr_Item                              Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          Locations;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FStr_ItemSpawnLocation                 Location;                                          // 0x0020(0x0002)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemSpawnRequest                  NewLocalVar;                                       // 0x0024(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  _Selected_Sector;                                  // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AItem_Spawner_C*>                _Spanwers;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FStr_ItemSpawnLocation>         _Locations;                                        // 0x0040(0x0010)(Edit, BlueprintVisible)
	struct FStr_ItemSpawnLocation                 _Selected_Spawner;                                 // 0x0050(0x0002)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Temp_byte_Variable;                                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemSpawnRequest                  CallFunc_Array_Get_Item;                           // 0x0054(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Temp_byte_Variable_1;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Temp_byte_Variable_2;                              // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Temp_byte_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Temp_byte_Variable_4;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Temp_byte_Variable_5;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemSpawnRequest                  CallFunc_Array_Get_Item_1;                         // 0x00AC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 K2Node_MakeStruct_Str_ItemSpawnLocation;           // 0x00B5(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Temp_byte_Variable_6;                              // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStr_ItemSpawnLocation>         CallFunc_Map_Keys_Keys;                            // 0x00C0(0x0010)(ReferenceParm)
	struct FStr_ItemSpawnLocation                 CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 K2Node_MakeStruct_Str_ItemSpawnLocation_1;         // 0x00D9(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItem_Spawner_C*                        CallFunc_Array_Get_Item_3;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AItem_Spawner_C*                        CallFunc_Array_Get_Item_4;                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  K2Node_Select_Default;                             // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AItem_Spawner_C*                        CallFunc_Array_Get_Item_5;                         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Array_Get_Item_6;                         // 0x011D(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F[0x1];                                      // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemSpawnRef                      CallFunc_Map_Find_Value;                           // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AItem_Spawner_C*                        CallFunc_Array_Get_Item_7;                         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemSpawn_Handler_C_Spawn_Item) == 0x000008, "Wrong alignment on ItemSpawn_Handler_C_Spawn_Item");
static_assert(sizeof(ItemSpawn_Handler_C_Spawn_Item) == 0x000158, "Wrong size on ItemSpawn_Handler_C_Spawn_Item");
static_assert(offsetof(ItemSpawn_Handler_C_Spawn_Item, Item) == 0x000000, "Member 'ItemSpawn_Handler_C_Spawn_Item::Item' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Spawn_Item, Locations) == 0x000010, "Member 'ItemSpawn_Handler_C_Spawn_Item::Locations' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Spawn_Item, Location) == 0x000020, "Member 'ItemSpawn_Handler_C_Spawn_Item::Location' has a wrong offset!");
static_assert(offsetof(ItemSpawn_Handler_C_Spawn_Item, NewLocalVar) == 0x000024, "Member 'ItemSpawn_Handler_C_Spawn_Item::NewLocalVar' has a wrong offset!");
