#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Locked_Door

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Locked_Door.Locked_Door_C
// 0x0088 (0x0330 - 0x02A8)
class ALocked_Door_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_InteractivevDoor_441_Door;                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InteractivevDoor_441_Frame;                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SoundPath;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MS_ContainerSlot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox;                                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DoorBase;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Timeline_Anim_2101BBC9423DFE815EAEA1AB2379753B;    // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Position_2101BBC9423DFE815EAEA1AB2379753B; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_2101BBC9423DFE815EAEA1AB2379753B; // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Open;                                              // 0x0320(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASoundPath_C*                           SoundPath;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Clear();
	void Close_Door();
	void ExecuteUbergraph_Locked_Door(int32 EntryPoint);
	void Get_Key(class AActor** Key);
	void Get_Name(class AMec_C* Mec, class FString* Name_0);
	void Local_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Net_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void OnRep_Open();
	void Open_Door();
	void Other_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Locked_Door_C">();
	}
	static class ALocked_Door_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALocked_Door_C>();
	}
};
static_assert(alignof(ALocked_Door_C) == 0x000008, "Wrong alignment on ALocked_Door_C");
static_assert(sizeof(ALocked_Door_C) == 0x000330, "Wrong size on ALocked_Door_C");
static_assert(offsetof(ALocked_Door_C, UberGraphFrame) == 0x0002A8, "Member 'ALocked_Door_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, SM_InteractivevDoor_441_Door) == 0x0002B0, "Member 'ALocked_Door_C::SM_InteractivevDoor_441_Door' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, SM_InteractivevDoor_441_Frame) == 0x0002B8, "Member 'ALocked_Door_C::SM_InteractivevDoor_441_Frame' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, C_SoundPath) == 0x0002C0, "Member 'ALocked_Door_C::C_SoundPath' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, MS_ContainerSlot) == 0x0002C8, "Member 'ALocked_Door_C::MS_ContainerSlot' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, HitBox) == 0x0002D0, "Member 'ALocked_Door_C::HitBox' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, Cube) == 0x0002D8, "Member 'ALocked_Door_C::Cube' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, DoorBase) == 0x0002E0, "Member 'ALocked_Door_C::DoorBase' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, Root) == 0x0002E8, "Member 'ALocked_Door_C::Root' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, Timeline_Anim_2101BBC9423DFE815EAEA1AB2379753B) == 0x0002F0, "Member 'ALocked_Door_C::Timeline_Anim_2101BBC9423DFE815EAEA1AB2379753B' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, Timeline_Position_2101BBC9423DFE815EAEA1AB2379753B) == 0x000308, "Member 'ALocked_Door_C::Timeline_Position_2101BBC9423DFE815EAEA1AB2379753B' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, Timeline__Direction_2101BBC9423DFE815EAEA1AB2379753B) == 0x00030C, "Member 'ALocked_Door_C::Timeline__Direction_2101BBC9423DFE815EAEA1AB2379753B' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, Timeline) == 0x000310, "Member 'ALocked_Door_C::Timeline' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, GM_Ref) == 0x000318, "Member 'ALocked_Door_C::GM_Ref' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, Open) == 0x000320, "Member 'ALocked_Door_C::Open' has a wrong offset!");
static_assert(offsetof(ALocked_Door_C, SoundPath) == 0x000328, "Member 'ALocked_Door_C::SoundPath' has a wrong offset!");

}

