#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mec

#include "Basic.hpp"

#include "Enum_MoveInputState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_DamageType_structs.hpp"
#include "Engine_structs.hpp"
#include "E_EyeState_structs.hpp"
#include "Str_SkinSet_structs.hpp"
#include "Str_Item_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Enum_SelectedColor_structs.hpp"
#include "SteamCorePro_structs.hpp"
#include "Enum_Stance_structs.hpp"
#include "Str_GunSettings_structs.hpp"
#include "E_PlayerRole_structs.hpp"
#include "Str_ItemState_structs.hpp"
#include "E_Logic_structs.hpp"
#include "E_InputMode_structs.hpp"
#include "Synthesis_structs.hpp"
#include "E_SessionState_structs.hpp"


namespace SDK::Params
{

// Function Mec.Mec_C.Add Buff
// 0x0010 (0x0010 - 0x0000)
struct Mec_C_Add_Buff final
{
public:
	struct FStr_ItemState                         State;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UData_Consumable_C*                     Consumable_Data;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_Add_Buff) == 0x000008, "Wrong alignment on Mec_C_Add_Buff");
static_assert(sizeof(Mec_C_Add_Buff) == 0x000010, "Wrong size on Mec_C_Add_Buff");
static_assert(offsetof(Mec_C_Add_Buff, State) == 0x000000, "Member 'Mec_C_Add_Buff::State' has a wrong offset!");
static_assert(offsetof(Mec_C_Add_Buff, Consumable_Data) == 0x000008, "Member 'Mec_C_Add_Buff::Consumable_Data' has a wrong offset!");

// Function Mec.Mec_C.Add Step Height
// 0x0001 (0x0001 - 0x0000)
struct Mec_C_Add_Step_Height final
{
public:
	bool                                          Right;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_Add_Step_Height) == 0x000001, "Wrong alignment on Mec_C_Add_Step_Height");
static_assert(sizeof(Mec_C_Add_Step_Height) == 0x000001, "Wrong size on Mec_C_Add_Step_Height");
static_assert(offsetof(Mec_C_Add_Step_Height, Right) == 0x000000, "Member 'Mec_C_Add_Step_Height::Right' has a wrong offset!");

// Function Mec.Mec_C.All Gun Fire
// 0x0010 (0x0010 - 0x0000)
struct Mec_C_All_Gun_Fire final
{
public:
	double                                        Hit;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ammo;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_All_Gun_Fire) == 0x000008, "Wrong alignment on Mec_C_All_Gun_Fire");
static_assert(sizeof(Mec_C_All_Gun_Fire) == 0x000010, "Wrong size on Mec_C_All_Gun_Fire");
static_assert(offsetof(Mec_C_All_Gun_Fire, Hit) == 0x000000, "Member 'Mec_C_All_Gun_Fire::Hit' has a wrong offset!");
static_assert(offsetof(Mec_C_All_Gun_Fire, Ammo) == 0x000008, "Member 'Mec_C_All_Gun_Fire::Ammo' has a wrong offset!");

// Function Mec.Mec_C.All Gun Settings
// 0x00E0 (0x00E0 - 0x0000)
struct Mec_C_All_Gun_Settings final
{
public:
	class UData_Gun_C*                            Gun_Data;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_GunSettings                       Settings_0;                                        // 0x0008(0x00D8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_All_Gun_Settings) == 0x000008, "Wrong alignment on Mec_C_All_Gun_Settings");
static_assert(sizeof(Mec_C_All_Gun_Settings) == 0x0000E0, "Wrong size on Mec_C_All_Gun_Settings");
static_assert(offsetof(Mec_C_All_Gun_Settings, Gun_Data) == 0x000000, "Member 'Mec_C_All_Gun_Settings::Gun_Data' has a wrong offset!");
static_assert(offsetof(Mec_C_All_Gun_Settings, Settings_0) == 0x000008, "Member 'Mec_C_All_Gun_Settings::Settings_0' has a wrong offset!");

// Function Mec.Mec_C.All Pick Item
// 0x0020 (0x0020 - 0x0000)
struct Mec_C_All_Pick_Item final
{
public:
	class UData_Item_C*                           Item_Data;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Aim;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_All_Pick_Item) == 0x000008, "Wrong alignment on Mec_C_All_Pick_Item");
static_assert(sizeof(Mec_C_All_Pick_Item) == 0x000020, "Wrong size on Mec_C_All_Pick_Item");
static_assert(offsetof(Mec_C_All_Pick_Item, Item_Data) == 0x000000, "Member 'Mec_C_All_Pick_Item::Item_Data' has a wrong offset!");
static_assert(offsetof(Mec_C_All_Pick_Item, Aim) == 0x000008, "Member 'Mec_C_All_Pick_Item::Aim' has a wrong offset!");

// Function Mec.Mec_C.All Set Mic
// 0x0004 (0x0004 - 0x0000)
struct Mec_C_All_Set_Mic final
{
public:
	int32                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_All_Set_Mic) == 0x000004, "Wrong alignment on Mec_C_All_Set_Mic");
static_assert(sizeof(Mec_C_All_Set_Mic) == 0x000004, "Wrong size on Mec_C_All_Set_Mic");
static_assert(offsetof(Mec_C_All_Set_Mic, Volume) == 0x000000, "Member 'Mec_C_All_Set_Mic::Volume' has a wrong offset!");

// Function Mec.Mec_C.All Sneack Effect
// 0x0004 (0x0004 - 0x0000)
struct Mec_C_All_Sneack_Effect final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_All_Sneack_Effect) == 0x000004, "Wrong alignment on Mec_C_All_Sneack_Effect");
static_assert(sizeof(Mec_C_All_Sneack_Effect) == 0x000004, "Wrong size on Mec_C_All_Sneack_Effect");
static_assert(offsetof(Mec_C_All_Sneack_Effect, A) == 0x000000, "Member 'Mec_C_All_Sneack_Effect::A' has a wrong offset!");

// Function Mec.Mec_C.All Step Sound
// 0x0004 (0x0004 - 0x0000)
struct Mec_C_All_Step_Sound final
{
public:
	float                                         Step_Speed;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_All_Step_Sound) == 0x000004, "Wrong alignment on Mec_C_All_Step_Sound");
static_assert(sizeof(Mec_C_All_Step_Sound) == 0x000004, "Wrong size on Mec_C_All_Step_Sound");
static_assert(offsetof(Mec_C_All_Step_Sound, Step_Speed) == 0x000000, "Member 'Mec_C_All_Step_Sound::Step_Speed' has a wrong offset!");

// Function Mec.Mec_C.All Touch Floor
// 0x0001 (0x0001 - 0x0000)
struct Mec_C_All_Touch_Floor final
{
public:
	uint8                                         Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_All_Touch_Floor) == 0x000001, "Wrong alignment on Mec_C_All_Touch_Floor");
static_assert(sizeof(Mec_C_All_Touch_Floor) == 0x000001, "Wrong size on Mec_C_All_Touch_Floor");
static_assert(offsetof(Mec_C_All_Touch_Floor, Type) == 0x000000, "Member 'Mec_C_All_Touch_Floor::Type' has a wrong offset!");

// Function Mec.Mec_C.All TP
// 0x0020 (0x0020 - 0x0000)
struct Mec_C_All_TP final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Orientation_0;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_All_TP) == 0x000008, "Wrong alignment on Mec_C_All_TP");
static_assert(sizeof(Mec_C_All_TP) == 0x000020, "Wrong size on Mec_C_All_TP");
static_assert(offsetof(Mec_C_All_TP, Location) == 0x000000, "Member 'Mec_C_All_TP::Location' has a wrong offset!");
static_assert(offsetof(Mec_C_All_TP, Orientation_0) == 0x000018, "Member 'Mec_C_All_TP::Orientation_0' has a wrong offset!");

// Function Mec.Mec_C.All Update Locomotion
// 0x0050 (0x0050 - 0x0000)
struct Mec_C_All_Update_Locomotion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Aim;                                               // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Orientation_0;                                     // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_All_Update_Locomotion) == 0x000008, "Wrong alignment on Mec_C_All_Update_Locomotion");
static_assert(sizeof(Mec_C_All_Update_Locomotion) == 0x000050, "Wrong size on Mec_C_All_Update_Locomotion");
static_assert(offsetof(Mec_C_All_Update_Locomotion, Location) == 0x000000, "Member 'Mec_C_All_Update_Locomotion::Location' has a wrong offset!");
static_assert(offsetof(Mec_C_All_Update_Locomotion, Velocity) == 0x000018, "Member 'Mec_C_All_Update_Locomotion::Velocity' has a wrong offset!");
static_assert(offsetof(Mec_C_All_Update_Locomotion, Aim) == 0x000030, "Member 'Mec_C_All_Update_Locomotion::Aim' has a wrong offset!");
static_assert(offsetof(Mec_C_All_Update_Locomotion, Orientation_0) == 0x000048, "Member 'Mec_C_All_Update_Locomotion::Orientation_0' has a wrong offset!");

// Function Mec.Mec_C.Apply Armor
// 0x00B0 (0x00B0 - 0x0000)
struct Mec_C_Apply_Armor final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_DamageType                               Raw;                                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_4;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_5;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Range___;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_Apply_Armor) == 0x000008, "Wrong alignment on Mec_C_Apply_Armor");
static_assert(sizeof(Mec_C_Apply_Armor) == 0x0000B0, "Wrong size on Mec_C_Apply_Armor");
static_assert(offsetof(Mec_C_Apply_Armor, Damage) == 0x000000, "Member 'Mec_C_Apply_Armor::Damage' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, Raw) == 0x000004, "Member 'Mec_C_Apply_Armor::Raw' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, ReturnValue) == 0x000008, "Member 'Mec_C_Apply_Armor::ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, Temp_int_Variable) == 0x00000C, "Member 'Mec_C_Apply_Armor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'Mec_C_Apply_Armor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000011, "Member 'Mec_C_Apply_Armor::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Less_IntInt_ReturnValue) == 0x000012, "Member 'Mec_C_Apply_Armor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'Mec_C_Apply_Armor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Mec_C_Apply_Armor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, Temp_int_Variable_1) == 0x000018, "Member 'Mec_C_Apply_Armor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_SelectInt_ReturnValue) == 0x00001C, "Member 'Mec_C_Apply_Armor::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_SelectInt_ReturnValue_1) == 0x000020, "Member 'Mec_C_Apply_Armor::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_SelectInt_ReturnValue_2) == 0x000024, "Member 'Mec_C_Apply_Armor::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, Temp_int_Variable_2) == 0x000028, "Member 'Mec_C_Apply_Armor::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'Mec_C_Apply_Armor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, Temp_int_Variable_3) == 0x000030, "Member 'Mec_C_Apply_Armor::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'Mec_C_Apply_Armor::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_SelectInt_ReturnValue_3) == 0x000038, "Member 'Mec_C_Apply_Armor::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, K2Node_Select_Default) == 0x00003C, "Member 'Mec_C_Apply_Armor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_SelectInt_ReturnValue_4) == 0x000040, "Member 'Mec_C_Apply_Armor::CallFunc_SelectInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_SelectInt_ReturnValue_5) == 0x000044, "Member 'Mec_C_Apply_Armor::CallFunc_SelectInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, Temp_int_Variable_4) == 0x000048, "Member 'Mec_C_Apply_Armor::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, K2Node_Select_Default_1) == 0x00004C, "Member 'Mec_C_Apply_Armor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'Mec_C_Apply_Armor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Add_IntInt_ReturnValue_3) == 0x000054, "Member 'Mec_C_Apply_Armor::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Clamp_ReturnValue) == 0x000058, "Member 'Mec_C_Apply_Armor::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00005C, "Member 'Mec_C_Apply_Armor::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000060, "Member 'Mec_C_Apply_Armor::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_MapRangeClamped_ReturnValue) == 0x000068, "Member 'Mec_C_Apply_Armor::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Map_Range___) == 0x000070, "Member 'Mec_C_Apply_Armor::CallFunc_Map_Range___' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, Temp_int_Variable_5) == 0x000078, "Member 'Mec_C_Apply_Armor::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_LinearColorLerp_ReturnValue) == 0x00007C, "Member 'Mec_C_Apply_Armor::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, K2Node_Select_Default_2) == 0x00008C, "Member 'Mec_C_Apply_Armor::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, K2Node_Select_Default_3) == 0x000090, "Member 'Mec_C_Apply_Armor::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_Greater_IntInt_ReturnValue) == 0x000094, "Member 'Mec_C_Apply_Armor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_SelectColor_ReturnValue) == 0x000098, "Member 'Mec_C_Apply_Armor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Armor, CallFunc_LinearColorLerp_Alpha_ImplicitCast) == 0x0000A8, "Member 'Mec_C_Apply_Armor::CallFunc_LinearColorLerp_Alpha_ImplicitCast' has a wrong offset!");

// Function Mec.Mec_C.Apply Mic State
// 0x0040 (0x0040 - 0x0000)
struct Mec_C_Apply_Mic_State final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               CallFunc_GetSteamID_Pure_ReturnValue;              // 0x0008(0x0008)(NoDestructor)
	struct FSteamID                               CallFunc_GetSteamID_Pure_ReturnValue_1;            // 0x0010(0x0008)(NoDestructor)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_Apply_Mic_State) == 0x000008, "Wrong alignment on Mec_C_Apply_Mic_State");
static_assert(sizeof(Mec_C_Apply_Mic_State) == 0x000040, "Wrong size on Mec_C_Apply_Mic_State");
static_assert(offsetof(Mec_C_Apply_Mic_State, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'Mec_C_Apply_Mic_State::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Mic_State, CallFunc_GetSteamID_Pure_ReturnValue) == 0x000008, "Member 'Mec_C_Apply_Mic_State::CallFunc_GetSteamID_Pure_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Mic_State, CallFunc_GetSteamID_Pure_ReturnValue_1) == 0x000010, "Member 'Mec_C_Apply_Mic_State::CallFunc_GetSteamID_Pure_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Mic_State, CallFunc_BooleanXOR_ReturnValue) == 0x000018, "Member 'Mec_C_Apply_Mic_State::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Mic_State, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'Mec_C_Apply_Mic_State::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Mic_State, CallFunc_BooleanAND_ReturnValue_1) == 0x00001A, "Member 'Mec_C_Apply_Mic_State::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Mic_State, CallFunc_SelectString_ReturnValue) == 0x000020, "Member 'Mec_C_Apply_Mic_State::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_Apply_Mic_State, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'Mec_C_Apply_Mic_State::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function Mec.Mec_C.AsyncValue
// 0x0020 (0x0020 - 0x0000)
struct Mec_C_AsyncValue final
{
public:
	double                                        _;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_AsyncValue) == 0x000008, "Wrong alignment on Mec_C_AsyncValue");
static_assert(sizeof(Mec_C_AsyncValue) == 0x000020, "Wrong size on Mec_C_AsyncValue");
static_assert(offsetof(Mec_C_AsyncValue, _) == 0x000000, "Member 'Mec_C_AsyncValue::_' has a wrong offset!");
static_assert(offsetof(Mec_C_AsyncValue, Value) == 0x000008, "Member 'Mec_C_AsyncValue::Value' has a wrong offset!");
static_assert(offsetof(Mec_C_AsyncValue, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'Mec_C_AsyncValue::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_C_AsyncValue, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'Mec_C_AsyncValue::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function Mec.Mec_C.BndEvt__Mec_AudioCapture_K2Node_ComponentBoundEvent_0_OnSynthEnvelopeValue__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Mec_C_BndEvt__Mec_AudioCapture_K2Node_ComponentBoundEvent_0_OnSynthEnvelopeValue__DelegateSignature final
{
public:
	float                                         EnvelopeValue;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_BndEvt__Mec_AudioCapture_K2Node_ComponentBoundEvent_0_OnSynthEnvelopeValue__DelegateSignature) == 0x000004, "Wrong alignment on Mec_C_BndEvt__Mec_AudioCapture_K2Node_ComponentBoundEvent_0_OnSynthEnvelopeValue__DelegateSignature");
static_assert(sizeof(Mec_C_BndEvt__Mec_AudioCapture_K2Node_ComponentBoundEvent_0_OnSynthEnvelopeValue__DelegateSignature) == 0x000004, "Wrong size on Mec_C_BndEvt__Mec_AudioCapture_K2Node_ComponentBoundEvent_0_OnSynthEnvelopeValue__DelegateSignature");
static_assert(offsetof(Mec_C_BndEvt__Mec_AudioCapture_K2Node_ComponentBoundEvent_0_OnSynthEnvelopeValue__DelegateSignature, EnvelopeValue) == 0x000000, "Member 'Mec_C_BndEvt__Mec_AudioCapture_K2Node_ComponentBoundEvent_0_OnSynthEnvelopeValue__DelegateSignature::EnvelopeValue' has a wrong offset!");

// Function Mec.Mec_C.BndEvt__Mec_EnvelopeFollowerListener_K2Node_ComponentBoundEvent_1_OnEnvelopeFollowerUpdate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Mec_C_BndEvt__Mec_EnvelopeFollowerListener_K2Node_ComponentBoundEvent_1_OnEnvelopeFollowerUpdate__DelegateSignature final
{
public:
	float                                         EnvelopeValue;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_BndEvt__Mec_EnvelopeFollowerListener_K2Node_ComponentBoundEvent_1_OnEnvelopeFollowerUpdate__DelegateSignature) == 0x000004, "Wrong alignment on Mec_C_BndEvt__Mec_EnvelopeFollowerListener_K2Node_ComponentBoundEvent_1_OnEnvelopeFollowerUpdate__DelegateSignature");
static_assert(sizeof(Mec_C_BndEvt__Mec_EnvelopeFollowerListener_K2Node_ComponentBoundEvent_1_OnEnvelopeFollowerUpdate__DelegateSignature) == 0x000004, "Wrong size on Mec_C_BndEvt__Mec_EnvelopeFollowerListener_K2Node_ComponentBoundEvent_1_OnEnvelopeFollowerUpdate__DelegateSignature");
static_assert(offsetof(Mec_C_BndEvt__Mec_EnvelopeFollowerListener_K2Node_ComponentBoundEvent_1_OnEnvelopeFollowerUpdate__DelegateSignature, EnvelopeValue) == 0x000000, "Member 'Mec_C_BndEvt__Mec_EnvelopeFollowerListener_K2Node_ComponentBoundEvent_1_OnEnvelopeFollowerUpdate__DelegateSignature::EnvelopeValue' has a wrong offset!");

// Function Mec.Mec_C.Bullet Crack
// 0x0038 (0x0038 - 0x0000)
struct Mec_C_Bullet_Crack final
{
public:
	struct FVector                                Source;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Direction;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Bullet_Type;                                       // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_Bullet_Crack) == 0x000008, "Wrong alignment on Mec_C_Bullet_Crack");
static_assert(sizeof(Mec_C_Bullet_Crack) == 0x000038, "Wrong size on Mec_C_Bullet_Crack");
static_assert(offsetof(Mec_C_Bullet_Crack, Source) == 0x000000, "Member 'Mec_C_Bullet_Crack::Source' has a wrong offset!");
static_assert(offsetof(Mec_C_Bullet_Crack, Direction) == 0x000018, "Member 'Mec_C_Bullet_Crack::Direction' has a wrong offset!");
static_assert(offsetof(Mec_C_Bullet_Crack, Bullet_Type) == 0x000030, "Member 'Mec_C_Bullet_Crack::Bullet_Type' has a wrong offset!");

// Function Mec.Mec_C.Character Velocity
// 0x0760 (0x0760 - 0x0000)
struct Mec_C_Character_Velocity final
{
public:
	double                                        Acceleration_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Brake_Linearity;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Brake_Ratio;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Direction_Ratio;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Low_Brake_Speed;                                   // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Push;                                              // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ATP_GetLinearVelocity_ReturnValue;        // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AsyncValue_Value;                         // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Target_Speed_Speed;                   // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_4;        // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_5;                          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_6;                          // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_6;                          // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_6;                          // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_6;                 // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue_1;  // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ATP_GetTransform_ReturnValue;             // 0x04B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_7;                          // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_7;                          // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_7;                          // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_7;                 // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_1;         // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue_2;  // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ATP_GetLinearVelocity_ReturnValue_1;      // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_2;                      // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Range___;                             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_Constant_ReturnValue;           // 0x05F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_Constant_ReturnValue_1;         // 0x0650(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_2;         // 0x0668(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0680(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0698(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_8;                          // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_8;                          // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_8;                          // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_8;                 // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_2;            // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_9;                          // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_9;                          // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_9;                          // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_9;                 // 0x0710(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x0728(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1; // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_Constant_InterpSpeed_ImplicitCast; // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_Constant_InterpSpeed_ImplicitCast_1; // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_C_Character_Velocity) == 0x000010, "Wrong alignment on Mec_C_Character_Velocity");
static_assert(sizeof(Mec_C_Character_Velocity) == 0x000760, "Wrong size on Mec_C_Character_Velocity");
static_assert(offsetof(Mec_C_Character_Velocity, Acceleration_0) == 0x000000, "Member 'Mec_C_Character_Velocity::Acceleration_0' has a wrong offset!");
static_assert(offsetof(Mec_C_Character_Velocity, Brake_Linearity) == 0x000008, "Member 'Mec_C_Character_Velocity::Brake_Linearity' has a wrong offset!");
static_assert(offsetof(Mec_C_Character_Velocity, Brake_Ratio) == 0x000010, "Member 'Mec_C_Character_Velocity::Brake_Ratio' has a wrong offset!");
static_assert(offsetof(Mec_C_Character_Velocity, Direction_Ratio) == 0x000018, "Member 'Mec_C_Character_Velocity::Direction_Ratio' has a wrong offset!");
static_assert(offsetof(Mec_C_Character_Velocity, Low_Brake_Speed) == 0x000020, "Member 'Mec_C_Character_Velocity::Low_Brake_Speed' has a wrong offset!");
static_assert(offsetof(Mec_C_Character_Velocity, Push) == 0x000028, "Member 'Mec_C_Character_Velocity::Push' has a wrong offset!");
static_assert(offsetof(Mec_C_Character_Velocity, Location) == 0x000040, "Member 'Mec_C_Character_Velocity::Location' has a wrong offset!");
