#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mec_SkinViewer

#include "Basic.hpp"

#include "Str_SkinSet_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Mec_SkinViewer.Mec_SkinViewer_C.ExecuteUbergraph_Mec_SkinViewer
// 0x00A0 (0x00A0 - 0x0000)
struct Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_SkinSet                           K2Node_CustomEvent_Skin;                           // 0x0028(0x0048)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Set_Body_Helmet_Color;                    // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Set_Head_Face_Material_Instnce;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MultiplyMultiply_FloatFloat_Base_ImplicitCast; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0098(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer) == 0x000008, "Wrong alignment on Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer");
static_assert(sizeof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer) == 0x0000A0, "Wrong size on Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, EntryPoint) == 0x000000, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000008, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, K2Node_CustomEvent_Skin) == 0x000028, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::K2Node_CustomEvent_Skin' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, CallFunc_Set_Body_Helmet_Color) == 0x000070, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::CallFunc_Set_Body_Helmet_Color' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, CallFunc_Set_Head_Face_Material_Instnce) == 0x000080, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::CallFunc_Set_Head_Face_Material_Instnce' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000088, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, CallFunc_MultiplyMultiply_FloatFloat_Base_ImplicitCast) == 0x000090, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::CallFunc_MultiplyMultiply_FloatFloat_Base_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000098, "Member 'Mec_SkinViewer_C_ExecuteUbergraph_Mec_SkinViewer::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function Mec_SkinViewer.Mec_SkinViewer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Mec_SkinViewer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_SkinViewer_C_ReceiveTick) == 0x000004, "Wrong alignment on Mec_SkinViewer_C_ReceiveTick");
static_assert(sizeof(Mec_SkinViewer_C_ReceiveTick) == 0x000004, "Wrong size on Mec_SkinViewer_C_ReceiveTick");
static_assert(offsetof(Mec_SkinViewer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Mec_SkinViewer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Mec_SkinViewer.Mec_SkinViewer_C.Set Skin
// 0x0048 (0x0048 - 0x0000)
struct Mec_SkinViewer_C_Set_Skin final
{
public:
	struct FStr_SkinSet                           Skin;                                              // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_SkinViewer_C_Set_Skin) == 0x000008, "Wrong alignment on Mec_SkinViewer_C_Set_Skin");
static_assert(sizeof(Mec_SkinViewer_C_Set_Skin) == 0x000048, "Wrong size on Mec_SkinViewer_C_Set_Skin");
static_assert(offsetof(Mec_SkinViewer_C_Set_Skin, Skin) == 0x000000, "Member 'Mec_SkinViewer_C_Set_Skin::Skin' has a wrong offset!");

// Function Mec_SkinViewer.Mec_SkinViewer_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct Mec_SkinViewer_C_UserConstructionScript final
{
public:
	double                                        CallFunc_BreakVector2D_X;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1; // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mec_SkinViewer_C_UserConstructionScript) == 0x000008, "Wrong alignment on Mec_SkinViewer_C_UserConstructionScript");
static_assert(sizeof(Mec_SkinViewer_C_UserConstructionScript) == 0x000018, "Wrong size on Mec_SkinViewer_C_UserConstructionScript");
static_assert(offsetof(Mec_SkinViewer_C_UserConstructionScript, CallFunc_BreakVector2D_X) == 0x000000, "Member 'Mec_SkinViewer_C_UserConstructionScript::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_UserConstructionScript, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'Mec_SkinViewer_C_UserConstructionScript::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_UserConstructionScript, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000010, "Member 'Mec_SkinViewer_C_UserConstructionScript::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Mec_SkinViewer_C_UserConstructionScript, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1) == 0x000014, "Member 'Mec_SkinViewer_C_UserConstructionScript::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1' has a wrong offset!");

}

