#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mixer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_GenericMachine_State_structs.hpp"
#include "E_ItemType_structs.hpp"
#include "Str_ItemState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mixer.Mixer_C
// 0x0120 (0x03C8 - 0x02A8)
class AMixer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Collisions8;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Collisions7;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Collisions6;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Collisions5;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Collisions4;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Collisions3;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SoundPath;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SampleSlot_3;                                    // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SampleSlot_2;                                    // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SampleSlot_1;                                    // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Link_Cube;                                         // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_Button;                                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Pitch_109DA68047008431B0AB4CACE6003DE0;   // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Volume_109DA68047008431B0AB4CACE6003DE0;  // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_109DA68047008431B0AB4CACE6003DE0; // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Process;                                           // 0x0350(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_GenericMachine_Jauge_C*              W_Screen;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Charge_Speed;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	E_GenericMachine_State                        State;                                             // 0x0370(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         Process_Result;                                    // 0x0374(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              Button;                                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASampleSlot_C*                          Ingredient_1;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Ingredient_1_Old;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASampleSlot_C*                          Ingredient_2;                                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Ingredient_2_Old;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASampleSlot_C*                          Result;                                            // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Result_Old;                                        // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_Process;                                       // 0x03B8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASoundPath_C*                           Sound_Path;                                        // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_State();
	void BndEvt__Mixer_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature(class AMec_C* Source);
	void BndEvt__Mixer_Ingredient_1_K2Node_ComponentBoundEvent_6_Place_Container__DelegateSignature();
	void BndEvt__Mixer_Ingredient_1_K2Node_ComponentBoundEvent_7_Take_Container__DelegateSignature();
	void BndEvt__Mixer_Ingredient_2_K2Node_ComponentBoundEvent_8_Place_Container__DelegateSignature();
	void BndEvt__Mixer_Ingredient_2_K2Node_ComponentBoundEvent_9_Take_Container__DelegateSignature();
	void BndEvt__Mixer_Result_K2Node_ComponentBoundEvent_10_Take_Container__DelegateSignature();
	void Check_Result(struct FStr_ItemState* Result_0, bool* Full);
	void Clear();
	void ExecuteUbergraph_Mixer(int32 EntryPoint);
	void Get_Key(class AActor** Key);
	void Get_Name(class AMec_C* Mec, class FString* Name_0);
	void Local_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Net_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void OnRep_Process();
	void OnRep_State();
	void Other_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Pause_Process();
	void Process_Tick();
	void ReceiveBeginPlay();
	void Start_Anim();
	void Start_Process();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void Update_Screen();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mixer_C">();
	}
	static class AMixer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMixer_C>();
	}
};
static_assert(alignof(AMixer_C) == 0x000008, "Wrong alignment on AMixer_C");
static_assert(sizeof(AMixer_C) == 0x0003C8, "Wrong size on AMixer_C");
static_assert(offsetof(AMixer_C, UberGraphFrame) == 0x0002A8, "Member 'AMixer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMixer_C, Collisions8) == 0x0002B0, "Member 'AMixer_C::Collisions8' has a wrong offset!");
static_assert(offsetof(AMixer_C, Collisions7) == 0x0002B8, "Member 'AMixer_C::Collisions7' has a wrong offset!");
static_assert(offsetof(AMixer_C, Collisions6) == 0x0002C0, "Member 'AMixer_C::Collisions6' has a wrong offset!");
static_assert(offsetof(AMixer_C, Collisions5) == 0x0002C8, "Member 'AMixer_C::Collisions5' has a wrong offset!");
static_assert(offsetof(AMixer_C, Collisions4) == 0x0002D0, "Member 'AMixer_C::Collisions4' has a wrong offset!");
static_assert(offsetof(AMixer_C, Collisions3) == 0x0002D8, "Member 'AMixer_C::Collisions3' has a wrong offset!");
static_assert(offsetof(AMixer_C, Audio) == 0x0002E0, "Member 'AMixer_C::Audio' has a wrong offset!");
static_assert(offsetof(AMixer_C, C_SoundPath) == 0x0002E8, "Member 'AMixer_C::C_SoundPath' has a wrong offset!");
static_assert(offsetof(AMixer_C, C_SampleSlot_3) == 0x0002F0, "Member 'AMixer_C::C_SampleSlot_3' has a wrong offset!");
static_assert(offsetof(AMixer_C, C_SampleSlot_2) == 0x0002F8, "Member 'AMixer_C::C_SampleSlot_2' has a wrong offset!");
static_assert(offsetof(AMixer_C, C_SampleSlot_1) == 0x000300, "Member 'AMixer_C::C_SampleSlot_1' has a wrong offset!");
static_assert(offsetof(AMixer_C, TextRender) == 0x000308, "Member 'AMixer_C::TextRender' has a wrong offset!");
static_assert(offsetof(AMixer_C, Link_Cube) == 0x000310, "Member 'AMixer_C::Link_Cube' has a wrong offset!");
static_assert(offsetof(AMixer_C, C_Button) == 0x000318, "Member 'AMixer_C::C_Button' has a wrong offset!");
static_assert(offsetof(AMixer_C, Widget) == 0x000320, "Member 'AMixer_C::Widget' has a wrong offset!");
static_assert(offsetof(AMixer_C, Root) == 0x000328, "Member 'AMixer_C::Root' has a wrong offset!");
static_assert(offsetof(AMixer_C, Cube) == 0x000330, "Member 'AMixer_C::Cube' has a wrong offset!");
static_assert(offsetof(AMixer_C, Timeline_Pitch_109DA68047008431B0AB4CACE6003DE0) == 0x000338, "Member 'AMixer_C::Timeline_Pitch_109DA68047008431B0AB4CACE6003DE0' has a wrong offset!");
static_assert(offsetof(AMixer_C, Timeline_Volume_109DA68047008431B0AB4CACE6003DE0) == 0x00033C, "Member 'AMixer_C::Timeline_Volume_109DA68047008431B0AB4CACE6003DE0' has a wrong offset!");
static_assert(offsetof(AMixer_C, Timeline__Direction_109DA68047008431B0AB4CACE6003DE0) == 0x000340, "Member 'AMixer_C::Timeline__Direction_109DA68047008431B0AB4CACE6003DE0' has a wrong offset!");
static_assert(offsetof(AMixer_C, Timeline) == 0x000348, "Member 'AMixer_C::Timeline' has a wrong offset!");
static_assert(offsetof(AMixer_C, Process) == 0x000350, "Member 'AMixer_C::Process' has a wrong offset!");
static_assert(offsetof(AMixer_C, W_Screen) == 0x000358, "Member 'AMixer_C::W_Screen' has a wrong offset!");
static_assert(offsetof(AMixer_C, Timer) == 0x000360, "Member 'AMixer_C::Timer' has a wrong offset!");
static_assert(offsetof(AMixer_C, Charge_Speed) == 0x000368, "Member 'AMixer_C::Charge_Speed' has a wrong offset!");
static_assert(offsetof(AMixer_C, State) == 0x000370, "Member 'AMixer_C::State' has a wrong offset!");
static_assert(offsetof(AMixer_C, Process_Result) == 0x000374, "Member 'AMixer_C::Process_Result' has a wrong offset!");
static_assert(offsetof(AMixer_C, Button) == 0x000380, "Member 'AMixer_C::Button' has a wrong offset!");
static_assert(offsetof(AMixer_C, Ingredient_1) == 0x000388, "Member 'AMixer_C::Ingredient_1' has a wrong offset!");
static_assert(offsetof(AMixer_C, Ingredient_1_Old) == 0x000390, "Member 'AMixer_C::Ingredient_1_Old' has a wrong offset!");
static_assert(offsetof(AMixer_C, Ingredient_2) == 0x000398, "Member 'AMixer_C::Ingredient_2' has a wrong offset!");
static_assert(offsetof(AMixer_C, Ingredient_2_Old) == 0x0003A0, "Member 'AMixer_C::Ingredient_2_Old' has a wrong offset!");
static_assert(offsetof(AMixer_C, Result) == 0x0003A8, "Member 'AMixer_C::Result' has a wrong offset!");
static_assert(offsetof(AMixer_C, Result_Old) == 0x0003B0, "Member 'AMixer_C::Result_Old' has a wrong offset!");
static_assert(offsetof(AMixer_C, Max_Process) == 0x0003B8, "Member 'AMixer_C::Max_Process' has a wrong offset!");
static_assert(offsetof(AMixer_C, Sound_Path) == 0x0003C0, "Member 'AMixer_C::Sound_Path' has a wrong offset!");

}

