#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Cameras

#include "Basic.hpp"

#include "Str_ItemState_structs.hpp"
#include "CamerasStack_structs.hpp"


namespace SDK::Params
{

// Function PC_Cameras.PC_Cameras_C.All Update Screen
// 0x0004 (0x0004 - 0x0000)
struct PC_Cameras_C_All_Update_Screen final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_All_Update_Screen) == 0x000004, "Wrong alignment on PC_Cameras_C_All_Update_Screen");
static_assert(sizeof(PC_Cameras_C_All_Update_Screen) == 0x000004, "Wrong size on PC_Cameras_C_All_Update_Screen");
static_assert(offsetof(PC_Cameras_C_All_Update_Screen, Index_0) == 0x000000, "Member 'PC_Cameras_C_All_Update_Screen::Index_0' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.BndEvt__Data_PC_Button L_K2Node_ComponentBoundEvent_1_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PC_Cameras_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on PC_Cameras_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature");
static_assert(sizeof(PC_Cameras_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature) == 0x000008, "Wrong size on PC_Cameras_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature");
static_assert(offsetof(PC_Cameras_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'PC_Cameras_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PC_Cameras_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on PC_Cameras_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(sizeof(PC_Cameras_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong size on PC_Cameras_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(offsetof(PC_Cameras_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'PC_Cameras_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.ExecuteUbergraph_PC_Cameras
// 0x0190 (0x0190 - 0x0000)
struct PC_Cameras_C_ExecuteUbergraph_PC_Cameras final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source_1;               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_CameraPC_UI_C*                       K2Node_DynamicCast_AsW_Camera_PC_UI;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraScreen_C*                        CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraScreen_C*                        CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCamerasStack                          CallFunc_Array_Get_Item_2;                         // 0x0108(0x0020)(HasGetValueTypeHash)
	class ACameraScreen_C*                        CallFunc_Array_Get_Item_3;                         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ARoomCamera_C*                          CallFunc_Array_Get_Item_4;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras) == 0x000008, "Wrong alignment on PC_Cameras_C_ExecuteUbergraph_PC_Cameras");
static_assert(sizeof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras) == 0x000190, "Wrong size on PC_Cameras_C_ExecuteUbergraph_PC_Cameras");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, EntryPoint) == 0x000000, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::EntryPoint' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, Temp_int_Loop_Counter_Variable_2) == 0x000018, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, Temp_int_Variable) == 0x000024, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_Event_Index_2) == 0x00002C, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_Event_Source_2) == 0x000030, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_Event_Item_State_2) == 0x000038, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_Event_Index_1) == 0x000040, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_Event_Source_1) == 0x000048, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_Event_Item_State_1) == 0x000050, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_Event_Index) == 0x000058, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_Event_Source) == 0x000060, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_Event_Item_State) == 0x000068, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_GetWidget_ReturnValue) == 0x000070, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_ComponentBoundEvent_Source_1) == 0x000078, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_ComponentBoundEvent_Source_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_DynamicCast_AsW_Camera_PC_UI) == 0x000080, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_DynamicCast_AsW_Camera_PC_UI' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_GetGameMode_ReturnValue) == 0x000090, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_DynamicCast_AsGM) == 0x000098, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_ComponentBoundEvent_Source) == 0x0000B8, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_ComponentBoundEvent_Source' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, Temp_int_Variable_1) == 0x0000C0, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_Length_ReturnValue_1) == 0x0000E0, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E4, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_LastIndex_ReturnValue) == 0x0000E8, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000EC, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000F0, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000F4, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_LastIndex_ReturnValue_1) == 0x0000F8, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000FC, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_CustomEvent_Index) == 0x000100, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_Get_Item_2) == 0x000108, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_Get_Item_3) == 0x000128, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_GetDisplayName_ReturnValue) == 0x000130, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_Get_Item_4) == 0x000140, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Concat_StrStr_ReturnValue) == 0x000148, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_GetDisplayName_ReturnValue_1) == 0x000158, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000168, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Array_Length_ReturnValue_2) == 0x000178, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, CallFunc_Less_IntInt_ReturnValue_2) == 0x00017C, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_ExecuteUbergraph_PC_Cameras, K2Node_CreateDelegate_OutputDelegate_1) == 0x000180, "Member 'PC_Cameras_C_ExecuteUbergraph_PC_Cameras::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct PC_Cameras_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_Get_Key) == 0x000008, "Wrong alignment on PC_Cameras_C_Get_Key");
static_assert(sizeof(PC_Cameras_C_Get_Key) == 0x000008, "Wrong size on PC_Cameras_C_Get_Key");
static_assert(offsetof(PC_Cameras_C_Get_Key, Key) == 0x000000, "Member 'PC_Cameras_C_Get_Key::Key' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct PC_Cameras_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_Get_Name) == 0x000008, "Wrong alignment on PC_Cameras_C_Get_Name");
static_assert(sizeof(PC_Cameras_C_Get_Name) == 0x000018, "Wrong size on PC_Cameras_C_Get_Name");
static_assert(offsetof(PC_Cameras_C_Get_Name, Mec) == 0x000000, "Member 'PC_Cameras_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_Get_Name, Name_0) == 0x000008, "Member 'PC_Cameras_C_Get_Name::Name_0' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct PC_Cameras_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_Local_Interaction) == 0x000008, "Wrong alignment on PC_Cameras_C_Local_Interaction");
static_assert(sizeof(PC_Cameras_C_Local_Interaction) == 0x000018, "Wrong size on PC_Cameras_C_Local_Interaction");
static_assert(offsetof(PC_Cameras_C_Local_Interaction, Index_0) == 0x000000, "Member 'PC_Cameras_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_Local_Interaction, Source) == 0x000008, "Member 'PC_Cameras_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_Local_Interaction, Item_State) == 0x000010, "Member 'PC_Cameras_C_Local_Interaction::Item_State' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct PC_Cameras_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_Net_Interaction) == 0x000008, "Wrong alignment on PC_Cameras_C_Net_Interaction");
static_assert(sizeof(PC_Cameras_C_Net_Interaction) == 0x000018, "Wrong size on PC_Cameras_C_Net_Interaction");
static_assert(offsetof(PC_Cameras_C_Net_Interaction, Index_0) == 0x000000, "Member 'PC_Cameras_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_Net_Interaction, Source) == 0x000008, "Member 'PC_Cameras_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_Net_Interaction, Item_State) == 0x000010, "Member 'PC_Cameras_C_Net_Interaction::Item_State' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct PC_Cameras_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_Other_Interaction) == 0x000008, "Wrong alignment on PC_Cameras_C_Other_Interaction");
static_assert(sizeof(PC_Cameras_C_Other_Interaction) == 0x000018, "Wrong size on PC_Cameras_C_Other_Interaction");
static_assert(offsetof(PC_Cameras_C_Other_Interaction, Index_0) == 0x000000, "Member 'PC_Cameras_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_Other_Interaction, Source) == 0x000008, "Member 'PC_Cameras_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_Other_Interaction, Item_State) == 0x000010, "Member 'PC_Cameras_C_Other_Interaction::Item_State' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.Set Screen Info
// 0x0001 (0x0001 - 0x0000)
struct PC_Cameras_C_Set_Screen_Info final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_Set_Screen_Info) == 0x000001, "Wrong alignment on PC_Cameras_C_Set_Screen_Info");
static_assert(sizeof(PC_Cameras_C_Set_Screen_Info) == 0x000001, "Wrong size on PC_Cameras_C_Set_Screen_Info");
static_assert(offsetof(PC_Cameras_C_Set_Screen_Info, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PC_Cameras_C_Set_Screen_Info::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PC_Cameras.PC_Cameras_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct PC_Cameras_C_UserConstructionScript final
{
public:
	class AButton_C*                              K2Node_DynamicCast_AsButton;                       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton_1;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_Cameras_C_UserConstructionScript) == 0x000008, "Wrong alignment on PC_Cameras_C_UserConstructionScript");
static_assert(sizeof(PC_Cameras_C_UserConstructionScript) == 0x000020, "Wrong size on PC_Cameras_C_UserConstructionScript");
static_assert(offsetof(PC_Cameras_C_UserConstructionScript, K2Node_DynamicCast_AsButton) == 0x000000, "Member 'PC_Cameras_C_UserConstructionScript::K2Node_DynamicCast_AsButton' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'PC_Cameras_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PC_Cameras_C_UserConstructionScript, K2Node_DynamicCast_AsButton_1) == 0x000010, "Member 'PC_Cameras_C_UserConstructionScript::K2Node_DynamicCast_AsButton_1' has a wrong offset!");
