#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_tuto

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Str_ItemState_structs.hpp"


namespace SDK::Params
{

// Function PC_tuto.PC_tuto_C.BndEvt__Data_PC_Button L_K2Node_ComponentBoundEvent_1_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PC_tuto_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on PC_tuto_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature");
static_assert(sizeof(PC_tuto_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature) == 0x000008, "Wrong size on PC_tuto_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature");
static_assert(offsetof(PC_tuto_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'PC_tuto_C_BndEvt__Data_PC_Button_L_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PC_tuto_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on PC_tuto_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(sizeof(PC_tuto_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong size on PC_tuto_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(offsetof(PC_tuto_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'PC_tuto_C_BndEvt__Data_PC_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.BndEvt__PC_tuto_Button Enter_K2Node_ComponentBoundEvent_2_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PC_tuto_C_BndEvt__PC_tuto_Button_Enter_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_BndEvt__PC_tuto_Button_Enter_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on PC_tuto_C_BndEvt__PC_tuto_Button_Enter_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature");
static_assert(sizeof(PC_tuto_C_BndEvt__PC_tuto_Button_Enter_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature) == 0x000008, "Wrong size on PC_tuto_C_BndEvt__PC_tuto_Button_Enter_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature");
static_assert(offsetof(PC_tuto_C_BndEvt__PC_tuto_Button_Enter_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'PC_tuto_C_BndEvt__PC_tuto_Button_Enter_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.BndEvt__PC_tuto_Button Left_K2Node_ComponentBoundEvent_5_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PC_tuto_C_BndEvt__PC_tuto_Button_Left_K2Node_ComponentBoundEvent_5_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_BndEvt__PC_tuto_Button_Left_K2Node_ComponentBoundEvent_5_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on PC_tuto_C_BndEvt__PC_tuto_Button_Left_K2Node_ComponentBoundEvent_5_Button_Push__DelegateSignature");
static_assert(sizeof(PC_tuto_C_BndEvt__PC_tuto_Button_Left_K2Node_ComponentBoundEvent_5_Button_Push__DelegateSignature) == 0x000008, "Wrong size on PC_tuto_C_BndEvt__PC_tuto_Button_Left_K2Node_ComponentBoundEvent_5_Button_Push__DelegateSignature");
static_assert(offsetof(PC_tuto_C_BndEvt__PC_tuto_Button_Left_K2Node_ComponentBoundEvent_5_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'PC_tuto_C_BndEvt__PC_tuto_Button_Left_K2Node_ComponentBoundEvent_5_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.BndEvt__PC_tuto_Button Play_K2Node_ComponentBoundEvent_3_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PC_tuto_C_BndEvt__PC_tuto_Button_Play_K2Node_ComponentBoundEvent_3_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_BndEvt__PC_tuto_Button_Play_K2Node_ComponentBoundEvent_3_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on PC_tuto_C_BndEvt__PC_tuto_Button_Play_K2Node_ComponentBoundEvent_3_Button_Push__DelegateSignature");
static_assert(sizeof(PC_tuto_C_BndEvt__PC_tuto_Button_Play_K2Node_ComponentBoundEvent_3_Button_Push__DelegateSignature) == 0x000008, "Wrong size on PC_tuto_C_BndEvt__PC_tuto_Button_Play_K2Node_ComponentBoundEvent_3_Button_Push__DelegateSignature");
static_assert(offsetof(PC_tuto_C_BndEvt__PC_tuto_Button_Play_K2Node_ComponentBoundEvent_3_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'PC_tuto_C_BndEvt__PC_tuto_Button_Play_K2Node_ComponentBoundEvent_3_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.BndEvt__PC_tuto_Button Right_K2Node_ComponentBoundEvent_4_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PC_tuto_C_BndEvt__PC_tuto_Button_Right_K2Node_ComponentBoundEvent_4_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_BndEvt__PC_tuto_Button_Right_K2Node_ComponentBoundEvent_4_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on PC_tuto_C_BndEvt__PC_tuto_Button_Right_K2Node_ComponentBoundEvent_4_Button_Push__DelegateSignature");
static_assert(sizeof(PC_tuto_C_BndEvt__PC_tuto_Button_Right_K2Node_ComponentBoundEvent_4_Button_Push__DelegateSignature) == 0x000008, "Wrong size on PC_tuto_C_BndEvt__PC_tuto_Button_Right_K2Node_ComponentBoundEvent_4_Button_Push__DelegateSignature");
static_assert(offsetof(PC_tuto_C_BndEvt__PC_tuto_Button_Right_K2Node_ComponentBoundEvent_4_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'PC_tuto_C_BndEvt__PC_tuto_Button_Right_K2Node_ComponentBoundEvent_4_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.ExecuteUbergraph_PC_tuto
// 0x0130 (0x0130 - 0x0000)
struct PC_tuto_C_ExecuteUbergraph_PC_tuto final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_2;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source_5;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_TutoPC_UI_C*                         K2Node_DynamicCast_AsW_Tuto_PC_UI;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source_4;               // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source_3;               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSource*                           CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source_2;               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source_1;               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           CallFunc_Array_Get_Item_2;                         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           CallFunc_Array_Get_Item_3;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Get_Media_Time_Time;                      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_ExecuteUbergraph_PC_tuto) == 0x000008, "Wrong alignment on PC_tuto_C_ExecuteUbergraph_PC_tuto");
static_assert(sizeof(PC_tuto_C_ExecuteUbergraph_PC_tuto) == 0x000130, "Wrong size on PC_tuto_C_ExecuteUbergraph_PC_tuto");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, EntryPoint) == 0x000000, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::EntryPoint' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_Event_Index_2) == 0x000008, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_Event_Source_2) == 0x000010, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_Event_Item_State_2) == 0x000018, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_Event_Index_1) == 0x000020, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_Event_Source_1) == 0x000028, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_Event_Item_State_1) == 0x000030, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_Event_Index) == 0x000038, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_Event_Source) == 0x000040, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_Event_Item_State) == 0x000048, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_GetWidget_ReturnValue) == 0x000050, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_ComponentBoundEvent_Source_5) == 0x000058, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_ComponentBoundEvent_Source_5' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_DynamicCast_AsW_Tuto_PC_UI) == 0x000060, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_DynamicCast_AsW_Tuto_PC_UI' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_GetGameMode_ReturnValue) == 0x000070, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_DynamicCast_AsGM) == 0x000078, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_ComponentBoundEvent_Source_4) == 0x000098, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_ComponentBoundEvent_Source_4' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A0, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_ComponentBoundEvent_Source_3) == 0x0000B0, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_ComponentBoundEvent_Source_3' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Array_LastIndex_ReturnValue) == 0x0000C0, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Array_LastIndex_ReturnValue_1) == 0x0000CC, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000D0, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D4, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D8, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000E8, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Array_LastIndex_ReturnValue_2) == 0x0000EC, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Array_LastIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000F0, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_ComponentBoundEvent_Source_2) == 0x000100, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_ComponentBoundEvent_Source_2' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_ComponentBoundEvent_Source_1) == 0x000108, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_ComponentBoundEvent_Source_1' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, K2Node_ComponentBoundEvent_Source) == 0x000110, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::K2Node_ComponentBoundEvent_Source' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Array_Get_Item_2) == 0x000118, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Array_Get_Item_3) == 0x000120, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_ExecuteUbergraph_PC_tuto, CallFunc_Get_Media_Time_Time) == 0x000128, "Member 'PC_tuto_C_ExecuteUbergraph_PC_tuto::CallFunc_Get_Media_Time_Time' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct PC_tuto_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_Get_Key) == 0x000008, "Wrong alignment on PC_tuto_C_Get_Key");
static_assert(sizeof(PC_tuto_C_Get_Key) == 0x000008, "Wrong size on PC_tuto_C_Get_Key");
static_assert(offsetof(PC_tuto_C_Get_Key, Key) == 0x000000, "Member 'PC_tuto_C_Get_Key::Key' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.Get Media Time
// 0x0010 (0x0010 - 0x0000)
struct PC_tuto_C_Get_Media_Time final
{
public:
	struct FTimespan                              Time;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetTime_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_Get_Media_Time) == 0x000008, "Wrong alignment on PC_tuto_C_Get_Media_Time");
static_assert(sizeof(PC_tuto_C_Get_Media_Time) == 0x000010, "Wrong size on PC_tuto_C_Get_Media_Time");
static_assert(offsetof(PC_tuto_C_Get_Media_Time, Time) == 0x000000, "Member 'PC_tuto_C_Get_Media_Time::Time' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_Get_Media_Time, CallFunc_GetTime_ReturnValue) == 0x000008, "Member 'PC_tuto_C_Get_Media_Time::CallFunc_GetTime_ReturnValue' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct PC_tuto_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_Get_Name) == 0x000008, "Wrong alignment on PC_tuto_C_Get_Name");
static_assert(sizeof(PC_tuto_C_Get_Name) == 0x000018, "Wrong size on PC_tuto_C_Get_Name");
static_assert(offsetof(PC_tuto_C_Get_Name, Mec) == 0x000000, "Member 'PC_tuto_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_Get_Name, Name_0) == 0x000008, "Member 'PC_tuto_C_Get_Name::Name_0' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct PC_tuto_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_Local_Interaction) == 0x000008, "Wrong alignment on PC_tuto_C_Local_Interaction");
static_assert(sizeof(PC_tuto_C_Local_Interaction) == 0x000018, "Wrong size on PC_tuto_C_Local_Interaction");
static_assert(offsetof(PC_tuto_C_Local_Interaction, Index_0) == 0x000000, "Member 'PC_tuto_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_Local_Interaction, Source) == 0x000008, "Member 'PC_tuto_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_Local_Interaction, Item_State) == 0x000010, "Member 'PC_tuto_C_Local_Interaction::Item_State' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct PC_tuto_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_Net_Interaction) == 0x000008, "Wrong alignment on PC_tuto_C_Net_Interaction");
static_assert(sizeof(PC_tuto_C_Net_Interaction) == 0x000018, "Wrong size on PC_tuto_C_Net_Interaction");
static_assert(offsetof(PC_tuto_C_Net_Interaction, Index_0) == 0x000000, "Member 'PC_tuto_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_Net_Interaction, Source) == 0x000008, "Member 'PC_tuto_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_Net_Interaction, Item_State) == 0x000010, "Member 'PC_tuto_C_Net_Interaction::Item_State' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct PC_tuto_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_Other_Interaction) == 0x000008, "Wrong alignment on PC_tuto_C_Other_Interaction");
static_assert(sizeof(PC_tuto_C_Other_Interaction) == 0x000018, "Wrong size on PC_tuto_C_Other_Interaction");
static_assert(offsetof(PC_tuto_C_Other_Interaction, Index_0) == 0x000000, "Member 'PC_tuto_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_Other_Interaction, Source) == 0x000008, "Member 'PC_tuto_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_Other_Interaction, Item_State) == 0x000010, "Member 'PC_tuto_C_Other_Interaction::Item_State' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.Set Screen Info
// 0x0001 (0x0001 - 0x0000)
struct PC_tuto_C_Set_Screen_Info final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_Set_Screen_Info) == 0x000001, "Wrong alignment on PC_tuto_C_Set_Screen_Info");
static_assert(sizeof(PC_tuto_C_Set_Screen_Info) == 0x000001, "Wrong size on PC_tuto_C_Set_Screen_Info");
static_assert(offsetof(PC_tuto_C_Set_Screen_Info, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PC_tuto_C_Set_Screen_Info::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PC_tuto.PC_tuto_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct PC_tuto_C_UserConstructionScript final
{
public:
	class AButton_C*                              K2Node_DynamicCast_AsButton;                       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton_1;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton_2;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton_3;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton_4;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton_5;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_tuto_C_UserConstructionScript) == 0x000008, "Wrong alignment on PC_tuto_C_UserConstructionScript");
static_assert(sizeof(PC_tuto_C_UserConstructionScript) == 0x000060, "Wrong size on PC_tuto_C_UserConstructionScript");
static_assert(offsetof(PC_tuto_C_UserConstructionScript, K2Node_DynamicCast_AsButton) == 0x000000, "Member 'PC_tuto_C_UserConstructionScript::K2Node_DynamicCast_AsButton' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'PC_tuto_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PC_tuto_C_UserConstructionScript, K2Node_DynamicCast_AsButton_1) == 0x000010, "Member 'PC_tuto_C_UserConstructionScript::K2Node_DynamicCast_AsButton_1' has a wrong offset!");
