#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSpawn

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerSpawn.PlayerSpawn_C
// 0x0020 (0x02C8 - 0x02A8)
class APlayerSpawn_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Debug_Count;                                       // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Debug_Ratio;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Debug_Distance;                                    // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lobby;                                             // 0x02C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Generate_Locations(int32 Count, TArray<struct FVector>* Locations);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSpawn_C">();
	}
	static class APlayerSpawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerSpawn_C>();
	}
};
static_assert(alignof(APlayerSpawn_C) == 0x000008, "Wrong alignment on APlayerSpawn_C");
static_assert(sizeof(APlayerSpawn_C) == 0x0002C8, "Wrong size on APlayerSpawn_C");
static_assert(offsetof(APlayerSpawn_C, DefaultSceneRoot) == 0x0002A8, "Member 'APlayerSpawn_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APlayerSpawn_C, Debug_Count) == 0x0002B0, "Member 'APlayerSpawn_C::Debug_Count' has a wrong offset!");
static_assert(offsetof(APlayerSpawn_C, Debug_Ratio) == 0x0002B8, "Member 'APlayerSpawn_C::Debug_Ratio' has a wrong offset!");
static_assert(offsetof(APlayerSpawn_C, Debug_Distance) == 0x0002C0, "Member 'APlayerSpawn_C::Debug_Distance' has a wrong offset!");
static_assert(offsetof(APlayerSpawn_C, Lobby) == 0x0002C4, "Member 'APlayerSpawn_C::Lobby' has a wrong offset!");

}

