#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSpawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerSpawn.PlayerSpawn_C.Generate Locations
// 0x0330 (0x0330 - 0x0000)
struct PlayerSpawn_C_Generate_Locations final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Locations;                                         // 0x0008(0x0010)(Parm, OutParm)
	double                                        Random_Rotation;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        _Locations;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0150(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSpawn_C_Generate_Locations) == 0x000010, "Wrong alignment on PlayerSpawn_C_Generate_Locations");
static_assert(sizeof(PlayerSpawn_C_Generate_Locations) == 0x000330, "Wrong size on PlayerSpawn_C_Generate_Locations");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, Count) == 0x000000, "Member 'PlayerSpawn_C_Generate_Locations::Count' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, Locations) == 0x000008, "Member 'PlayerSpawn_C_Generate_Locations::Locations' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, Random_Rotation) == 0x000018, "Member 'PlayerSpawn_C_Generate_Locations::Random_Rotation' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, _Locations) == 0x000020, "Member 'PlayerSpawn_C_Generate_Locations::_Locations' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000030, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, Temp_int_Variable) == 0x000058, "Member 'PlayerSpawn_C_Generate_Locations::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000070, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000078, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000088, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000098, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000A0, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_MakeRotator_ReturnValue) == 0x0000B0, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0000C8, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_GetForwardVector_ReturnValue) == 0x0000D0, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_GetTransform_ReturnValue) == 0x0000F0, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_GetTransform_ReturnValue_1) == 0x000150, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001B0, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Conv_IntToVector_ReturnValue) == 0x0001B8, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_MakeVector_ReturnValue) == 0x0001D0, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001E8, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_TransformLocation_ReturnValue) == 0x000200, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000218, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakVector_X) == 0x000230, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakVector_Y) == 0x000238, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakVector_Z) == 0x000240, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakVector_X_1) == 0x000248, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakVector_Y_1) == 0x000250, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakVector_Z_1) == 0x000258, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_MakeVector_ReturnValue_1) == 0x000260, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_MakeVector_ReturnValue_2) == 0x000278, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_TransformLocation_ReturnValue_1) == 0x000290, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_TransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakVector_X_2) == 0x0002A8, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakVector_Y_2) == 0x0002B0, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakVector_Z_2) == 0x0002B8, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_MakeVector_ReturnValue_3) == 0x0002C0, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_FindLookAtRotation_ReturnValue) == 0x0002D8, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakRotator_Roll) == 0x0002F0, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakRotator_Pitch) == 0x0002F4, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_BreakRotator_Yaw) == 0x0002F8, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_MakeVector_ReturnValue_4) == 0x000300, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_Array_Add_ReturnValue) == 0x000318, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00031C, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_Generate_Locations, CallFunc_MakeVector_Z_ImplicitCast) == 0x000320, "Member 'PlayerSpawn_C_Generate_Locations::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");

// Function PlayerSpawn.PlayerSpawn_C.UserConstructionScript
// 0x0250 (0x0250 - 0x0000)
struct PlayerSpawn_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_Generate_Locations_Locations;             // 0x00B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0140(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSpawn_C_UserConstructionScript) == 0x000010, "Wrong alignment on PlayerSpawn_C_UserConstructionScript");
static_assert(sizeof(PlayerSpawn_C_UserConstructionScript) == 0x000250, "Wrong size on PlayerSpawn_C_UserConstructionScript");
static_assert(offsetof(PlayerSpawn_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'PlayerSpawn_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000060, "Member 'PlayerSpawn_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSpawn_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000068, "Member 'PlayerSpawn_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
