#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RenderZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RenderZone.RenderZone_C.UserConstructionScript
// 0x00A8 (0x00A8 - 0x0000)
struct RenderZone_C_UserConstructionScript final
{
public:
	double                                        CallFunc_BreakVector2D_X;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RenderZone_C_UserConstructionScript) == 0x000008, "Wrong alignment on RenderZone_C_UserConstructionScript");
static_assert(sizeof(RenderZone_C_UserConstructionScript) == 0x0000A8, "Wrong size on RenderZone_C_UserConstructionScript");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_BreakVector2D_X) == 0x000000, "Member 'RenderZone_C_UserConstructionScript::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'RenderZone_C_UserConstructionScript::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'RenderZone_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000028, "Member 'RenderZone_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000030, "Member 'RenderZone_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000038, "Member 'RenderZone_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_BreakVector2D_X_1) == 0x000040, "Member 'RenderZone_C_UserConstructionScript::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_BreakVector2D_Y_1) == 0x000048, "Member 'RenderZone_C_UserConstructionScript::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'RenderZone_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'RenderZone_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'RenderZone_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'RenderZone_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'RenderZone_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue) == 0x000088, "Member 'RenderZone_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(RenderZone_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue_1) == 0x000098, "Member 'RenderZone_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

}

