#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RezCharger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_GenericMachine_State_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass RezCharger.RezCharger_C
// 0x00F0 (0x0398 - 0x02A8)
class ARezCharger_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Full_Indicator;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Charge_Indicator_;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Battery_Indicator_R;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Battery_Indicator_L;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_SoundPath;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Gauge_R;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Gauge_Rez;                                      // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_Rez;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_Battery_L;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Gauge_L;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_Battery_R;                                       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Process;                                           // 0x0318(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Battery_Jauge_C*                     W_Screen;                                          // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x0328(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Charge_Speed;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	E_GenericMachine_State                        State;                                             // 0x0338(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemSlot_C*                            Battery_R;                                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AButton_C*                              Button;                                            // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Charge_R;                                          // 0x0350(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemSlot_C*                            Battery_L;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            Rez;                                               // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Charge_L;                                          // 0x0368(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASoundPath_C*                           SoundPath;                                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Battery_L_M;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Battery_R_M;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Charge_M;                                          // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Full_M;                                            // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Bip();
	void BndEvt__Analyzer_Sample_K2Node_ComponentBoundEvent_1_Place_Item__DelegateSignature();
	void BndEvt__Analyzer_Sample_K2Node_ComponentBoundEvent_2_Take_Item__DelegateSignature();
	void BndEvt__RezCharger_Battery_Top_K2Node_ComponentBoundEvent_4_Place_Item__DelegateSignature();
	void BndEvt__RezCharger_Battery_Top_K2Node_ComponentBoundEvent_5_Take_Item__DelegateSignature();
	void BndEvt__RezCharger_Rez_K2Node_ComponentBoundEvent_0_Place_Item__DelegateSignature();
	void BndEvt__RezCharger_Rez_K2Node_ComponentBoundEvent_3_Take_Item__DelegateSignature();
	void Clear();
	void ExecuteUbergraph_RezCharger(int32 EntryPoint);
	void Get_Key(class AActor** Key);
	void Get_Name(class AMec_C* Mec, class FString* Name_0);
	void Local_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Net_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void OnRep_Charge_L();
	void OnRep_Charge_R();
	void OnRep_Process();
	void OnRep_State();
	void Other_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Pause_Process();
	void Process_Screen();
	void Process_Tick();
	void ReceiveBeginPlay();
	void Start_Process();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RezCharger_C">();
	}
	static class ARezCharger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARezCharger_C>();
	}
};
static_assert(alignof(ARezCharger_C) == 0x000008, "Wrong alignment on ARezCharger_C");
static_assert(sizeof(ARezCharger_C) == 0x000398, "Wrong size on ARezCharger_C");
static_assert(offsetof(ARezCharger_C, UberGraphFrame) == 0x0002A8, "Member 'ARezCharger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Full_Indicator) == 0x0002B0, "Member 'ARezCharger_C::Full_Indicator' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Charge_Indicator_) == 0x0002B8, "Member 'ARezCharger_C::Charge_Indicator_' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Battery_Indicator_R) == 0x0002C0, "Member 'ARezCharger_C::Battery_Indicator_R' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Battery_Indicator_L) == 0x0002C8, "Member 'ARezCharger_C::Battery_Indicator_L' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, C_SoundPath) == 0x0002D0, "Member 'ARezCharger_C::C_SoundPath' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, SM_Gauge_R) == 0x0002D8, "Member 'ARezCharger_C::SM_Gauge_R' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, SM_Gauge_Rez) == 0x0002E0, "Member 'ARezCharger_C::SM_Gauge_Rez' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, C_Rez) == 0x0002E8, "Member 'ARezCharger_C::C_Rez' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, C_Battery_L) == 0x0002F0, "Member 'ARezCharger_C::C_Battery_L' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, SM_Gauge_L) == 0x0002F8, "Member 'ARezCharger_C::SM_Gauge_L' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, C_Battery_R) == 0x000300, "Member 'ARezCharger_C::C_Battery_R' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Root) == 0x000308, "Member 'ARezCharger_C::Root' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Cube) == 0x000310, "Member 'ARezCharger_C::Cube' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Process) == 0x000318, "Member 'ARezCharger_C::Process' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, W_Screen) == 0x000320, "Member 'ARezCharger_C::W_Screen' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Timer) == 0x000328, "Member 'ARezCharger_C::Timer' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Charge_Speed) == 0x000330, "Member 'ARezCharger_C::Charge_Speed' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, State) == 0x000338, "Member 'ARezCharger_C::State' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Battery_R) == 0x000340, "Member 'ARezCharger_C::Battery_R' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Button) == 0x000348, "Member 'ARezCharger_C::Button' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Charge_R) == 0x000350, "Member 'ARezCharger_C::Charge_R' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Battery_L) == 0x000358, "Member 'ARezCharger_C::Battery_L' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Rez) == 0x000360, "Member 'ARezCharger_C::Rez' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Charge_L) == 0x000368, "Member 'ARezCharger_C::Charge_L' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, SoundPath) == 0x000370, "Member 'ARezCharger_C::SoundPath' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Battery_L_M) == 0x000378, "Member 'ARezCharger_C::Battery_L_M' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Battery_R_M) == 0x000380, "Member 'ARezCharger_C::Battery_R_M' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Charge_M) == 0x000388, "Member 'ARezCharger_C::Charge_M' has a wrong offset!");
static_assert(offsetof(ARezCharger_C, Full_M) == 0x000390, "Member 'ARezCharger_C::Full_M' has a wrong offset!");

}

