#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RezCharger

#include "Basic.hpp"

#include "Str_ItemState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RezCharger.RezCharger_C.ExecuteUbergraph_RezCharger
// 0x0210 (0x0210 - 0x0000)
struct RezCharger_C_ExecuteUbergraph_RezCharger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_4;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_5;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_6;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_7;             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_8;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_9;             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_10;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location;                        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_1;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_1;                      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_2;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_2;                      // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_11;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_3;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_3;                      // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_12;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_4;                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_4;                      // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_4;         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance_5;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location_5;                      // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_13;            // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_14;            // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_6;        // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_2;                      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState_1;                 // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Range___;                             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_5;         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_15;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_16;            // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAttached_PitchMultiplier_ImplicitCast; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_ExecuteUbergraph_RezCharger) == 0x000008, "Wrong alignment on RezCharger_C_ExecuteUbergraph_RezCharger");
static_assert(sizeof(RezCharger_C_ExecuteUbergraph_RezCharger) == 0x000210, "Wrong size on RezCharger_C_ExecuteUbergraph_RezCharger");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, EntryPoint) == 0x000000, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::EntryPoint' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000006, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000008, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000009, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanOR_ReturnValue_1) == 0x00000A, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_2) == 0x00000B, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_3) == 0x00000C, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x00000E, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_4) == 0x00000F, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanAND_ReturnValue_1) == 0x000010, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanOR_ReturnValue_2) == 0x000011, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x000012, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanOR_ReturnValue_3) == 0x000013, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_GreaterEqual_IntInt_ReturnValue_4) == 0x000014, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_GreaterEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanOR_ReturnValue_4) == 0x000015, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_5) == 0x000016, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_MakeStruct_Str_ItemState) == 0x000018, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_GreaterEqual_IntInt_ReturnValue_5) == 0x000020, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_GreaterEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanOR_ReturnValue_5) == 0x000021, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_6) == 0x000022, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_7) == 0x000023, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanAND_ReturnValue_2) == 0x000024, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_8) == 0x000025, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanAND_ReturnValue_3) == 0x000026, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_9) == 0x000027, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_10) == 0x000028, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanAND_ReturnValue_4) == 0x000029, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000030, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Distance) == 0x000038, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Distance' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Location) == 0x000040, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Location' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Distance_1) == 0x000058, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Distance_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Location_1) == 0x000060, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Location_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000078, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Distance_2) == 0x000080, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Distance_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Location_2) == 0x000088, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Location_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_11) == 0x0000A0, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x0000A8, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Distance_3) == 0x0000B0, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Distance_3' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Location_3) == 0x0000B8, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Location_3' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_12) == 0x0000D0, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanAND_ReturnValue_5) == 0x0000D1, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x0000D8, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Distance_4) == 0x0000E0, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Distance_4' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Location_4) == 0x0000E8, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Location_4' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_SpawnSoundAttached_ReturnValue_4) == 0x000100, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_SpawnSoundAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Distance_5) == 0x000108, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Distance_5' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Get_Path_Location_5) == 0x000110, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Get_Path_Location_5' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_Event_Index_2) == 0x000128, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_Event_Source_2) == 0x000130, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_Event_Item_State_2) == 0x000138, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_Event_Index_1) == 0x000140, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_Event_Source_1) == 0x000148, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_Event_Item_State_1) == 0x000150, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_Event_Index) == 0x000158, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_Event_Source) == 0x000160, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_Event_Item_State) == 0x000168, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Add_IntInt_ReturnValue) == 0x000170, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Clamp_ReturnValue) == 0x000174, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000188, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_GetGameMode_ReturnValue) == 0x000190, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_DynamicCast_AsGM) == 0x000198, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_13) == 0x0001A1, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_14) == 0x0001A2, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanAND_ReturnValue_6) == 0x0001A3, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001A4, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Clamp_ReturnValue_1) == 0x0001A8, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_GreaterEqual_IntInt_ReturnValue_6) == 0x0001AC, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_GreaterEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001B0, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Clamp_ReturnValue_2) == 0x0001B4, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Clamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B8, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001C8, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0001D0, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, K2Node_MakeStruct_Str_ItemState_1) == 0x0001D4, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::K2Node_MakeStruct_Str_ItemState_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0001E0, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Less_IntInt_ReturnValue) == 0x0001E8, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Map_Range___) == 0x0001F0, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Map_Range___' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_SpawnSoundAttached_ReturnValue_5) == 0x0001F8, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_SpawnSoundAttached_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_15) == 0x000200, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_Greater_IntInt_ReturnValue_16) == 0x000201, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_Greater_IntInt_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_BooleanAND_ReturnValue_7) == 0x000202, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000204, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(RezCharger_C_ExecuteUbergraph_RezCharger, CallFunc_SpawnSoundAttached_PitchMultiplier_ImplicitCast) == 0x000208, "Member 'RezCharger_C_ExecuteUbergraph_RezCharger::CallFunc_SpawnSoundAttached_PitchMultiplier_ImplicitCast' has a wrong offset!");

// Function RezCharger.RezCharger_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct RezCharger_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_Get_Key) == 0x000008, "Wrong alignment on RezCharger_C_Get_Key");
static_assert(sizeof(RezCharger_C_Get_Key) == 0x000008, "Wrong size on RezCharger_C_Get_Key");
static_assert(offsetof(RezCharger_C_Get_Key, Key) == 0x000000, "Member 'RezCharger_C_Get_Key::Key' has a wrong offset!");

// Function RezCharger.RezCharger_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct RezCharger_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_Get_Name) == 0x000008, "Wrong alignment on RezCharger_C_Get_Name");
static_assert(sizeof(RezCharger_C_Get_Name) == 0x000018, "Wrong size on RezCharger_C_Get_Name");
static_assert(offsetof(RezCharger_C_Get_Name, Mec) == 0x000000, "Member 'RezCharger_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(RezCharger_C_Get_Name, Name_0) == 0x000008, "Member 'RezCharger_C_Get_Name::Name_0' has a wrong offset!");

// Function RezCharger.RezCharger_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct RezCharger_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_Local_Interaction) == 0x000008, "Wrong alignment on RezCharger_C_Local_Interaction");
static_assert(sizeof(RezCharger_C_Local_Interaction) == 0x000018, "Wrong size on RezCharger_C_Local_Interaction");
static_assert(offsetof(RezCharger_C_Local_Interaction, Index_0) == 0x000000, "Member 'RezCharger_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(RezCharger_C_Local_Interaction, Source) == 0x000008, "Member 'RezCharger_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(RezCharger_C_Local_Interaction, Item_State) == 0x000010, "Member 'RezCharger_C_Local_Interaction::Item_State' has a wrong offset!");

// Function RezCharger.RezCharger_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct RezCharger_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_Net_Interaction) == 0x000008, "Wrong alignment on RezCharger_C_Net_Interaction");
static_assert(sizeof(RezCharger_C_Net_Interaction) == 0x000018, "Wrong size on RezCharger_C_Net_Interaction");
static_assert(offsetof(RezCharger_C_Net_Interaction, Index_0) == 0x000000, "Member 'RezCharger_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(RezCharger_C_Net_Interaction, Source) == 0x000008, "Member 'RezCharger_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(RezCharger_C_Net_Interaction, Item_State) == 0x000010, "Member 'RezCharger_C_Net_Interaction::Item_State' has a wrong offset!");

// Function RezCharger.RezCharger_C.OnRep_Charge L
// 0x0028 (0x0028 - 0x0000)
struct RezCharger_C_OnRep_Charge_L final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_OnRep_Charge_L) == 0x000008, "Wrong alignment on RezCharger_C_OnRep_Charge_L");
static_assert(sizeof(RezCharger_C_OnRep_Charge_L) == 0x000028, "Wrong size on RezCharger_C_OnRep_Charge_L");
static_assert(offsetof(RezCharger_C_OnRep_Charge_L, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'RezCharger_C_OnRep_Charge_L::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_L, CallFunc_HasAuthority_ReturnValue_1) == 0x000001, "Member 'RezCharger_C_OnRep_Charge_L::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_L, K2Node_MakeStruct_Str_ItemState) == 0x000004, "Member 'RezCharger_C_OnRep_Charge_L::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_L, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'RezCharger_C_OnRep_Charge_L::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_L, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'RezCharger_C_OnRep_Charge_L::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_L, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000020, "Member 'RezCharger_C_OnRep_Charge_L::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function RezCharger.RezCharger_C.OnRep_Charge R
// 0x0028 (0x0028 - 0x0000)
struct RezCharger_C_OnRep_Charge_R final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_OnRep_Charge_R) == 0x000008, "Wrong alignment on RezCharger_C_OnRep_Charge_R");
static_assert(sizeof(RezCharger_C_OnRep_Charge_R) == 0x000028, "Wrong size on RezCharger_C_OnRep_Charge_R");
static_assert(offsetof(RezCharger_C_OnRep_Charge_R, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'RezCharger_C_OnRep_Charge_R::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_R, CallFunc_HasAuthority_ReturnValue_1) == 0x000001, "Member 'RezCharger_C_OnRep_Charge_R::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_R, K2Node_MakeStruct_Str_ItemState) == 0x000004, "Member 'RezCharger_C_OnRep_Charge_R::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_R, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'RezCharger_C_OnRep_Charge_R::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_R, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'RezCharger_C_OnRep_Charge_R::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Charge_R, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000020, "Member 'RezCharger_C_OnRep_Charge_R::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function RezCharger.RezCharger_C.OnRep_Process
// 0x0028 (0x0028 - 0x0000)
struct RezCharger_C_OnRep_Process final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_OnRep_Process) == 0x000008, "Wrong alignment on RezCharger_C_OnRep_Process");
static_assert(sizeof(RezCharger_C_OnRep_Process) == 0x000028, "Wrong size on RezCharger_C_OnRep_Process");
static_assert(offsetof(RezCharger_C_OnRep_Process, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'RezCharger_C_OnRep_Process::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Process, CallFunc_HasAuthority_ReturnValue_1) == 0x000001, "Member 'RezCharger_C_OnRep_Process::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Process, CallFunc_Greater_IntInt_ReturnValue) == 0x000002, "Member 'RezCharger_C_OnRep_Process::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Process, CallFunc_Less_IntInt_ReturnValue) == 0x000003, "Member 'RezCharger_C_OnRep_Process::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Process, K2Node_MakeStruct_Str_ItemState) == 0x000004, "Member 'RezCharger_C_OnRep_Process::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Process, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'RezCharger_C_OnRep_Process::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Process, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'RezCharger_C_OnRep_Process::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_Process, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000020, "Member 'RezCharger_C_OnRep_Process::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function RezCharger.RezCharger_C.OnRep_State
// 0x0020 (0x0020 - 0x0000)
struct RezCharger_C_OnRep_State final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_OnRep_State) == 0x000008, "Wrong alignment on RezCharger_C_OnRep_State");
static_assert(sizeof(RezCharger_C_OnRep_State) == 0x000020, "Wrong size on RezCharger_C_OnRep_State");
static_assert(offsetof(RezCharger_C_OnRep_State, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'RezCharger_C_OnRep_State::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_State, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'RezCharger_C_OnRep_State::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_State, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'RezCharger_C_OnRep_State::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RezCharger_C_OnRep_State, K2Node_SwitchEnum_CmpSuccess_1) == 0x000018, "Member 'RezCharger_C_OnRep_State::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function RezCharger.RezCharger_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct RezCharger_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_Other_Interaction) == 0x000008, "Wrong alignment on RezCharger_C_Other_Interaction");
static_assert(sizeof(RezCharger_C_Other_Interaction) == 0x000018, "Wrong size on RezCharger_C_Other_Interaction");
static_assert(offsetof(RezCharger_C_Other_Interaction, Index_0) == 0x000000, "Member 'RezCharger_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(RezCharger_C_Other_Interaction, Source) == 0x000008, "Member 'RezCharger_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(RezCharger_C_Other_Interaction, Item_State) == 0x000010, "Member 'RezCharger_C_Other_Interaction::Item_State' has a wrong offset!");

// Function RezCharger.RezCharger_C.Process Screen
// 0x0001 (0x0001 - 0x0000)
struct RezCharger_C_Process_Screen final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RezCharger_C_Process_Screen) == 0x000001, "Wrong alignment on RezCharger_C_Process_Screen");
static_assert(sizeof(RezCharger_C_Process_Screen) == 0x000001, "Wrong size on RezCharger_C_Process_Screen");
static_assert(offsetof(RezCharger_C_Process_Screen, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'RezCharger_C_Process_Screen::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function RezCharger.RezCharger_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct RezCharger_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASoundPath_C*                           K2Node_DynamicCast_AsSound_Path;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemSlot_C*                            K2Node_DynamicCast_AsItem_Slot;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemSlot_C*                            K2Node_DynamicCast_AsItem_Slot_1;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemSlot_C*                            K2Node_DynamicCast_AsItem_Slot_2;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
