#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rice_Machine

#include "Basic.hpp"

#include "E_RiceMachine_State_structs.hpp"
#include "Str_ItemState_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Rice_Machine.Rice_Machine_C.All Set State
// 0x0008 (0x0008 - 0x0000)
struct Rice_Machine_C_All_Set_State final
{
public:
	E_RiceMachine_State                           State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_All_Set_State) == 0x000004, "Wrong alignment on Rice_Machine_C_All_Set_State");
static_assert(sizeof(Rice_Machine_C_All_Set_State) == 0x000008, "Wrong size on Rice_Machine_C_All_Set_State");
static_assert(offsetof(Rice_Machine_C_All_Set_State, State_0) == 0x000000, "Member 'Rice_Machine_C_All_Set_State::State_0' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_All_Set_State, Index_0) == 0x000004, "Member 'Rice_Machine_C_All_Set_State::Index_0' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Rice_Machine_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on Rice_Machine_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature");
static_assert(sizeof(Rice_Machine_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature) == 0x000008, "Wrong size on Rice_Machine_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature");
static_assert(offsetof(Rice_Machine_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'Rice_Machine_C_BndEvt__Centrifuge_Button_K2Node_ComponentBoundEvent_2_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.ExecuteUbergraph_Rice_Machine
// 0x0580 (0x0580 - 0x0000)
struct Rice_Machine_C_ExecuteUbergraph_Rice_Machine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RiceMachine_State                           Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RiceMachine_State                           Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_6;                            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_7;                            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_8;                            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RiceMachine_State                           Temp_byte_Variable_2;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RiceMachine_State                           Temp_byte_Variable_3;                              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_RiceMachine_State                           Temp_byte_Variable_4;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0134(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0144(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x0154(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_9;                            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_10;                           // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_11;                           // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_12;                           // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Content_Container;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         CallFunc_Get_Content_Content;                      // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Content_Container_1;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         CallFunc_Get_Content_Content_1;                    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Content_Container_2;                  // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         CallFunc_Get_Content_Content_2;                    // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x01F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x01F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RiceMachine_State                           K2Node_Select_Default;                             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RiceMachine_State                           K2Node_Select_Default_1;                           // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FB[0x1];                                      // 0x01FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index_2;                              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RiceMachine_State                           K2Node_CustomEvent_State_1;                        // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RiceMachine_State                           K2Node_CustomEvent_State;                          // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index_1;                        // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_2;                           // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_3;                           // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0348(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1; // 0x0450(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0550(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Rice_Screen_C*                       K2Node_DynamicCast_AsW_Rice_Screen;                // 0x0558(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_5;                           // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572[0x2];                                      // 0x0572(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine) == 0x000008, "Wrong alignment on Rice_Machine_C_ExecuteUbergraph_Rice_Machine");
static_assert(sizeof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine) == 0x000580, "Wrong size on Rice_Machine_C_ExecuteUbergraph_Rice_Machine");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, EntryPoint) == 0x000000, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::EntryPoint' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_bool_Variable) == 0x000004, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_byte_Variable) == 0x000005, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_byte_Variable_1) == 0x000006, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable) == 0x000008, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_1) == 0x000018, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_2) == 0x000028, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_3) == 0x000038, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_4) == 0x000048, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_5) == 0x000058, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_6) == 0x000068, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_6' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_7) == 0x000078, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_7' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_8) == 0x000088, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_8' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_bool_Variable_1) == 0x000098, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_byte_Variable_2) == 0x000099, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_byte_Variable_3) == 0x00009A, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_MakeRotator_ReturnValue) == 0x0000B8, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_byte_Variable_4) == 0x0000D0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_struct_Variable) == 0x0000D4, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_struct_Variable_1) == 0x0000E4, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_struct_Variable_2) == 0x0000F4, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_struct_Variable_3) == 0x000104, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_struct_Variable_4) == 0x000114, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_struct_Variable_5) == 0x000124, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_struct_Variable_6) == 0x000134, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_struct_Variable_7) == 0x000144, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_struct_Variable_8) == 0x000154, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_int_Variable) == 0x000164, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_9) == 0x000168, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_9' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_10) == 0x000178, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_10' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_11) == 0x000188, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_11' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_string_Variable_12) == 0x000198, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_string_Variable_12' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_int_Variable_1) == 0x0001A8, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_object_Variable) == 0x0001B0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_object_Variable_1) == 0x0001B8, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_object_Variable_2) == 0x0001C0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, Temp_object_Variable_3) == 0x0001C8, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Get_Content_Container) == 0x0001D0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Get_Content_Container' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Get_Content_Content) == 0x0001D4, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Get_Content_Content' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Get_Content_Container_1) == 0x0001DC, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Get_Content_Container_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Get_Content_Content_1) == 0x0001E0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Get_Content_Content_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001E8, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Get_Content_Container_2) == 0x0001E9, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Get_Content_Container_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Get_Content_Content_2) == 0x0001EC, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Get_Content_Content_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001F4, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_BooleanAND_ReturnValue) == 0x0001F5, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0001F6, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0001F7, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Select_Default) == 0x0001F8, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_BooleanAND_ReturnValue_1) == 0x0001F9, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Select_Default_1) == 0x0001FA, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Event_Index_2) == 0x0001FC, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Event_Source_2) == 0x000200, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Event_Item_State_2) == 0x000208, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Event_Index_1) == 0x000210, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Event_Source_1) == 0x000218, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Event_Item_State_1) == 0x000220, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Event_Index) == 0x000228, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Event_Source) == 0x000230, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Event_Item_State) == 0x000238, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_SwitchEnum_CmpSuccess) == 0x000240, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_HasAuthority_ReturnValue) == 0x000241, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_ComponentBoundEvent_Source) == 0x000248, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_ComponentBoundEvent_Source' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_CreateDelegate_OutputDelegate) == 0x000250, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_GetGameMode_ReturnValue) == 0x000260, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_DynamicCast_AsGM) == 0x000268, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_DynamicCast_bSuccess) == 0x000270, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_RandomFloatInRange_ReturnValue) == 0x000278, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000280, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000288, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_CustomEvent_State_1) == 0x000290, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_CustomEvent_State_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_BreakVector_X) == 0x000298, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_BreakVector_Y) == 0x0002A0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_BreakVector_Z) == 0x0002A8, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_MakeVector_ReturnValue_1) == 0x0002B0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_MapRangeClamped_ReturnValue) == 0x0002C8, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_CustomEvent_State) == 0x0002D0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_CustomEvent_Index_1) == 0x0002D4, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_CustomEvent_Index_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002D8, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Select_Default_2) == 0x0002E0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Select_Default_3) == 0x0002F0, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000300, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Select_Default_4) == 0x000308, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000318, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000320, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000328, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_MakeRotator_ReturnValue_1) == 0x000330, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000348, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_MakeStruct_Str_ItemState) == 0x000448, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1) == 0x000450, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_GetWidget_ReturnValue) == 0x000550, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_DynamicCast_AsW_Rice_Screen) == 0x000558, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_DynamicCast_AsW_Rice_Screen' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_DynamicCast_bSuccess_1) == 0x000560, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_CustomEvent_Index) == 0x000564, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_Select_Default_5) == 0x000568, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_SwitchEnum_CmpSuccess_1) == 0x000570, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, K2Node_SwitchEnum_CmpSuccess_2) == 0x000571, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000574, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000578, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_ExecuteUbergraph_Rice_Machine, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x00057C, "Member 'Rice_Machine_C_ExecuteUbergraph_Rice_Machine::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct Rice_Machine_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_Get_Key) == 0x000008, "Wrong alignment on Rice_Machine_C_Get_Key");
static_assert(sizeof(Rice_Machine_C_Get_Key) == 0x000008, "Wrong size on Rice_Machine_C_Get_Key");
static_assert(offsetof(Rice_Machine_C_Get_Key, Key) == 0x000000, "Member 'Rice_Machine_C_Get_Key::Key' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct Rice_Machine_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_Get_Name) == 0x000008, "Wrong alignment on Rice_Machine_C_Get_Name");
static_assert(sizeof(Rice_Machine_C_Get_Name) == 0x000018, "Wrong size on Rice_Machine_C_Get_Name");
static_assert(offsetof(Rice_Machine_C_Get_Name, Mec) == 0x000000, "Member 'Rice_Machine_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_Get_Name, Name_0) == 0x000008, "Member 'Rice_Machine_C_Get_Name::Name_0' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct Rice_Machine_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_Local_Interaction) == 0x000008, "Wrong alignment on Rice_Machine_C_Local_Interaction");
static_assert(sizeof(Rice_Machine_C_Local_Interaction) == 0x000018, "Wrong size on Rice_Machine_C_Local_Interaction");
static_assert(offsetof(Rice_Machine_C_Local_Interaction, Index_0) == 0x000000, "Member 'Rice_Machine_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_Local_Interaction, Source) == 0x000008, "Member 'Rice_Machine_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_Local_Interaction, Item_State) == 0x000010, "Member 'Rice_Machine_C_Local_Interaction::Item_State' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct Rice_Machine_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_Net_Interaction) == 0x000008, "Wrong alignment on Rice_Machine_C_Net_Interaction");
static_assert(sizeof(Rice_Machine_C_Net_Interaction) == 0x000018, "Wrong size on Rice_Machine_C_Net_Interaction");
static_assert(offsetof(Rice_Machine_C_Net_Interaction, Index_0) == 0x000000, "Member 'Rice_Machine_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_Net_Interaction, Source) == 0x000008, "Member 'Rice_Machine_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_Net_Interaction, Item_State) == 0x000010, "Member 'Rice_Machine_C_Net_Interaction::Item_State' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct Rice_Machine_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_Other_Interaction) == 0x000008, "Wrong alignment on Rice_Machine_C_Other_Interaction");
static_assert(sizeof(Rice_Machine_C_Other_Interaction) == 0x000018, "Wrong size on Rice_Machine_C_Other_Interaction");
static_assert(offsetof(Rice_Machine_C_Other_Interaction, Index_0) == 0x000000, "Member 'Rice_Machine_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_Other_Interaction, Source) == 0x000008, "Member 'Rice_Machine_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_Other_Interaction, Item_State) == 0x000010, "Member 'Rice_Machine_C_Other_Interaction::Item_State' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.Set Rice
// 0x0004 (0x0004 - 0x0000)
struct Rice_Machine_C_Set_Rice final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_Set_Rice) == 0x000004, "Wrong alignment on Rice_Machine_C_Set_Rice");
static_assert(sizeof(Rice_Machine_C_Set_Rice) == 0x000004, "Wrong size on Rice_Machine_C_Set_Rice");
static_assert(offsetof(Rice_Machine_C_Set_Rice, Index_0) == 0x000000, "Member 'Rice_Machine_C_Set_Rice::Index_0' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.Set State
// 0x0001 (0x0001 - 0x0000)
struct Rice_Machine_C_Set_State final
{
public:
	E_RiceMachine_State                           State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_Set_State) == 0x000001, "Wrong alignment on Rice_Machine_C_Set_State");
static_assert(sizeof(Rice_Machine_C_Set_State) == 0x000001, "Wrong size on Rice_Machine_C_Set_State");
static_assert(offsetof(Rice_Machine_C_Set_State, State_0) == 0x000000, "Member 'Rice_Machine_C_Set_State::State_0' has a wrong offset!");

// Function Rice_Machine.Rice_Machine_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct Rice_Machine_C_UserConstructionScript final
{
public:
	class AContainerSlot_C*                       K2Node_DynamicCast_AsContainer_Slot;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemSlot_C*                            K2Node_DynamicCast_AsItem_Slot;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rice_Machine_C_UserConstructionScript) == 0x000008, "Wrong alignment on Rice_Machine_C_UserConstructionScript");
static_assert(sizeof(Rice_Machine_C_UserConstructionScript) == 0x000030, "Wrong size on Rice_Machine_C_UserConstructionScript");
static_assert(offsetof(Rice_Machine_C_UserConstructionScript, K2Node_DynamicCast_AsContainer_Slot) == 0x000000, "Member 'Rice_Machine_C_UserConstructionScript::K2Node_DynamicCast_AsContainer_Slot' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Rice_Machine_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Rice_Machine_C_UserConstructionScript, K2Node_DynamicCast_AsItem_Slot) == 0x000010, "Member 'Rice_Machine_C_UserConstructionScript::K2Node_DynamicCast_AsItem_Slot' has a wrong offset!");
