#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Save_Settings

#include "Basic.hpp"

#include "GraphicSettings_structs.hpp"
#include "AudioSettings_structs.hpp"
#include "InputSettings_structs.hpp"
#include "GamepadSettings_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Save_Settings.Save_Settings_C
// 0x00E8 (0x0110 - 0x0028)
class USave_Settings_C final : public USaveGame
{
public:
	struct FGraphicSettings                       GraphicSettings;                                   // 0x0028(0x0028)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputSettings                         InputsSettings;                                    // 0x0050(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FAudioSettings                         AudioSettings;                                     // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGamepadSettings                       GamepadSettings;                                   // 0x00B8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Should_Tutorial;                                   // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Save_Settings_C">();
	}
	static class USave_Settings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USave_Settings_C>();
	}
};
static_assert(alignof(USave_Settings_C) == 0x000008, "Wrong alignment on USave_Settings_C");
static_assert(sizeof(USave_Settings_C) == 0x000110, "Wrong size on USave_Settings_C");
static_assert(offsetof(USave_Settings_C, GraphicSettings) == 0x000028, "Member 'USave_Settings_C::GraphicSettings' has a wrong offset!");
static_assert(offsetof(USave_Settings_C, InputsSettings) == 0x000050, "Member 'USave_Settings_C::InputsSettings' has a wrong offset!");
static_assert(offsetof(USave_Settings_C, AudioSettings) == 0x0000B0, "Member 'USave_Settings_C::AudioSettings' has a wrong offset!");
static_assert(offsetof(USave_Settings_C, GamepadSettings) == 0x0000B8, "Member 'USave_Settings_C::GamepadSettings' has a wrong offset!");
static_assert(offsetof(USave_Settings_C, Should_Tutorial) == 0x000108, "Member 'USave_Settings_C::Should_Tutorial' has a wrong offset!");

}

