#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scanner_Screen

#include "Basic.hpp"

#include "Str_ItemState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Str_ScannerDot_structs.hpp"


namespace SDK::Params
{

// Function Scanner_Screen.Scanner_Screen_C.All Process
// 0x0010 (0x0010 - 0x0000)
struct Scanner_Screen_C_All_Process final
{
public:
	TArray<int32>                                 Targets_Process_0;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Scanner_Screen_C_All_Process) == 0x000008, "Wrong alignment on Scanner_Screen_C_All_Process");
static_assert(sizeof(Scanner_Screen_C_All_Process) == 0x000010, "Wrong size on Scanner_Screen_C_All_Process");
static_assert(offsetof(Scanner_Screen_C_All_Process, Targets_Process_0) == 0x000000, "Member 'Scanner_Screen_C_All_Process::Targets_Process_0' has a wrong offset!");

// Function Scanner_Screen.Scanner_Screen_C.All Set Rotation Target
// 0x0018 (0x0018 - 0x0000)
struct Scanner_Screen_C_All_Set_Rotation_Target final
{
public:
	struct FRotator                               MainRotation_Target_0;                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Scanner_Screen_C_All_Set_Rotation_Target) == 0x000008, "Wrong alignment on Scanner_Screen_C_All_Set_Rotation_Target");
static_assert(sizeof(Scanner_Screen_C_All_Set_Rotation_Target) == 0x000018, "Wrong size on Scanner_Screen_C_All_Set_Rotation_Target");
static_assert(offsetof(Scanner_Screen_C_All_Set_Rotation_Target, MainRotation_Target_0) == 0x000000, "Member 'Scanner_Screen_C_All_Set_Rotation_Target::MainRotation_Target_0' has a wrong offset!");

// Function Scanner_Screen.Scanner_Screen_C.All Set Targets
// 0x0010 (0x0010 - 0x0000)
struct Scanner_Screen_C_All_Set_Targets final
{
public:
	TArray<struct FStr_ScannerDot>                Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Scanner_Screen_C_All_Set_Targets) == 0x000008, "Wrong alignment on Scanner_Screen_C_All_Set_Targets");
static_assert(sizeof(Scanner_Screen_C_All_Set_Targets) == 0x000010, "Wrong size on Scanner_Screen_C_All_Set_Targets");
static_assert(offsetof(Scanner_Screen_C_All_Set_Targets, Array) == 0x000000, "Member 'Scanner_Screen_C_All_Set_Targets::Array' has a wrong offset!");

// Function Scanner_Screen.Scanner_Screen_C.ExecuteUbergraph_Scanner_Screen
// 0x0480 (0x0480 - 0x0000)
struct Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_ScannerUpdate_UI_C*                  K2Node_DynamicCast_AsW_Scanner_Update_UI;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRotator& Rotation)> K2Node_CreateDelegate_OutputDelegate_1;         // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Dots_Count;                     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0130(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ScannerDot                        CallFunc_Array_Get_Item;                           // 0x0138(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x01E8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ScannerDot                        CallFunc_Array_Get_Item_2;                         // 0x01F0(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ScannerDot                        K2Node_MakeStruct_Str_ScannerDot;                  // 0x0240(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_MainRotation_Target;            // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FStr_ScannerDot>                K2Node_CustomEvent_Array;                          // 0x02A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<int32>                                 K2Node_CustomEvent_Targets_Process;                // 0x02B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ScannerDot                        CallFunc_Array_Get_Item_4;                         // 0x02D0(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_5;                         // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0305(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Identical_ReturnValue;              // 0x0306(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307[0x1];                                      // 0x0307(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AverageOfIntArray_AverageValue;           // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UW_Scanner_TargetDot_C*                 CallFunc_Create_ReturnValue;                       // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStr_ScannerDot                        K2Node_MakeStruct_Str_ScannerDot_1;                // 0x0328(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0370(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASoundPath_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Path_Distance;                        // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Path_Location;                        // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Range___;                             // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_435[0x3];                                      // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Opacity_ImplicitCast;           // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen) == 0x000010, "Wrong alignment on Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen");
static_assert(sizeof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen) == 0x000480, "Wrong size on Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, EntryPoint) == 0x000000, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_byte_Variable) == 0x000004, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_real_Variable) == 0x000008, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_real_Variable_1) == 0x000010, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Variable) == 0x000018, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Select_Default) == 0x000030, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Variable_1) == 0x000038, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000040, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MapRangeClamped_ReturnValue) == 0x000048, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Loop_Counter_Variable_2) == 0x000058, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Add_IntInt_ReturnValue_3) == 0x00005C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Array_Index_Variable_2) == 0x000060, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Variable_2) == 0x000064, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Add_IntInt_ReturnValue_4) == 0x00006C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_Index_2) == 0x000070, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_Source_2) == 0x000078, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_Item_State_2) == 0x000080, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_Index_1) == 0x000088, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_Source_1) == 0x000090, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_Item_State_1) == 0x000098, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_Index) == 0x0000A0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_Source) == 0x0000A8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_Item_State) == 0x0000B0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_GetWidget_ReturnValue) == 0x0000B8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_GetGameMode_ReturnValue) == 0x0000C0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_DynamicCast_AsW_Scanner_Update_UI) == 0x0000C8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_DynamicCast_AsW_Scanner_Update_UI' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_DynamicCast_AsGM) == 0x0000D8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_CreateDelegate_OutputDelegate) == 0x0000E4, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F4, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_CustomEvent_Rotation) == 0x000108, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_Event_DeltaSeconds) == 0x000120, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_CustomEvent_Dots_Count) == 0x000124, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_CustomEvent_Dots_Count' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Subtract_IntInt_ReturnValue) == 0x000128, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00012C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Variable_3) == 0x000130, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Get_Item) == 0x000138, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Length_ReturnValue) == 0x000158, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_BreakVector2D_X) == 0x000160, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_BreakVector2D_Y) == 0x000168, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MakeRotator_ReturnValue) == 0x000178, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000190, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_BreakRotator_Roll) == 0x0001A8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_BreakRotator_Pitch) == 0x0001AC, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_BreakRotator_Yaw) == 0x0001B0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MakeVector_ReturnValue) == 0x0001B8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_VSize_ReturnValue) == 0x0001D0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0001D8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Variable_4) == 0x0001E8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Get_Item_1) == 0x0001EC, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Get_Item_2) == 0x0001F0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000210, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000218, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Length_ReturnValue_1) == 0x000220, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MakeVector2D_ReturnValue) == 0x000228, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Less_IntInt_ReturnValue_1) == 0x000238, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_MakeStruct_Str_ScannerDot) == 0x000240, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_MakeStruct_Str_ScannerDot' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Add_ReturnValue) == 0x000260, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000264, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Add_IntInt_ReturnValue_5) == 0x000268, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00026C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_CustomEvent_MainRotation_Target) == 0x000270, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_CustomEvent_MainRotation_Target' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Length_ReturnValue_2) == 0x000288, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Greater_IntInt_ReturnValue) == 0x00028C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_RInterpTo_ReturnValue) == 0x000290, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_CustomEvent_Array) == 0x0002A8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_CustomEvent_Array' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_CustomEvent_Targets_Process) == 0x0002B8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_CustomEvent_Targets_Process' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Get_Item_3) == 0x0002C8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Get_Item_4) == 0x0002D0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Length_ReturnValue_3) == 0x0002F0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002F4, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, Temp_int_Variable_5) == 0x0002F8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Get_Item_5) == 0x0002FC, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Add_IntInt_ReturnValue_6) == 0x000300, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000304, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000305, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Identical_ReturnValue) == 0x000306, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Identical_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_AverageOfIntArray_AverageValue) == 0x000308, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_AverageOfIntArray_AverageValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00030C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000310, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Create_ReturnValue) == 0x000320, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_MakeStruct_Str_ScannerDot_1) == 0x000328, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_MakeStruct_Str_ScannerDot_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_AddChild_ReturnValue) == 0x000348, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000350, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MakeTransform_ReturnValue) == 0x000370, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003D0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_FinishSpawningActor_ReturnValue) == 0x0003D8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Get_Path_Distance) == 0x0003E0, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Get_Path_Distance' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Get_Path_Location) == 0x0003E8, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Get_Path_Location' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000400, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000408, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Map_Range___) == 0x000410, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Map_Range___' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Round_ReturnValue) == 0x000418, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_SelectInt_ReturnValue) == 0x00041C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000420, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Add_ReturnValue_1) == 0x000424, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Length_ReturnValue_4) == 0x000428, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Length_ReturnValue_5) == 0x00042C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_RandomInteger_ReturnValue) == 0x000430, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Greater_IntInt_ReturnValue_4) == 0x000434, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Array_Add_ReturnValue_2) == 0x000438, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, K2Node_VariableSet_Opacity_ImplicitCast) == 0x000440, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::K2Node_VariableSet_Opacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000448, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x00044C, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MakeVector_X_ImplicitCast) == 0x000450, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MakeVector_Y_ImplicitCast) == 0x000458, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_MakeVector_Z_ImplicitCast) == 0x000460, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000468, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000470, "Member 'Scanner_Screen_C_ExecuteUbergraph_Scanner_Screen::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Scanner_Screen.Scanner_Screen_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct Scanner_Screen_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Screen_C_Get_Key) == 0x000008, "Wrong alignment on Scanner_Screen_C_Get_Key");
static_assert(sizeof(Scanner_Screen_C_Get_Key) == 0x000008, "Wrong size on Scanner_Screen_C_Get_Key");
static_assert(offsetof(Scanner_Screen_C_Get_Key, Key) == 0x000000, "Member 'Scanner_Screen_C_Get_Key::Key' has a wrong offset!");

// Function Scanner_Screen.Scanner_Screen_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct Scanner_Screen_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Screen_C_Get_Name) == 0x000008, "Wrong alignment on Scanner_Screen_C_Get_Name");
static_assert(sizeof(Scanner_Screen_C_Get_Name) == 0x000018, "Wrong size on Scanner_Screen_C_Get_Name");
static_assert(offsetof(Scanner_Screen_C_Get_Name, Mec) == 0x000000, "Member 'Scanner_Screen_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(Scanner_Screen_C_Get_Name, Name_0) == 0x000008, "Member 'Scanner_Screen_C_Get_Name::Name_0' has a wrong offset!");

// Function Scanner_Screen.Scanner_Screen_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct Scanner_Screen_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Screen_C_Local_Interaction) == 0x000008, "Wrong alignment on Scanner_Screen_C_Local_Interaction");
