#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scanner_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_DataPC_State_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Scanner_PC.Scanner_PC_C
// 0x00C8 (0x0370 - 0x02A8)
class AScanner_PC_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Collisions1;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Collisions;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Collisions2;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MapMesh_TaskMachine_Computer_Button2;              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MapMesh_TaskMachine_Computer_Button1;              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_Button_L;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_Button_R;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MapMesh_TaskMachine_Computer_Button;               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MapMesh_TaskMachine_Computer_Keyboard;             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MapMesh_TaskMachine_Computer;                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_HDD;                                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ScreenRoot;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UW_DataPC_UI_C*                         W_Screen;                                          // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_DataPC_State                                State;                                             // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Process;                                           // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x0330(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AItemSlot_C*                            HDD;                                               // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AButton_C*                              Button_R;                                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Room;                                              // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_Message;                                     // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Check_PC;                                          // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AData_PC_C*                             Other_PC;                                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AButton_C*                              Button_L;                                          // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Clear();
	void ExecuteUbergraph_Scanner_PC(int32 EntryPoint);
	void Get_Key(class AActor** Key);
	void Get_Name(class AMec_C* Mec, class FString* Name_0);
	void Local_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Net_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Other_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Scanner_PC_C">();
	}
	static class AScanner_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AScanner_PC_C>();
	}
};
static_assert(alignof(AScanner_PC_C) == 0x000008, "Wrong alignment on AScanner_PC_C");
static_assert(sizeof(AScanner_PC_C) == 0x000370, "Wrong size on AScanner_PC_C");
static_assert(offsetof(AScanner_PC_C, UberGraphFrame) == 0x0002A8, "Member 'AScanner_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Collisions1) == 0x0002B0, "Member 'AScanner_PC_C::Collisions1' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Collisions) == 0x0002B8, "Member 'AScanner_PC_C::Collisions' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Collisions2) == 0x0002C0, "Member 'AScanner_PC_C::Collisions2' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, MapMesh_TaskMachine_Computer_Button2) == 0x0002C8, "Member 'AScanner_PC_C::MapMesh_TaskMachine_Computer_Button2' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, MapMesh_TaskMachine_Computer_Button1) == 0x0002D0, "Member 'AScanner_PC_C::MapMesh_TaskMachine_Computer_Button1' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, C_Button_L) == 0x0002D8, "Member 'AScanner_PC_C::C_Button_L' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, C_Button_R) == 0x0002E0, "Member 'AScanner_PC_C::C_Button_R' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, MapMesh_TaskMachine_Computer_Button) == 0x0002E8, "Member 'AScanner_PC_C::MapMesh_TaskMachine_Computer_Button' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, MapMesh_TaskMachine_Computer_Keyboard) == 0x0002F0, "Member 'AScanner_PC_C::MapMesh_TaskMachine_Computer_Keyboard' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, MapMesh_TaskMachine_Computer) == 0x0002F8, "Member 'AScanner_PC_C::MapMesh_TaskMachine_Computer' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, C_HDD) == 0x000300, "Member 'AScanner_PC_C::C_HDD' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Widget) == 0x000308, "Member 'AScanner_PC_C::Widget' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, ScreenRoot) == 0x000310, "Member 'AScanner_PC_C::ScreenRoot' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Root) == 0x000318, "Member 'AScanner_PC_C::Root' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, W_Screen) == 0x000320, "Member 'AScanner_PC_C::W_Screen' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, State) == 0x000328, "Member 'AScanner_PC_C::State' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Process) == 0x00032C, "Member 'AScanner_PC_C::Process' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Timer) == 0x000330, "Member 'AScanner_PC_C::Timer' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, HDD) == 0x000338, "Member 'AScanner_PC_C::HDD' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Button_R) == 0x000340, "Member 'AScanner_PC_C::Button_R' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Room) == 0x000348, "Member 'AScanner_PC_C::Room' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Index_Message) == 0x00034C, "Member 'AScanner_PC_C::Index_Message' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Check_PC) == 0x000350, "Member 'AScanner_PC_C::Check_PC' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Other_PC) == 0x000360, "Member 'AScanner_PC_C::Other_PC' has a wrong offset!");
static_assert(offsetof(AScanner_PC_C, Button_L) == 0x000368, "Member 'AScanner_PC_C::Button_L' has a wrong offset!");

}

