#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundSource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_PathLevel_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SoundSource.SoundSource_C.Set Effect
// 0x0008 (0x0008 - 0x0000)
struct SoundSource_C_Set_Effect final
{
public:
	class USoundEffectSourcePresetChain*          Effect_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Set_Effect) == 0x000008, "Wrong alignment on SoundSource_C_Set_Effect");
static_assert(sizeof(SoundSource_C_Set_Effect) == 0x000008, "Wrong size on SoundSource_C_Set_Effect");
static_assert(offsetof(SoundSource_C_Set_Effect, Effect_0) == 0x000000, "Member 'SoundSource_C_Set_Effect::Effect_0' has a wrong offset!");

// Function SoundSource.SoundSource_C.Set Path Level
// 0x0030 (0x0030 - 0x0000)
struct SoundSource_C_Set_Path_Level final
{
public:
	Enum_PathLevel                                Path_Level_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActorTickInterval_TickInterval_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_2; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Set_Path_Level) == 0x000008, "Wrong alignment on SoundSource_C_Set_Path_Level");
static_assert(sizeof(SoundSource_C_Set_Path_Level) == 0x000030, "Wrong size on SoundSource_C_Set_Path_Level");
static_assert(offsetof(SoundSource_C_Set_Path_Level, Path_Level_0) == 0x000000, "Member 'SoundSource_C_Set_Path_Level::Path_Level_0' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Path_Level, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'SoundSource_C_Set_Path_Level::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Path_Level, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'SoundSource_C_Set_Path_Level::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Path_Level, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'SoundSource_C_Set_Path_Level::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Path_Level, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000010, "Member 'SoundSource_C_Set_Path_Level::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Path_Level, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000018, "Member 'SoundSource_C_Set_Path_Level::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Path_Level, CallFunc_SetActorTickInterval_TickInterval_ImplicitCast) == 0x000020, "Member 'SoundSource_C_Set_Path_Level::CallFunc_SetActorTickInterval_TickInterval_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Path_Level, CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_1) == 0x000024, "Member 'SoundSource_C_Set_Path_Level::CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Path_Level, CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_2) == 0x000028, "Member 'SoundSource_C_Set_Path_Level::CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_2' has a wrong offset!");

// Function SoundSource.SoundSource_C.Trigger2
// 0x0020 (0x0020 - 0x0000)
struct SoundSource_C_Trigger2 final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TRUE_0;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetBoolParameter_self_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Trigger2) == 0x000008, "Wrong alignment on SoundSource_C_Trigger2");
static_assert(sizeof(SoundSource_C_Trigger2) == 0x000020, "Wrong size on SoundSource_C_Trigger2");
static_assert(offsetof(SoundSource_C_Trigger2, Name_0) == 0x000000, "Member 'SoundSource_C_Trigger2::Name_0' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Trigger2, TRUE_0) == 0x000008, "Member 'SoundSource_C_Trigger2::TRUE_0' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Trigger2, CallFunc_SetBoolParameter_self_CastInput) == 0x000010, "Member 'SoundSource_C_Trigger2::CallFunc_SetBoolParameter_self_CastInput' has a wrong offset!");

// Function SoundSource.SoundSource_C.Play Impact
// 0x0030 (0x0030 - 0x0000)
struct SoundSource_C_Play_Impact final
{
public:
	float                                         Volume_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch_0;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             Wave;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Play_Impact) == 0x000008, "Wrong alignment on SoundSource_C_Play_Impact");
static_assert(sizeof(SoundSource_C_Play_Impact) == 0x000030, "Wrong size on SoundSource_C_Play_Impact");
static_assert(offsetof(SoundSource_C_Play_Impact, Volume_0) == 0x000000, "Member 'SoundSource_C_Play_Impact::Volume_0' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Play_Impact, Pitch_0) == 0x000004, "Member 'SoundSource_C_Play_Impact::Pitch_0' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Play_Impact, Wave) == 0x000008, "Member 'SoundSource_C_Play_Impact::Wave' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Play_Impact, CallFunc_SetFloatParameter_self_CastInput) == 0x000010, "Member 'SoundSource_C_Play_Impact::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Play_Impact, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000020, "Member 'SoundSource_C_Play_Impact::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");

// Function SoundSource.SoundSource_C.Play
// 0x0004 (0x0004 - 0x0000)
struct SoundSource_C_Play final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Play) == 0x000004, "Wrong alignment on SoundSource_C_Play");
static_assert(sizeof(SoundSource_C_Play) == 0x000004, "Wrong size on SoundSource_C_Play");
static_assert(offsetof(SoundSource_C_Play, StartTime) == 0x000000, "Member 'SoundSource_C_Play::StartTime' has a wrong offset!");

// Function SoundSource.SoundSource_C.Set Sound
// 0x0008 (0x0008 - 0x0000)
struct SoundSource_C_Set_Sound final
{
public:
	class USoundBase*                             Sound_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Set_Sound) == 0x000008, "Wrong alignment on SoundSource_C_Set_Sound");
static_assert(sizeof(SoundSource_C_Set_Sound) == 0x000008, "Wrong size on SoundSource_C_Set_Sound");
static_assert(offsetof(SoundSource_C_Set_Sound, Sound_0) == 0x000000, "Member 'SoundSource_C_Set_Sound::Sound_0' has a wrong offset!");

// Function SoundSource.SoundSource_C.Set Attenuation
// 0x0010 (0x0010 - 0x0000)
struct SoundSource_C_Set_Attenuation final
{
public:
	class USoundAttenuation*                      Attenuation_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Set_Attenuation) == 0x000008, "Wrong alignment on SoundSource_C_Set_Attenuation");
static_assert(sizeof(SoundSource_C_Set_Attenuation) == 0x000010, "Wrong size on SoundSource_C_Set_Attenuation");
static_assert(offsetof(SoundSource_C_Set_Attenuation, Attenuation_0) == 0x000000, "Member 'SoundSource_C_Set_Attenuation::Attenuation_0' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Attenuation, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'SoundSource_C_Set_Attenuation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SoundSource.SoundSource_C.Trigger
// 0x0018 (0x0018 - 0x0000)
struct SoundSource_C_Trigger final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Trigger) == 0x000008, "Wrong alignment on SoundSource_C_Trigger");
static_assert(sizeof(SoundSource_C_Trigger) == 0x000018, "Wrong size on SoundSource_C_Trigger");
static_assert(offsetof(SoundSource_C_Trigger, Name_0) == 0x000000, "Member 'SoundSource_C_Trigger::Name_0' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Trigger, CallFunc_SetTriggerParameter_self_CastInput) == 0x000008, "Member 'SoundSource_C_Trigger::CallFunc_SetTriggerParameter_self_CastInput' has a wrong offset!");

// Function SoundSource.SoundSource_C.Set Volume
// 0x0004 (0x0004 - 0x0000)
struct SoundSource_C_Set_Volume final
{
public:
	float                                         Volume_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Set_Volume) == 0x000004, "Wrong alignment on SoundSource_C_Set_Volume");
static_assert(sizeof(SoundSource_C_Set_Volume) == 0x000004, "Wrong size on SoundSource_C_Set_Volume");
static_assert(offsetof(SoundSource_C_Set_Volume, Volume_0) == 0x000000, "Member 'SoundSource_C_Set_Volume::Volume_0' has a wrong offset!");

// Function SoundSource.SoundSource_C.Set Pitch
// 0x0004 (0x0004 - 0x0000)
struct SoundSource_C_Set_Pitch final
{
public:
	float                                         Pitch_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Set_Pitch) == 0x000004, "Wrong alignment on SoundSource_C_Set_Pitch");
static_assert(sizeof(SoundSource_C_Set_Pitch) == 0x000004, "Wrong size on SoundSource_C_Set_Pitch");
static_assert(offsetof(SoundSource_C_Set_Pitch, Pitch_0) == 0x000000, "Member 'SoundSource_C_Set_Pitch::Pitch_0' has a wrong offset!");

// Function SoundSource.SoundSource_C.Set Float
// 0x0020 (0x0020 - 0x0000)
struct SoundSource_C_Set_Float final
{
public:
	class FName                                   Input;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Set_Float) == 0x000008, "Wrong alignment on SoundSource_C_Set_Float");
static_assert(sizeof(SoundSource_C_Set_Float) == 0x000020, "Wrong size on SoundSource_C_Set_Float");
static_assert(offsetof(SoundSource_C_Set_Float, Input) == 0x000000, "Member 'SoundSource_C_Set_Float::Input' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Float, Value) == 0x000008, "Member 'SoundSource_C_Set_Float::Value' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Set_Float, CallFunc_SetFloatParameter_self_CastInput) == 0x000010, "Member 'SoundSource_C_Set_Float::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");

// Function SoundSource.SoundSource_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct SoundSource_C_UserConstructionScript final
{
public:
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue;                     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_HSVToRGB_H_ImplicitCast;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_UserConstructionScript) == 0x000008, "Wrong alignment on SoundSource_C_UserConstructionScript");
static_assert(sizeof(SoundSource_C_UserConstructionScript) == 0x000020, "Wrong size on SoundSource_C_UserConstructionScript");
static_assert(offsetof(SoundSource_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'SoundSource_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundSource_C_UserConstructionScript, CallFunc_HSVToRGB_ReturnValue) == 0x000008, "Member 'SoundSource_C_UserConstructionScript::CallFunc_HSVToRGB_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundSource_C_UserConstructionScript, CallFunc_HSVToRGB_H_ImplicitCast) == 0x000018, "Member 'SoundSource_C_UserConstructionScript::CallFunc_HSVToRGB_H_ImplicitCast' has a wrong offset!");

// Function SoundSource.SoundSource_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SoundSource_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_ReceiveTick) == 0x000004, "Wrong alignment on SoundSource_C_ReceiveTick");
static_assert(sizeof(SoundSource_C_ReceiveTick) == 0x000004, "Wrong size on SoundSource_C_ReceiveTick");
static_assert(offsetof(SoundSource_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SoundSource_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function SoundSource.SoundSource_C.Activate
// 0x0008 (0x0008 - 0x0000)
struct SoundSource_C_Activate final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Activate) == 0x000004, "Wrong alignment on SoundSource_C_Activate");
static_assert(sizeof(SoundSource_C_Activate) == 0x000008, "Wrong size on SoundSource_C_Activate");
static_assert(offsetof(SoundSource_C_Activate, TRUE_0) == 0x000000, "Member 'SoundSource_C_Activate::TRUE_0' has a wrong offset!");
static_assert(offsetof(SoundSource_C_Activate, StartTime) == 0x000004, "Member 'SoundSource_C_Activate::StartTime' has a wrong offset!");

// Function SoundSource.SoundSource_C.Force Active
// 0x0001 (0x0001 - 0x0000)
struct SoundSource_C_Force_Active final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_Force_Active) == 0x000001, "Wrong alignment on SoundSource_C_Force_Active");
static_assert(sizeof(SoundSource_C_Force_Active) == 0x000001, "Wrong size on SoundSource_C_Force_Active");
static_assert(offsetof(SoundSource_C_Force_Active, TRUE_0) == 0x000000, "Member 'SoundSource_C_Force_Active::TRUE_0' has a wrong offset!");

// Function SoundSource.SoundSource_C.BndEvt__SoundSource_MetaSound_K2Node_ComponentBoundEvent_0_OnAudioVirtualizationChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SoundSource_C_BndEvt__SoundSource_MetaSound_K2Node_ComponentBoundEvent_0_OnAudioVirtualizationChanged__DelegateSignature final
{
public:
	bool                                          bIsVirtualized;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_BndEvt__SoundSource_MetaSound_K2Node_ComponentBoundEvent_0_OnAudioVirtualizationChanged__DelegateSignature) == 0x000001, "Wrong alignment on SoundSource_C_BndEvt__SoundSource_MetaSound_K2Node_ComponentBoundEvent_0_OnAudioVirtualizationChanged__DelegateSignature");
static_assert(sizeof(SoundSource_C_BndEvt__SoundSource_MetaSound_K2Node_ComponentBoundEvent_0_OnAudioVirtualizationChanged__DelegateSignature) == 0x000001, "Wrong size on SoundSource_C_BndEvt__SoundSource_MetaSound_K2Node_ComponentBoundEvent_0_OnAudioVirtualizationChanged__DelegateSignature");
static_assert(offsetof(SoundSource_C_BndEvt__SoundSource_MetaSound_K2Node_ComponentBoundEvent_0_OnAudioVirtualizationChanged__DelegateSignature, bIsVirtualized) == 0x000000, "Member 'SoundSource_C_BndEvt__SoundSource_MetaSound_K2Node_ComponentBoundEvent_0_OnAudioVirtualizationChanged__DelegateSignature::bIsVirtualized' has a wrong offset!");

// Function SoundSource.SoundSource_C.ExecuteUbergraph_SoundSource
// 0x0920 (0x0920 - 0x0000)
struct SoundSource_C_ExecuteUbergraph_SoundSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorTickInterval_ReturnValue;         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0228(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True_1;                         // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_StartTime;                      // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True;                           // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0360(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0460(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0568(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x05B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x05C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x05F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0614(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_615[0x3];                                      // 0x0615(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0618(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0650(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0680(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue; // 0x06C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPathLength_ReturnValue;                // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0708(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0730(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_748[0x8];                                      // 0x0748(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0750(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue;     // 0x07B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x07E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_5;           // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0808(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_2;            // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsVirtualized;         // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_6;           // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x0839(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83A[0x2];                                      // 0x083A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetActorTickInterval_ReturnValue_1;       // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_9;        // 0x0858(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Target_Deviation_ImplicitCast;  // 0x0884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x0888(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88C[0x4];                                      // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast; // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AC[0x4];                                      // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast_1; // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BC[0x4];                                      // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3;   // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_2;        // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Target_Distance_ImplicitCast;   // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8EC[0x4];                                      // 0x08EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Last_Direction_ImplicitCast;    // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Last_Direction_ImplicitCast_1;  // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Target_Direction_ImplicitCast;  // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_3;        // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundSource_C_ExecuteUbergraph_SoundSource) == 0x000010, "Wrong alignment on SoundSource_C_ExecuteUbergraph_SoundSource");
static_assert(sizeof(SoundSource_C_ExecuteUbergraph_SoundSource) == 0x000920, "Wrong size on SoundSource_C_ExecuteUbergraph_SoundSource");
static_assert(offsetof(SoundSource_C_ExecuteUbergraph_SoundSource, EntryPoint) == 0x000000, "Member 'SoundSource_C_ExecuteUbergraph_SoundSource::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoundSource_C_ExecuteUbergraph_SoundSource, Temp_struct_Variable) == 0x000004, "Member 'SoundSource_C_ExecuteUbergraph_SoundSource::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SoundSource_C_ExecuteUbergraph_SoundSource, Temp_struct_Variable_1) == 0x000014, "Member 'SoundSource_C_ExecuteUbergraph_SoundSource::Temp_struct_Variable_1' has a wrong offset!");
