#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_ItemPlacerRef

#include "Basic.hpp"

#include "Enum_Sectors_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_ItemPlacerRef.Str_ItemPlacerRef
// 0x0018 (0x0018 - 0x0000)
struct FStr_ItemPlacerRef final
{
public:
	Enum_Sectors                                  Sector_2_8B5600644E18D428EE5FC28B79A33CE2;         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Room_6_D4EE65BF49C6C2FFEF9852A991E2E55B;           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AItem_Placer_C*>                 Placers_12_0871F0B34D50A7BBF69F5AAFF3C0EA13;       // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
};
static_assert(alignof(FStr_ItemPlacerRef) == 0x000008, "Wrong alignment on FStr_ItemPlacerRef");
static_assert(sizeof(FStr_ItemPlacerRef) == 0x000018, "Wrong size on FStr_ItemPlacerRef");
static_assert(offsetof(FStr_ItemPlacerRef, Sector_2_8B5600644E18D428EE5FC28B79A33CE2) == 0x000000, "Member 'FStr_ItemPlacerRef::Sector_2_8B5600644E18D428EE5FC28B79A33CE2' has a wrong offset!");
static_assert(offsetof(FStr_ItemPlacerRef, Room_6_D4EE65BF49C6C2FFEF9852A991E2E55B) == 0x000001, "Member 'FStr_ItemPlacerRef::Room_6_D4EE65BF49C6C2FFEF9852A991E2E55B' has a wrong offset!");
static_assert(offsetof(FStr_ItemPlacerRef, Placers_12_0871F0B34D50A7BBF69F5AAFF3C0EA13) == 0x000008, "Member 'FStr_ItemPlacerRef::Placers_12_0871F0B34D50A7BBF69F5AAFF3C0EA13' has a wrong offset!");

}

