#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_GunSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Str_GunSettings.Str_GunSettings
// 0x00D8 (0x00D8 - 0x0000)
struct FStr_GunSettings final
{
public:
	int32                                         Damage_2_9490C308477AB0E13B96DE884B343BFB;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CritcalDamage_13_AA9B23BB4F67AC55813502A75B2025F3; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stamina_62_040F02254B7547FB9F5E6CBD4F5CAC8A;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CritStamina_64_393FEB5E44637096E2C966B49A6DCD6E;   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stun_69_E1DE4FD0421BC82FA96D51A622E4126A;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StaminaCost_68_FC04B40A4592CD5EB69B83860B6B3B9C;   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FireRate_12_7E6B69BB47AECF4B0525769A77B08068;      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Capacity_11_EEAC27A94B40064CF259E28241D5B7FA;      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RecoilSpread_16_CCB05A7C43D09E4B4B5133A9AE7220A5;  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RecoilInterp_22_8C41FA7F4F1C029D30395EBBD1DF6CC7;  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RecoilRecover_23_2471D7164DFA264B11FE339172E82533; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OffsetVertical_24_EDA328714D2E733309187ABB5E257120; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OffsetHorizontal_25_9EACE2E241C29E93C0AD30A41F5A99C2; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RecoilElevation_33_0E775AE649928ACA3CE912B0120B3071; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SprintRecover_59_4A001A844D95F81FBAB37BB3685A6624; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RecoilReactivity_35_7976651840544A35791F4BA519A34C4F; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShakeIntensity_36_599057CA4189C87F807AD9A92E348C64; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StandPrecision_37_7AADF0F54F6D65B02FDED8AB273B3444; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WalkPrecision_39_1D1FC90F4C7DB4AE9FF70DB6916C444E; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RunPrecision_45_9CA4315646461F6A47F3E8B2D4946362;  // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AirPrecision_46_20A410F54D89DB17A1B4BF9BC0C82B8C;  // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PrecisionRecover_47_DACBAFF74485E91B5579B89DC132A852; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PrecisionReactivity_48_A8DE4C2A44A7E5078BB256B2C6B651B8; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShotOscillation_49_738EDC8B4C8A97C77CB9DDAC81F1F8A2; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StandOscillation_55_AECB908C4C6B42C7A8BF58812F46B5A1; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WalkOscillation_56_8510D85A4B7F33BAFC54189B51EC003E; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RunOscillation_57_980FE4E4486181A571F52F9ED53156CB; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OscillationReactivity_58_E618657047A4A45FE2EFA0A70C7C01BB; // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Handling_73_7BC581164C7A9F365F0ABFB5C0A761CA;      // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStr_GunSettings) == 0x000008, "Wrong alignment on FStr_GunSettings");
static_assert(sizeof(FStr_GunSettings) == 0x0000D8, "Wrong size on FStr_GunSettings");
static_assert(offsetof(FStr_GunSettings, Damage_2_9490C308477AB0E13B96DE884B343BFB) == 0x000000, "Member 'FStr_GunSettings::Damage_2_9490C308477AB0E13B96DE884B343BFB' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, CritcalDamage_13_AA9B23BB4F67AC55813502A75B2025F3) == 0x000004, "Member 'FStr_GunSettings::CritcalDamage_13_AA9B23BB4F67AC55813502A75B2025F3' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, Stamina_62_040F02254B7547FB9F5E6CBD4F5CAC8A) == 0x000008, "Member 'FStr_GunSettings::Stamina_62_040F02254B7547FB9F5E6CBD4F5CAC8A' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, CritStamina_64_393FEB5E44637096E2C966B49A6DCD6E) == 0x00000C, "Member 'FStr_GunSettings::CritStamina_64_393FEB5E44637096E2C966B49A6DCD6E' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, Stun_69_E1DE4FD0421BC82FA96D51A622E4126A) == 0x000010, "Member 'FStr_GunSettings::Stun_69_E1DE4FD0421BC82FA96D51A622E4126A' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, StaminaCost_68_FC04B40A4592CD5EB69B83860B6B3B9C) == 0x000018, "Member 'FStr_GunSettings::StaminaCost_68_FC04B40A4592CD5EB69B83860B6B3B9C' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, FireRate_12_7E6B69BB47AECF4B0525769A77B08068) == 0x000020, "Member 'FStr_GunSettings::FireRate_12_7E6B69BB47AECF4B0525769A77B08068' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, Capacity_11_EEAC27A94B40064CF259E28241D5B7FA) == 0x000028, "Member 'FStr_GunSettings::Capacity_11_EEAC27A94B40064CF259E28241D5B7FA' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, RecoilSpread_16_CCB05A7C43D09E4B4B5133A9AE7220A5) == 0x000030, "Member 'FStr_GunSettings::RecoilSpread_16_CCB05A7C43D09E4B4B5133A9AE7220A5' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, RecoilInterp_22_8C41FA7F4F1C029D30395EBBD1DF6CC7) == 0x000038, "Member 'FStr_GunSettings::RecoilInterp_22_8C41FA7F4F1C029D30395EBBD1DF6CC7' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, RecoilRecover_23_2471D7164DFA264B11FE339172E82533) == 0x000040, "Member 'FStr_GunSettings::RecoilRecover_23_2471D7164DFA264B11FE339172E82533' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, OffsetVertical_24_EDA328714D2E733309187ABB5E257120) == 0x000048, "Member 'FStr_GunSettings::OffsetVertical_24_EDA328714D2E733309187ABB5E257120' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, OffsetHorizontal_25_9EACE2E241C29E93C0AD30A41F5A99C2) == 0x000050, "Member 'FStr_GunSettings::OffsetHorizontal_25_9EACE2E241C29E93C0AD30A41F5A99C2' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, RecoilElevation_33_0E775AE649928ACA3CE912B0120B3071) == 0x000058, "Member 'FStr_GunSettings::RecoilElevation_33_0E775AE649928ACA3CE912B0120B3071' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, SprintRecover_59_4A001A844D95F81FBAB37BB3685A6624) == 0x000060, "Member 'FStr_GunSettings::SprintRecover_59_4A001A844D95F81FBAB37BB3685A6624' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, RecoilReactivity_35_7976651840544A35791F4BA519A34C4F) == 0x000068, "Member 'FStr_GunSettings::RecoilReactivity_35_7976651840544A35791F4BA519A34C4F' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, ShakeIntensity_36_599057CA4189C87F807AD9A92E348C64) == 0x000070, "Member 'FStr_GunSettings::ShakeIntensity_36_599057CA4189C87F807AD9A92E348C64' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, StandPrecision_37_7AADF0F54F6D65B02FDED8AB273B3444) == 0x000078, "Member 'FStr_GunSettings::StandPrecision_37_7AADF0F54F6D65B02FDED8AB273B3444' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, WalkPrecision_39_1D1FC90F4C7DB4AE9FF70DB6916C444E) == 0x000080, "Member 'FStr_GunSettings::WalkPrecision_39_1D1FC90F4C7DB4AE9FF70DB6916C444E' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, RunPrecision_45_9CA4315646461F6A47F3E8B2D4946362) == 0x000088, "Member 'FStr_GunSettings::RunPrecision_45_9CA4315646461F6A47F3E8B2D4946362' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, AirPrecision_46_20A410F54D89DB17A1B4BF9BC0C82B8C) == 0x000090, "Member 'FStr_GunSettings::AirPrecision_46_20A410F54D89DB17A1B4BF9BC0C82B8C' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, PrecisionRecover_47_DACBAFF74485E91B5579B89DC132A852) == 0x000098, "Member 'FStr_GunSettings::PrecisionRecover_47_DACBAFF74485E91B5579B89DC132A852' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, PrecisionReactivity_48_A8DE4C2A44A7E5078BB256B2C6B651B8) == 0x0000A0, "Member 'FStr_GunSettings::PrecisionReactivity_48_A8DE4C2A44A7E5078BB256B2C6B651B8' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, ShotOscillation_49_738EDC8B4C8A97C77CB9DDAC81F1F8A2) == 0x0000A8, "Member 'FStr_GunSettings::ShotOscillation_49_738EDC8B4C8A97C77CB9DDAC81F1F8A2' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, StandOscillation_55_AECB908C4C6B42C7A8BF58812F46B5A1) == 0x0000B0, "Member 'FStr_GunSettings::StandOscillation_55_AECB908C4C6B42C7A8BF58812F46B5A1' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, WalkOscillation_56_8510D85A4B7F33BAFC54189B51EC003E) == 0x0000B8, "Member 'FStr_GunSettings::WalkOscillation_56_8510D85A4B7F33BAFC54189B51EC003E' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, RunOscillation_57_980FE4E4486181A571F52F9ED53156CB) == 0x0000C0, "Member 'FStr_GunSettings::RunOscillation_57_980FE4E4486181A571F52F9ED53156CB' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, OscillationReactivity_58_E618657047A4A45FE2EFA0A70C7C01BB) == 0x0000C8, "Member 'FStr_GunSettings::OscillationReactivity_58_E618657047A4A45FE2EFA0A70C7C01BB' has a wrong offset!");
static_assert(offsetof(FStr_GunSettings, Handling_73_7BC581164C7A9F365F0ABFB5C0A761CA) == 0x0000D0, "Member 'FStr_GunSettings::Handling_73_7BC581164C7A9F365F0ABFB5C0A761CA' has a wrong offset!");

}

