#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_ItemSpawnRequest

#include "Basic.hpp"

#include "Enum_Sectors_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_ItemSpawnRequest.Str_ItemSpawnRequest
// 0x0008 (0x0008 - 0x0000)
struct FStr_ItemSpawnRequest final
{
public:
	Enum_Sectors                                  Sector_2_8B5600644E18D428EE5FC28B79A33CE2;         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Room_6_D4EE65BF49C6C2FFEF9852A991E2E55B;           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Weight_9_9386E5094D72E414842801A13CAA8F77;         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStr_ItemSpawnRequest) == 0x000004, "Wrong alignment on FStr_ItemSpawnRequest");
static_assert(sizeof(FStr_ItemSpawnRequest) == 0x000008, "Wrong size on FStr_ItemSpawnRequest");
static_assert(offsetof(FStr_ItemSpawnRequest, Sector_2_8B5600644E18D428EE5FC28B79A33CE2) == 0x000000, "Member 'FStr_ItemSpawnRequest::Sector_2_8B5600644E18D428EE5FC28B79A33CE2' has a wrong offset!");
static_assert(offsetof(FStr_ItemSpawnRequest, Room_6_D4EE65BF49C6C2FFEF9852A991E2E55B) == 0x000001, "Member 'FStr_ItemSpawnRequest::Room_6_D4EE65BF49C6C2FFEF9852A991E2E55B' has a wrong offset!");
static_assert(offsetof(FStr_ItemSpawnRequest, Weight_9_9386E5094D72E414842801A13CAA8F77) == 0x000004, "Member 'FStr_ItemSpawnRequest::Weight_9_9386E5094D72E414842801A13CAA8F77' has a wrong offset!");

}

