#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskKeyboard

#include "Basic.hpp"


namespace SDK::Params
{

// Function TaskKeyboard.TaskKeyboard_C.BndEvt__TaskKeyboard_Down_K2Node_ComponentBoundEvent_1_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TaskKeyboard_C_BndEvt__TaskKeyboard_Down_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskKeyboard_C_BndEvt__TaskKeyboard_Down_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on TaskKeyboard_C_BndEvt__TaskKeyboard_Down_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature");
static_assert(sizeof(TaskKeyboard_C_BndEvt__TaskKeyboard_Down_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature) == 0x000008, "Wrong size on TaskKeyboard_C_BndEvt__TaskKeyboard_Down_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature");
static_assert(offsetof(TaskKeyboard_C_BndEvt__TaskKeyboard_Down_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'TaskKeyboard_C_BndEvt__TaskKeyboard_Down_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function TaskKeyboard.TaskKeyboard_C.BndEvt__TaskKeyboard_Up_K2Node_ComponentBoundEvent_0_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TaskKeyboard_C_BndEvt__TaskKeyboard_Up_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskKeyboard_C_BndEvt__TaskKeyboard_Up_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on TaskKeyboard_C_BndEvt__TaskKeyboard_Up_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(sizeof(TaskKeyboard_C_BndEvt__TaskKeyboard_Up_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong size on TaskKeyboard_C_BndEvt__TaskKeyboard_Up_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(offsetof(TaskKeyboard_C_BndEvt__TaskKeyboard_Up_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'TaskKeyboard_C_BndEvt__TaskKeyboard_Up_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function TaskKeyboard.TaskKeyboard_C.ExecuteUbergraph_TaskKeyboard
// 0x0018 (0x0018 - 0x0000)
struct TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source_1;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard) == 0x000008, "Wrong alignment on TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard");
static_assert(sizeof(TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard) == 0x000018, "Wrong size on TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard");
static_assert(offsetof(TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard, EntryPoint) == 0x000000, "Member 'TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard, K2Node_ComponentBoundEvent_Source_1) == 0x000008, "Member 'TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard::K2Node_ComponentBoundEvent_Source_1' has a wrong offset!");
static_assert(offsetof(TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard, K2Node_ComponentBoundEvent_Source) == 0x000010, "Member 'TaskKeyboard_C_ExecuteUbergraph_TaskKeyboard::K2Node_ComponentBoundEvent_Source' has a wrong offset!");

// Function TaskKeyboard.TaskKeyboard_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct TaskKeyboard_C_UserConstructionScript final
{
public:
	class AButton_C*                              K2Node_DynamicCast_AsButton;                       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AButton_C*                              K2Node_DynamicCast_AsButton_1;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskKeyboard_C_UserConstructionScript) == 0x000008, "Wrong alignment on TaskKeyboard_C_UserConstructionScript");
static_assert(sizeof(TaskKeyboard_C_UserConstructionScript) == 0x000020, "Wrong size on TaskKeyboard_C_UserConstructionScript");
static_assert(offsetof(TaskKeyboard_C_UserConstructionScript, K2Node_DynamicCast_AsButton) == 0x000000, "Member 'TaskKeyboard_C_UserConstructionScript::K2Node_DynamicCast_AsButton' has a wrong offset!");
static_assert(offsetof(TaskKeyboard_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'TaskKeyboard_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TaskKeyboard_C_UserConstructionScript, K2Node_DynamicCast_AsButton_1) == 0x000010, "Member 'TaskKeyboard_C_UserConstructionScript::K2Node_DynamicCast_AsButton_1' has a wrong offset!");
static_assert(offsetof(TaskKeyboard_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'TaskKeyboard_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

