#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_DelivryIn

#include "Basic.hpp"

#include "Enum_Sectors_structs.hpp"
#include "E_Difficulty_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Task_DelivryIn.Task_DelivryIn_C.Check Cases
// 0x0048 (0x0048 - 0x0000)
struct Task_DelivryIn_C_Check_Cases final
{
public:
	bool                                          Finished;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Count;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _Check;                                            // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Difficulty                                  Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADeliveryCase_C*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DelivryIn_C_Check_Cases) == 0x000008, "Wrong alignment on Task_DelivryIn_C_Check_Cases");
static_assert(sizeof(Task_DelivryIn_C_Check_Cases) == 0x000048, "Wrong size on Task_DelivryIn_C_Check_Cases");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, Finished) == 0x000000, "Member 'Task_DelivryIn_C_Check_Cases::Finished' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, Count) == 0x000004, "Member 'Task_DelivryIn_C_Check_Cases::Count' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, _Count) == 0x000008, "Member 'Task_DelivryIn_C_Check_Cases::_Count' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, _Check) == 0x00000C, "Member 'Task_DelivryIn_C_Check_Cases::_Check' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, Temp_byte_Variable) == 0x00000D, "Member 'Task_DelivryIn_C_Check_Cases::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, Temp_int_Variable) == 0x000010, "Member 'Task_DelivryIn_C_Check_Cases::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'Task_DelivryIn_C_Check_Cases::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Task_DelivryIn_C_Check_Cases::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'Task_DelivryIn_C_Check_Cases::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, Temp_int_Variable_1) == 0x000020, "Member 'Task_DelivryIn_C_Check_Cases::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, K2Node_Select_Default) == 0x000024, "Member 'Task_DelivryIn_C_Check_Cases::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Task_DelivryIn_C_Check_Cases::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'Task_DelivryIn_C_Check_Cases::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'Task_DelivryIn_C_Check_Cases::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, CallFunc_Array_Length_ReturnValue_1) == 0x000034, "Member 'Task_DelivryIn_C_Check_Cases::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, CallFunc_Array_Get_Item) == 0x000038, "Member 'Task_DelivryIn_C_Check_Cases::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Check_Cases, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'Task_DelivryIn_C_Check_Cases::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Task_DelivryIn.Task_DelivryIn_C.Choose Cases
// 0x0058 (0x0058 - 0x0000)
struct Task_DelivryIn_C_Choose_Cases final
{
public:
	int32                                         Size;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADeliveryCase_C*>                Result;                                            // 0x0008(0x0010)(Parm, OutParm)
	TArray<class ADeliveryCase_C*>                _Temp_CasesResult;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ADeliveryCase_C*>                _Temp_Cases;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADeliveryCase_C*                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DelivryIn_C_Choose_Cases) == 0x000008, "Wrong alignment on Task_DelivryIn_C_Choose_Cases");
static_assert(sizeof(Task_DelivryIn_C_Choose_Cases) == 0x000058, "Wrong size on Task_DelivryIn_C_Choose_Cases");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, Size) == 0x000000, "Member 'Task_DelivryIn_C_Choose_Cases::Size' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, Result) == 0x000008, "Member 'Task_DelivryIn_C_Choose_Cases::Result' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, _Temp_CasesResult) == 0x000018, "Member 'Task_DelivryIn_C_Choose_Cases::_Temp_CasesResult' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, _Temp_Cases) == 0x000028, "Member 'Task_DelivryIn_C_Choose_Cases::_Temp_Cases' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, Temp_int_Variable) == 0x000038, "Member 'Task_DelivryIn_C_Choose_Cases::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'Task_DelivryIn_C_Choose_Cases::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'Task_DelivryIn_C_Choose_Cases::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'Task_DelivryIn_C_Choose_Cases::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, CallFunc_Array_Get_Item) == 0x000048, "Member 'Task_DelivryIn_C_Choose_Cases::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Choose_Cases, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'Task_DelivryIn_C_Choose_Cases::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function Task_DelivryIn.Task_DelivryIn_C.ExecuteUbergraph_Task_DelivryIn
// 0x00A0 (0x00A0 - 0x0000)
struct Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Difficulty                                  Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ADeliveryCase_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Cases_Finished;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Check_Cases_Count;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADeliveryCase_C*                        CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ADeliveryCase_C*                        CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Map_Position_Location;                // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn) == 0x000008, "Wrong alignment on Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn");
static_assert(sizeof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn) == 0x0000A0, "Wrong size on Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, EntryPoint) == 0x000000, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, Temp_int_Variable) == 0x000004, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, Temp_byte_Variable) == 0x00000C, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, K2Node_Event_Delay) == 0x000020, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::K2Node_Event_Delay' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Check_Cases_Finished) == 0x000050, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Check_Cases_Finished' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Check_Cases_Count) == 0x000054, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Check_Cases_Count' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Array_Get_Item) == 0x000058, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Get_Map_Position_Location) == 0x000070, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Get_Map_Position_Location' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Less_IntInt_ReturnValue_1) == 0x00008C, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Array_Length_ReturnValue_2) == 0x000094, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, K2Node_Select_Default) == 0x000098, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn, CallFunc_Delay_Duration_ImplicitCast) == 0x00009C, "Member 'Task_DelivryIn_C_ExecuteUbergraph_Task_DelivryIn::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function Task_DelivryIn.Task_DelivryIn_C.Select Cases
// 0x0088 (0x0088 - 0x0000)
struct Task_DelivryIn_C_Select_Cases final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_Sectors>                          TempSectors;                                       // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class ADeliveryCase_C*>                Temp_Case_for_Task;                                // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ADeliveryCase_C*>                Temp_Cases;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADeliveryCase_C*                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADeliveryCase_C*                        CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  CallFunc_Array_Get_Item_2;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DelivryIn_C_Select_Cases) == 0x000008, "Wrong alignment on Task_DelivryIn_C_Select_Cases");
static_assert(sizeof(Task_DelivryIn_C_Select_Cases) == 0x000088, "Wrong size on Task_DelivryIn_C_Select_Cases");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, Count) == 0x000000, "Member 'Task_DelivryIn_C_Select_Cases::Count' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, TempSectors) == 0x000008, "Member 'Task_DelivryIn_C_Select_Cases::TempSectors' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, Temp_Case_for_Task) == 0x000018, "Member 'Task_DelivryIn_C_Select_Cases::Temp_Case_for_Task' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, Temp_Cases) == 0x000028, "Member 'Task_DelivryIn_C_Select_Cases::Temp_Cases' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, Temp_int_Array_Index_Variable) == 0x000038, "Member 'Task_DelivryIn_C_Select_Cases::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'Task_DelivryIn_C_Select_Cases::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Array_Get_Item) == 0x000048, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Array_Add_ReturnValue_1) == 0x00005C, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Array_Get_Item_2) == 0x000060, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000068, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'Task_DelivryIn_C_Select_Cases::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'Task_DelivryIn_C_Select_Cases::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Less_IntInt_ReturnValue_1) == 0x00007C, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_DelivryIn_C_Select_Cases, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'Task_DelivryIn_C_Select_Cases::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function Task_DelivryIn.Task_DelivryIn_C.Start Task
// 0x0008 (0x0008 - 0x0000)
struct Task_DelivryIn_C_Start_Task final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DelivryIn_C_Start_Task) == 0x000008, "Wrong alignment on Task_DelivryIn_C_Start_Task");
static_assert(sizeof(Task_DelivryIn_C_Start_Task) == 0x000008, "Wrong size on Task_DelivryIn_C_Start_Task");
static_assert(offsetof(Task_DelivryIn_C_Start_Task, Delay) == 0x000000, "Member 'Task_DelivryIn_C_Start_Task::Delay' has a wrong offset!");

}

