#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Data

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_Sectors_structs.hpp"
#include "Task_classes.hpp"
#include "E_Difficulty_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Data.Task_Data_C
// 0x0048 (0x03B0 - 0x0368)
class ATask_Data_C final : public ATask_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Task_Data_C;                        // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AData_PC_C*>                     Source_PC;                                         // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AData_PC_C*>                     Target_PC;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AData_PC_C*>                     Task_Source_PC;                                    // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AData_PC_C*>                     Task_Target_PC;                                    // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void Check_PC();
	void Check_PC_Task(bool* Finished, int32* Count);
	void ExecuteUbergraph_Task_Data(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Select_PC(int32 PC_Count);
	void Start_Task(double Delay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Task_Data_C">();
	}
	static class ATask_Data_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATask_Data_C>();
	}
};
static_assert(alignof(ATask_Data_C) == 0x000008, "Wrong alignment on ATask_Data_C");
static_assert(sizeof(ATask_Data_C) == 0x0003B0, "Wrong size on ATask_Data_C");
static_assert(offsetof(ATask_Data_C, UberGraphFrame_Task_Data_C) == 0x000368, "Member 'ATask_Data_C::UberGraphFrame_Task_Data_C' has a wrong offset!");
static_assert(offsetof(ATask_Data_C, Source_PC) == 0x000370, "Member 'ATask_Data_C::Source_PC' has a wrong offset!");
static_assert(offsetof(ATask_Data_C, Target_PC) == 0x000380, "Member 'ATask_Data_C::Target_PC' has a wrong offset!");
static_assert(offsetof(ATask_Data_C, Task_Source_PC) == 0x000390, "Member 'ATask_Data_C::Task_Source_PC' has a wrong offset!");
static_assert(offsetof(ATask_Data_C, Task_Target_PC) == 0x0003A0, "Member 'ATask_Data_C::Task_Target_PC' has a wrong offset!");

}

