#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskManager

#include "Basic.hpp"

#include "Str_ItemSpawnRequest_structs.hpp"
#include "Enum_WeaponListCase_structs.hpp"
#include "Str_Item_structs.hpp"
#include "Str_ItemState_structs.hpp"
#include "E_Difficulty_structs.hpp"
#include "Str_ItemSpawnLocation_structs.hpp"


namespace SDK::Params
{

// Function TaskManager.TaskManager_C.All Join Update
// 0x0010 (0x0010 - 0x0000)
struct TaskManager_C_All_Join_Update final
{
public:
	TArray<class ATask_C*>                        Tasks;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TaskManager_C_All_Join_Update) == 0x000008, "Wrong alignment on TaskManager_C_All_Join_Update");
static_assert(sizeof(TaskManager_C_All_Join_Update) == 0x000010, "Wrong size on TaskManager_C_All_Join_Update");
static_assert(offsetof(TaskManager_C_All_Join_Update, Tasks) == 0x000000, "Member 'TaskManager_C_All_Join_Update::Tasks' has a wrong offset!");

// Function TaskManager.TaskManager_C.Check Finished Tasks
// 0x0028 (0x0028 - 0x0000)
struct TaskManager_C_Check_Finished_Tasks final
{
public:
	bool                                          End;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Finished;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATask_C*                                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskManager_C_Check_Finished_Tasks) == 0x000008, "Wrong alignment on TaskManager_C_Check_Finished_Tasks");
static_assert(sizeof(TaskManager_C_Check_Finished_Tasks) == 0x000028, "Wrong size on TaskManager_C_Check_Finished_Tasks");
static_assert(offsetof(TaskManager_C_Check_Finished_Tasks, End) == 0x000000, "Member 'TaskManager_C_Check_Finished_Tasks::End' has a wrong offset!");
static_assert(offsetof(TaskManager_C_Check_Finished_Tasks, Finished) == 0x000001, "Member 'TaskManager_C_Check_Finished_Tasks::Finished' has a wrong offset!");
static_assert(offsetof(TaskManager_C_Check_Finished_Tasks, Temp_int_Array_Index_Variable) == 0x000004, "Member 'TaskManager_C_Check_Finished_Tasks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TaskManager_C_Check_Finished_Tasks, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'TaskManager_C_Check_Finished_Tasks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TaskManager_C_Check_Finished_Tasks, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'TaskManager_C_Check_Finished_Tasks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_Check_Finished_Tasks, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'TaskManager_C_Check_Finished_Tasks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_Check_Finished_Tasks, CallFunc_Array_Get_Item) == 0x000018, "Member 'TaskManager_C_Check_Finished_Tasks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TaskManager_C_Check_Finished_Tasks, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'TaskManager_C_Check_Finished_Tasks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TaskManager.TaskManager_C.ExecuteUbergraph_TaskManager
// 0x04B0 (0x04B0 - 0x0000)
struct TaskManager_C_ExecuteUbergraph_TaskManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest;            // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Item                              K2Node_MakeStruct_Str_Item;                        // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_1;          // 0x0030(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ReferenceParm)
	struct FStr_Item                              K2Node_MakeStruct_Str_Item_1;                      // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_2;          // 0x0060(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_3;          // 0x0068(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState_1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          K2Node_MakeArray_Array_2;                          // 0x0078(0x0010)(ReferenceParm)
	struct FStr_Item                              K2Node_MakeStruct_Str_Item_2;                      // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_4;          // 0x0098(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_5;          // 0x00A0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState_2;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          K2Node_MakeArray_Array_3;                          // 0x00B0(0x0010)(ReferenceParm)
	struct FStr_Item                              K2Node_MakeStruct_Str_Item_3;                      // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_6;          // 0x00D0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_7;          // 0x00D8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_8;          // 0x00E0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          K2Node_MakeArray_Array_4;                          // 0x00E8(0x0010)(ReferenceParm)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_9;          // 0x00F8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_10;         // 0x0100(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          K2Node_MakeArray_Array_5;                          // 0x0108(0x0010)(ReferenceParm)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_11;         // 0x0118(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_12;         // 0x0120(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_13;         // 0x0128(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          K2Node_MakeArray_Array_6;                          // 0x0130(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_Item                              K2Node_MakeStruct_Str_Item_4;                      // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Task_Count;                     // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Difficulty                                  K2Node_CustomEvent_Difficulty;                     // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Player_Count;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_14;         // 0x0194(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_15;         // 0x019C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Next;                           // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_16;         // 0x01AC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_17;         // 0x01B4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          K2Node_MakeArray_Array_7;                          // 0x01C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Item                              K2Node_MakeStruct_Str_Item_5;                      // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_18;         // 0x01F4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATask_C*>                        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0200(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Finished_Tasks_End;                 // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATask_C*>                        CallFunc_Set_Session_Tasks_Selected_Tasks;         // 0x0250(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemSpawn_Handler_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_19;         // 0x0280(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_8;                          // 0x0298(0x0010)(ReferenceParm)
	class ATask_C*                                CallFunc_Array_Get_Item;                           // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState_3;                 // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_Item                              K2Node_MakeStruct_Str_Item_6;                      // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ATask_C*>                        K2Node_CustomEvent_Tasks;                          // 0x02F0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_4;                               // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAlarmButton_C*>                 CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0308(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_5;                               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_20;         // 0x0320(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_NewMenu_C*>                   CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0328(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FStr_ItemSpawnRequest                  K2Node_MakeStruct_Str_ItemSpawnRequest_21;         // 0x0338(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_NewMenu_C*                           CallFunc_Array_Get_Item_2;                         // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_ItemSpawnRequest>          K2Node_MakeArray_Array_9;                          // 0x0348(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Difficulty                                  Temp_byte_Variable;                                // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A[0x2];                                      // 0x035A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM_1;                         // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Spawn_Item_Location;                      // 0x0371(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Spawn_Item_Location_1;                    // 0x0373(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Spawn_Item_Location_2;                    // 0x0375(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_377[0x1];                                      // 0x0377(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAlarmButton_C*                         CallFunc_Array_Get_Item_3;                         // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x2];                                      // 0x03FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATask_C*                                CallFunc_Array_Get_Item_4;                         // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Spawn_Item_Location_3;                    // 0x0418(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B[0x1];                                      // 0x041B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Spawn_Item_Location_4;                    // 0x0420(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Spawn_Item_Location_5;                    // 0x0422(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Spawn_Item_Location_6;                    // 0x0428(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x042A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B[0x1];                                      // 0x042B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_11;                // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_2;       // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState_4;                 // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_Item                              K2Node_MakeStruct_Str_Item_7;                      // 0x0440(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Spawn_Item_Location_7;                    // 0x0450(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452[0x6];                                      // 0x0452(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM_2;                         // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_5;                         // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState_5;                 // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_Item                              K2Node_MakeStruct_Str_Item_8;                      // 0x0478(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 CallFunc_Spawn_Item_Location_8;                    // 0x048C(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x048E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48F[0x1];                                      // 0x048F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0490(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskManager_C_ExecuteUbergraph_TaskManager) == 0x000008, "Wrong alignment on TaskManager_C_ExecuteUbergraph_TaskManager");
static_assert(sizeof(TaskManager_C_ExecuteUbergraph_TaskManager) == 0x0004B0, "Wrong size on TaskManager_C_ExecuteUbergraph_TaskManager");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, EntryPoint) == 0x000000, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest) == 0x000004, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_Item) == 0x000010, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_Item' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array) == 0x000020, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_1) == 0x000030, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemState) == 0x000038, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array_1) == 0x000040, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_Item_1) == 0x000050, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_Item_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_2) == 0x000060, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_3) == 0x000068, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_3' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemState_1) == 0x000070, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemState_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array_2) == 0x000078, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_Item_2) == 0x000088, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_Item_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_4) == 0x000098, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_4' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_5) == 0x0000A0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_5' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemState_2) == 0x0000A8, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemState_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array_3) == 0x0000B0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_Item_3) == 0x0000C0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_Item_3' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_6) == 0x0000D0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_6' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_7) == 0x0000D8, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_7' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_8) == 0x0000E0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_8' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array_4) == 0x0000E8, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_9) == 0x0000F8, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_9' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_10) == 0x000100, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_10' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array_5) == 0x000108, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_11) == 0x000118, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_11' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_12) == 0x000120, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_12' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_13) == 0x000128, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_13' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array_6) == 0x000130, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Variable) == 0x000140, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Variable_1) == 0x000144, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000148, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Add_IntInt_ReturnValue) == 0x00014C, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Array_Index_Variable) == 0x000150, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Loop_Counter_Variable) == 0x000154, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000158, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Array_Index_Variable_1) == 0x00015C, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_Item_4) == 0x000160, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_Item_4' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Variable_2) == 0x000170, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Loop_Counter_Variable_1) == 0x000174, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Add_IntInt_ReturnValue_2) == 0x000178, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Loop_Counter_Variable_2) == 0x00017C, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Add_IntInt_ReturnValue_3) == 0x000180, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Array_Index_Variable_2) == 0x000184, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_CustomEvent_Task_Count) == 0x000188, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_CustomEvent_Task_Count' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_CustomEvent_Difficulty) == 0x00018C, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_CustomEvent_Difficulty' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_CustomEvent_Player_Count) == 0x000190, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_CustomEvent_Player_Count' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_14) == 0x000194, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_14' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_15) == 0x00019C, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_15' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_CustomEvent_Next) == 0x0001A4, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_CustomEvent_Next' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001A8, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_16) == 0x0001AC, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_16' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_17) == 0x0001B4, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_17' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Array_LastIndex_ReturnValue) == 0x0001BC, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array_7) == 0x0001C0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001D0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_SelectInt_ReturnValue) == 0x0001D4, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Add_IntInt_ReturnValue_5) == 0x0001D8, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001DC, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_Item_5) == 0x0001E0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_Item_5' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_SelectInt_ReturnValue_1) == 0x0001F0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_18) == 0x0001F4, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_18' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000200, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_CreateDelegate_OutputDelegate) == 0x000210, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Array_Length_ReturnValue) == 0x000220, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_GetGameMode_ReturnValue) == 0x000228, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Check_Finished_Tasks_End) == 0x000230, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Check_Finished_Tasks_End' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_DynamicCast_AsGM) == 0x000238, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Loop_Counter_Variable_3) == 0x000244, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Less_IntInt_ReturnValue) == 0x000248, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Set_Session_Tasks_Selected_Tasks) == 0x000250, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Set_Session_Tasks_Selected_Tasks' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Add_IntInt_ReturnValue_6) == 0x000260, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_GetActorOfClass_ReturnValue) == 0x000268, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000270, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_19) == 0x000280, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_19' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Variable_3) == 0x000288, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00028C, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Add_IntInt_ReturnValue_7) == 0x000290, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Array_Index_Variable_3) == 0x000294, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array_8) == 0x000298, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Array_Get_Item) == 0x0002A8, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Array_Get_Item_1) == 0x0002B0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Percent_IntInt_ReturnValue) == 0x0002B4, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Array_Length_ReturnValue_1) == 0x0002B8, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002BC, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002C0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Divide_IntInt_ReturnValue) == 0x0002C4, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemState_3) == 0x0002C8, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemState_3' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_Item_6) == 0x0002D0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_Item_6' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002E0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_CustomEvent_Tasks) == 0x0002F0, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_CustomEvent_Tasks' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Variable_4) == 0x000300, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000308, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, Temp_int_Variable_5) == 0x000318, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Array_Length_ReturnValue_2) == 0x00031C, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_20) == 0x000320, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_20' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000328, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeStruct_Str_ItemSpawnRequest_21) == 0x000338, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeStruct_Str_ItemSpawnRequest_21' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, CallFunc_Array_Get_Item_2) == 0x000340, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(TaskManager_C_ExecuteUbergraph_TaskManager, K2Node_MakeArray_Array_9) == 0x000348, "Member 'TaskManager_C_ExecuteUbergraph_TaskManager::K2Node_MakeArray_Array_9' has a wrong offset!");
