#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Alim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_Difficulty_structs.hpp"


namespace SDK::Params
{

// Function Task_Alim.Task_Alim_C.Check Alims State
// 0x0038 (0x0038 - 0x0000)
struct Task_Alim_C_Check_Alims_State final
{
public:
	bool                                          Finished;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Count;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _All_Charged;                                      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAlimBox_C*                             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Alim_C_Check_Alims_State) == 0x000008, "Wrong alignment on Task_Alim_C_Check_Alims_State");
static_assert(sizeof(Task_Alim_C_Check_Alims_State) == 0x000038, "Wrong size on Task_Alim_C_Check_Alims_State");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, Finished) == 0x000000, "Member 'Task_Alim_C_Check_Alims_State::Finished' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, Count) == 0x000004, "Member 'Task_Alim_C_Check_Alims_State::Count' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, _Count) == 0x000008, "Member 'Task_Alim_C_Check_Alims_State::_Count' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, _All_Charged) == 0x00000C, "Member 'Task_Alim_C_Check_Alims_State::_All_Charged' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Task_Alim_C_Check_Alims_State::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Task_Alim_C_Check_Alims_State::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Task_Alim_C_Check_Alims_State::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'Task_Alim_C_Check_Alims_State::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, CallFunc_Array_Get_Item) == 0x000020, "Member 'Task_Alim_C_Check_Alims_State::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'Task_Alim_C_Check_Alims_State::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'Task_Alim_C_Check_Alims_State::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'Task_Alim_C_Check_Alims_State::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, Temp_int_Variable) == 0x000030, "Member 'Task_Alim_C_Check_Alims_State::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Check_Alims_State, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'Task_Alim_C_Check_Alims_State::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function Task_Alim.Task_Alim_C.ExecuteUbergraph_Task_Alim
// 0x00A0 (0x00A0 - 0x0000)
struct Task_Alim_C_ExecuteUbergraph_Task_Alim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Difficulty                                  Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Delay;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAlimBox_C*>                     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_Check_Alims_State_Finished;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Check_Alims_State_Count;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAlimBox_C*                             CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAlimBox_C*                             CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_MapPosition_Location;                 // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Alim_C_ExecuteUbergraph_Task_Alim) == 0x000008, "Wrong alignment on Task_Alim_C_ExecuteUbergraph_Task_Alim");
static_assert(sizeof(Task_Alim_C_ExecuteUbergraph_Task_Alim) == 0x0000A0, "Wrong size on Task_Alim_C_ExecuteUbergraph_Task_Alim");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, EntryPoint) == 0x000000, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, Temp_byte_Variable) == 0x000004, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, Temp_int_Variable) == 0x000008, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, K2Node_Event_Delay) == 0x000020, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::K2Node_Event_Delay' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Check_Alims_State_Finished) == 0x000038, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Check_Alims_State_Finished' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Check_Alims_State_Count) == 0x00003C, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Check_Alims_State_Count' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Array_Get_Item) == 0x000050, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, Temp_int_Loop_Counter_Variable_1) == 0x000060, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Get_MapPosition_Location) == 0x000070, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Get_MapPosition_Location' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Array_Length_ReturnValue_2) == 0x00008C, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Array_Add_ReturnValue) == 0x000094, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, K2Node_Select_Default) == 0x000098, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_ExecuteUbergraph_Task_Alim, CallFunc_Delay_Duration_ImplicitCast) == 0x00009C, "Member 'Task_Alim_C_ExecuteUbergraph_Task_Alim::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function Task_Alim.Task_Alim_C.Select Alims
// 0x0050 (0x0050 - 0x0000)
struct Task_Alim_C_Select_Alims final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAlimBox_C*>                     Temp_Alims;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AVent_C*>                        Temp_Vents;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAlimBox_C*                             CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Alim_C_Select_Alims) == 0x000008, "Wrong alignment on Task_Alim_C_Select_Alims");
static_assert(sizeof(Task_Alim_C_Select_Alims) == 0x000050, "Wrong size on Task_Alim_C_Select_Alims");
static_assert(offsetof(Task_Alim_C_Select_Alims, Count) == 0x000000, "Member 'Task_Alim_C_Select_Alims::Count' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, Temp_Alims) == 0x000008, "Member 'Task_Alim_C_Select_Alims::Temp_Alims' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, Temp_Vents) == 0x000018, "Member 'Task_Alim_C_Select_Alims::Temp_Vents' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Task_Alim_C_Select_Alims::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'Task_Alim_C_Select_Alims::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Task_Alim_C_Select_Alims::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, CallFunc_Array_Get_Item) == 0x000038, "Member 'Task_Alim_C_Select_Alims::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'Task_Alim_C_Select_Alims::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'Task_Alim_C_Select_Alims::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'Task_Alim_C_Select_Alims::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Alim_C_Select_Alims, CallFunc_Less_IntInt_ReturnValue_1) == 0x000049, "Member 'Task_Alim_C_Select_Alims::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function Task_Alim.Task_Alim_C.Start Task
// 0x0008 (0x0008 - 0x0000)
struct Task_Alim_C_Start_Task final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Alim_C_Start_Task) == 0x000008, "Wrong alignment on Task_Alim_C_Start_Task");
static_assert(sizeof(Task_Alim_C_Start_Task) == 0x000008, "Wrong size on Task_Alim_C_Start_Task");
static_assert(offsetof(Task_Alim_C_Start_Task, Delay) == 0x000000, "Member 'Task_Alim_C_Start_Task::Delay' has a wrong offset!");

}

