#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskKeyboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TaskKeyboard.TaskKeyboard_C
// 0x0040 (0x02E8 - 0x02A8)
class ATaskKeyboard_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   C_Down;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   C_Up;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AButton_C*                              Up;                                                // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AButton_C*                              Down;                                              // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATaskManager_C*                         Screen_Ref;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__TaskKeyboard_Down_K2Node_ComponentBoundEvent_1_Button_Push__DelegateSignature(class AMec_C* Source);
	void BndEvt__TaskKeyboard_Up_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature(class AMec_C* Source);
	void ExecuteUbergraph_TaskKeyboard(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TaskKeyboard_C">();
	}
	static class ATaskKeyboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATaskKeyboard_C>();
	}
};
static_assert(alignof(ATaskKeyboard_C) == 0x000008, "Wrong alignment on ATaskKeyboard_C");
static_assert(sizeof(ATaskKeyboard_C) == 0x0002E8, "Wrong size on ATaskKeyboard_C");
static_assert(offsetof(ATaskKeyboard_C, UberGraphFrame) == 0x0002A8, "Member 'ATaskKeyboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATaskKeyboard_C, C_Down) == 0x0002B0, "Member 'ATaskKeyboard_C::C_Down' has a wrong offset!");
static_assert(offsetof(ATaskKeyboard_C, C_Up) == 0x0002B8, "Member 'ATaskKeyboard_C::C_Up' has a wrong offset!");
static_assert(offsetof(ATaskKeyboard_C, Cube) == 0x0002C0, "Member 'ATaskKeyboard_C::Cube' has a wrong offset!");
static_assert(offsetof(ATaskKeyboard_C, Root) == 0x0002C8, "Member 'ATaskKeyboard_C::Root' has a wrong offset!");
static_assert(offsetof(ATaskKeyboard_C, Up) == 0x0002D0, "Member 'ATaskKeyboard_C::Up' has a wrong offset!");
static_assert(offsetof(ATaskKeyboard_C, Down) == 0x0002D8, "Member 'ATaskKeyboard_C::Down' has a wrong offset!");
static_assert(offsetof(ATaskKeyboard_C, Screen_Ref) == 0x0002E0, "Member 'ATaskKeyboard_C::Screen_Ref' has a wrong offset!");

}

