#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "RigVM_structs.hpp"
#include "Engine_structs.hpp"
#include "PBIK_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_7740914b0ac3ba33
// 0x0190 (0x0190 - 0x0000)
struct FPropertyBag_7740914b0ac3ba33 final
{
public:
	struct FVector                                RigVMModel___VariableNode_2_Value__Const;          // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatDiv_A__Const;                // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_Minimum__Const;        // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_Maximum__Const;        // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRemap_SourceMaximum__Const;  // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___MathFloatRemap_bClamp__Const;         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatPow_B__Const;                // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_B__Const;                // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_1_Item__Const;   // 0x0034(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_SetTransform_1_Space__Const;  // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_1_bInitial__Const; // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___SpringInterpVectorV2_Strength__Const; // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRelativeTransformForItem_Child__Const; // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathVectorScale_Factor__Const;        // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_Item__Const;     // 0x0058(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTranslation_Item__Const;   // 0x0064(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_SetRotation_Space__Const;     // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___RigUnit_SetRotation_Value__Const;     // 0x0080(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_Item__Const;   // 0x00A0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_Item__Const;   // 0x00AC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_Item__Const; // 0x00B8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_1_Item__Const; // 0x00C4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_1_1_Root__Const;                 // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_Effectors__Const;            // 0x00D8(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_5_1_Item__Const; // 0x00E8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_1_1_BoneSettings__Const;         // 0x00F8(0x0010)(Edit)
	TArray<class FName>                           RigVMModel___PBIK_1_1_ExcludedBones__Const;        // 0x0108(0x0010)(Edit)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_1_1_Settings__Const;             // 0x0118(0x0040)(Edit, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_1_1_Debug__Const;                // 0x0158(0x0008)(Edit, NoDestructor)
	class FName                                   RigVMModel___PBIK_1_1_1_Root__Const;               // 0x0160(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_1_Effectors__Const;          // 0x0168(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_5_1_1_Item__Const; // 0x0178(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_7740914b0ac3ba33) == 0x000010, "Wrong alignment on FPropertyBag_7740914b0ac3ba33");
static_assert(sizeof(FPropertyBag_7740914b0ac3ba33) == 0x000190, "Wrong size on FPropertyBag_7740914b0ac3ba33");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___VariableNode_2_Value__Const) == 0x000000, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___VariableNode_2_Value__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___MathFloatDiv_A__Const) == 0x000018, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___MathFloatDiv_A__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___MathFloatClamp_Minimum__Const) == 0x00001C, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___MathFloatClamp_Minimum__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___MathFloatClamp_Maximum__Const) == 0x000020, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___MathFloatClamp_Maximum__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___MathFloatRemap_SourceMaximum__Const) == 0x000024, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___MathFloatRemap_SourceMaximum__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___MathFloatRemap_bClamp__Const) == 0x000028, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___MathFloatRemap_bClamp__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___MathFloatPow_B__Const) == 0x00002C, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___MathFloatPow_B__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___MathFloatMul_B__Const) == 0x000030, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___MathFloatMul_B__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetTransform_1_Item__Const) == 0x000034, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetTransform_1_Space__Const) == 0x000040, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetTransform_1_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetTransform_1_bInitial__Const) == 0x000041, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetTransform_1_bInitial__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___SpringInterpVectorV2_Strength__Const) == 0x000044, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___SpringInterpVectorV2_Strength__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetRelativeTransformForItem_Child__Const) == 0x000048, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetRelativeTransformForItem_Child__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___MathVectorScale_Factor__Const) == 0x000054, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___MathVectorScale_Factor__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetTransform_Item__Const) == 0x000058, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetTranslation_Item__Const) == 0x000064, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetTranslation_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetRotation_Space__Const) == 0x000070, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetRotation_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetRotation_Value__Const) == 0x000080, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetRotation_Value__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetTransform_2_Item__Const) == 0x0000A0, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetTransform_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_GetTransform_2_Item__Const) == 0x0000AC, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_GetTransform_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_SetTransform_2_1_Item__Const) == 0x0000B8, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_SetTransform_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_GetTransform_2_1_Item__Const) == 0x0000C4, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_GetTransform_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___PBIK_1_1_Root__Const) == 0x0000D0, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___PBIK_1_1_Root__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___PBIK_1_1_Effectors__Const) == 0x0000D8, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___PBIK_1_1_Effectors__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_GetTransform_5_1_Item__Const) == 0x0000E8, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_GetTransform_5_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___PBIK_1_1_BoneSettings__Const) == 0x0000F8, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___PBIK_1_1_BoneSettings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___PBIK_1_1_ExcludedBones__Const) == 0x000108, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___PBIK_1_1_ExcludedBones__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___PBIK_1_1_Settings__Const) == 0x000118, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___PBIK_1_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___PBIK_1_1_Debug__Const) == 0x000158, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___PBIK_1_1_Debug__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___PBIK_1_1_1_Root__Const) == 0x000160, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___PBIK_1_1_1_Root__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___PBIK_1_1_1_Effectors__Const) == 0x000168, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___PBIK_1_1_1_Effectors__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_7740914b0ac3ba33, RigVMModel___RigUnit_GetTransform_5_1_1_Item__Const) == 0x000178, "Member 'FPropertyBag_7740914b0ac3ba33::RigVMModel___RigUnit_GetTransform_5_1_1_Item__Const' has a wrong offset!");

// PropertyBag Transient.PropertyBag_696f719a1dd22ce6
// 0x0490 (0x0490 - 0x0000)
struct FPropertyBag_696f719a1dd22ce6 final
{
public:
	bool                                          RigVMModel___HierarchyGetPoseItemArray_Initial__Const; // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigElementType                               RigVMModel___HierarchyGetPoseItemArray_ElementType__Const; // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 RigVMModel___HierarchyGetPoseItemArray_ItemsToGet__Const; // 0x0008(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_Item__Const;     // 0x0018(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_SetTransform_Space__Const;    // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0xB];                                       // 0x0025(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_Value__Const;    // 0x0030(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetTransform_Weight__Const;   // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_bPropagateToChildren__Const; // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_1_Item__Const;   // 0x0098(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTranslation_Item__Const;   // 0x00A4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_3_Item__Const; // 0x00B0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___RigUnit_SetRotation_Value__Const;     // 0x00C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_3_Item__Const;   // 0x00E0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_Item__Const;   // 0x00EC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_4_Item__Const;   // 0x00F8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_Item__Const; // 0x0104(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_3_Item__Const; // 0x0110(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_1_Item__Const; // 0x011C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_1_2_Item__Const; // 0x0128(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_2_2_Item__Const; // 0x0134(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_2_Item__Const; // 0x0140(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_2_1_Item__Const; // 0x014C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_1_1_Item__Const; // 0x0158(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_1_1_1_Item__Const; // 0x0164(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_2_1_Item__Const; // 0x0170(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_1_1_1_1_Item__Const; // 0x017C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_4_Item__Const;   // 0x0188(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_A__Const;               // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___AimBoneMath_InputTransform__Const;    // 0x01A0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_Secondary__Const;         // 0x0200(0x0048)(Edit, NoDestructor)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimBoneMath_DebugSettings__Const;     // 0x0250(0x0070)(Edit, NoDestructor)
	float                                         RigVMModel___If_True__Const;                       // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpV2_Strength__Const;       // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_2_B__Const;              // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpVectorV2_CriticalDamping__Const; // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterpVectorV2_Force__Const;    // 0x02D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpVectorV2_1_Strength__Const; // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLerp_1_B__Const;             // 0x02EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatDiv_1_B__Const;              // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatPow_B__Const;                // 0x02F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_Root__Const;                     // 0x02F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__Const;                // 0x0300(0x0010)(Edit)
	float                                         RigVMModel___MathFloatPow_1_B__Const;              // 0x0310(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_BoneSettings__Const;             // 0x0318(0x0010)(Edit)
	TArray<class FName>                           RigVMModel___PBIK_ExcludedBones__Const;            // 0x0328(0x0010)(Edit)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_Settings__Const;                 // 0x0338(0x0040)(Edit, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_Debug__Const;                    // 0x0378(0x0008)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_SetRotation_1_Item__Const;    // 0x0380(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTranslation_1_1_Item__Const; // 0x038C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DebugLineItemSpace_3_Color__Const;    // 0x0398(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_1_Root__Const;                   // 0x03A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_Effectors__Const;              // 0x03B0(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_5_Item__Const;   // 0x03C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_1_BoneSettings__Const;           // 0x03D0(0x0010)(Edit)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_1_Settings__Const;               // 0x03E0(0x0040)(Edit, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_1_Debug__Const;                  // 0x0420(0x0008)(Edit, NoDestructor)
	class FName                                   RigVMModel___PBIK_1_1_Root__Const;                 // 0x0428(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_Effectors__Const;            // 0x0430(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_5_1_Item__Const; // 0x0440(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DebugLineItemSpace_Color__Const;      // 0x044C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DebugLineItemSpace_1_Color__Const;    // 0x045C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DebugLineItemSpace_1_1_Color__Const;  // 0x046C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_2_Item__Const; // 0x047C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_696f719a1dd22ce6) == 0x000010, "Wrong alignment on FPropertyBag_696f719a1dd22ce6");
static_assert(sizeof(FPropertyBag_696f719a1dd22ce6) == 0x000490, "Wrong size on FPropertyBag_696f719a1dd22ce6");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___HierarchyGetPoseItemArray_Initial__Const) == 0x000000, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___HierarchyGetPoseItemArray_Initial__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___HierarchyGetPoseItemArray_ElementType__Const) == 0x000001, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___HierarchyGetPoseItemArray_ElementType__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___HierarchyGetPoseItemArray_ItemsToGet__Const) == 0x000008, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___HierarchyGetPoseItemArray_ItemsToGet__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_Item__Const) == 0x000018, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_Space__Const) == 0x000024, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_Value__Const) == 0x000030, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_Value__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_Weight__Const) == 0x000090, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_Weight__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_bPropagateToChildren__Const) == 0x000094, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_bPropagateToChildren__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_1_Item__Const) == 0x000098, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTranslation_Item__Const) == 0x0000A4, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTranslation_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_GetTransform_2_3_Item__Const) == 0x0000B0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_GetTransform_2_3_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetRotation_Value__Const) == 0x0000C0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetRotation_Value__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_3_Item__Const) == 0x0000E0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_3_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_2_Item__Const) == 0x0000EC, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_GetTransform_4_Item__Const) == 0x0000F8, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_GetTransform_4_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_2_1_1_Item__Const) == 0x000104, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_GetTransform_1_1_3_Item__Const) == 0x000110, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_GetTransform_1_1_3_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_2_1_1_1_Item__Const) == 0x00011C, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_2_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_GetTransform_1_1_1_2_Item__Const) == 0x000128, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_GetTransform_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_2_1_1_2_2_Item__Const) == 0x000134, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_2_1_1_2_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_2_1_1_2_Item__Const) == 0x000140, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_2_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_GetTransform_1_1_2_1_Item__Const) == 0x00014C, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_GetTransform_1_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_2_1_1_1_1_Item__Const) == 0x000158, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_2_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_GetTransform_1_1_1_1_1_Item__Const) == 0x000164, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_GetTransform_1_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_2_1_1_2_1_Item__Const) == 0x000170, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_2_1_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_2_1_1_1_1_1_Item__Const) == 0x00017C, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_2_1_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTransform_4_Item__Const) == 0x000188, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTransform_4_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___MathFloatLerp_A__Const) == 0x000194, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___MathFloatLerp_A__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___AimBoneMath_InputTransform__Const) == 0x0001A0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___AimBoneMath_InputTransform__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___AimBoneMath_Secondary__Const) == 0x000200, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___AimBoneMath_Secondary__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___AimBoneMath_DebugSettings__Const) == 0x000250, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___AimBoneMath_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___If_True__Const) == 0x0002C0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___If_True__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___SpringInterpV2_Strength__Const) == 0x0002C4, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___SpringInterpV2_Strength__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___MathFloatMul_2_B__Const) == 0x0002C8, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___MathFloatMul_2_B__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___SpringInterpVectorV2_CriticalDamping__Const) == 0x0002CC, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___SpringInterpVectorV2_CriticalDamping__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___SpringInterpVectorV2_Force__Const) == 0x0002D0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___SpringInterpVectorV2_Force__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___SpringInterpVectorV2_1_Strength__Const) == 0x0002E8, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___SpringInterpVectorV2_1_Strength__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___MathFloatLerp_1_B__Const) == 0x0002EC, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___MathFloatLerp_1_B__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___MathFloatDiv_1_B__Const) == 0x0002F0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___MathFloatDiv_1_B__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___MathFloatPow_B__Const) == 0x0002F4, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___MathFloatPow_B__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_Root__Const) == 0x0002F8, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_Root__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_Effectors__Const) == 0x000300, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_Effectors__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___MathFloatPow_1_B__Const) == 0x000310, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___MathFloatPow_1_B__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_BoneSettings__Const) == 0x000318, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_BoneSettings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_ExcludedBones__Const) == 0x000328, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_ExcludedBones__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_Settings__Const) == 0x000338, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_Settings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_Debug__Const) == 0x000378, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_Debug__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetRotation_1_Item__Const) == 0x000380, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetRotation_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_SetTranslation_1_1_Item__Const) == 0x00038C, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_SetTranslation_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___DebugLineItemSpace_3_Color__Const) == 0x000398, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___DebugLineItemSpace_3_Color__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_1_Root__Const) == 0x0003A8, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_1_Root__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_1_Effectors__Const) == 0x0003B0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_1_Effectors__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_GetTransform_5_Item__Const) == 0x0003C0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_GetTransform_5_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_1_BoneSettings__Const) == 0x0003D0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_1_BoneSettings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_1_Settings__Const) == 0x0003E0, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_1_Debug__Const) == 0x000420, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_1_Debug__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_1_1_Root__Const) == 0x000428, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_1_1_Root__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___PBIK_1_1_Effectors__Const) == 0x000430, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___PBIK_1_1_Effectors__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_GetTransform_5_1_Item__Const) == 0x000440, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_GetTransform_5_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___DebugLineItemSpace_Color__Const) == 0x00044C, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___DebugLineItemSpace_Color__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___DebugLineItemSpace_1_Color__Const) == 0x00045C, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___DebugLineItemSpace_1_Color__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___DebugLineItemSpace_1_1_Color__Const) == 0x00046C, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___DebugLineItemSpace_1_1_Color__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_696f719a1dd22ce6, RigVMModel___RigUnit_GetTransform_2_2_Item__Const) == 0x00047C, "Member 'FPropertyBag_696f719a1dd22ce6::RigVMModel___RigUnit_GetTransform_2_2_Item__Const' has a wrong offset!");

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosDestructionEvent_SWC) == 0x000004, "Wrong alignment on FChaosDestructionEvent_SWC");
static_assert(sizeof(FChaosDestructionEvent_SWC) == 0x000044, "Wrong size on FChaosDestructionEvent_SWC");
static_assert(offsetof(FChaosDestructionEvent_SWC, position) == 0x000000, "Member 'FChaosDestructionEvent_SWC::position' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Normal) == 0x00000C, "Member 'FChaosDestructionEvent_SWC::Normal' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Velocity) == 0x000018, "Member 'FChaosDestructionEvent_SWC::Velocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, AngularVelocity) == 0x000024, "Member 'FChaosDestructionEvent_SWC::AngularVelocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMin) == 0x000030, "Member 'FChaosDestructionEvent_SWC::ExtentMin' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMax) == 0x000034, "Member 'FChaosDestructionEvent_SWC::ExtentMax' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ParticleID) == 0x000038, "Member 'FChaosDestructionEvent_SWC::ParticleID' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Time) == 0x00003C, "Member 'FChaosDestructionEvent_SWC::Time' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Type) == 0x000040, "Member 'FChaosDestructionEvent_SWC::Type' has a wrong offset!");

// PropertyBag Transient.PropertyBag_2ce83e0c3f83124a
// 0x0900 (0x0900 - 0x0000)
struct FPropertyBag_2ce83e0c3f83124a final
{
public:
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_3_3_Result; // 0x0000(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionToRotator_Result;       // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetRelativeTransformForItem_RelativeTransform; // 0x0040(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_CachedChild; // 0x00A0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_CachedParent; // 0x00B0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionToRotator_Value;        // 0x00C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_3_3_Rotator__IO; // 0x00E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetRelativeTransformForItem_Value__IO; // 0x0100(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_CachedChild; // 0x0160(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_CachedParent; // 0x0170(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_3_3_1_Result; // 0x0180(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionToRotator_1_Result;     // 0x01A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetRelativeTransformForItem_1_RelativeTransform; // 0x01C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_1_CachedChild; // 0x0220(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_1_CachedParent; // 0x0230(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionToRotator_1_Value;      // 0x0240(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_3_3_1_Rotator__IO; // 0x0260(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetRelativeTransformForItem_1_Value__IO; // 0x0280(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_1_CachedChild; // 0x02E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_1_CachedParent; // 0x02F0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_3_3_2_Result; // 0x0300(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionToRotator_2_Result;     // 0x0320(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetRelativeTransformForItem_2_RelativeTransform; // 0x0340(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_2_CachedChild; // 0x03A0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_2_CachedParent; // 0x03B0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionToRotator_2_Value;      // 0x03C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_3_3_2_Rotator__IO; // 0x03E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetRelativeTransformForItem_2_Value__IO; // 0x0400(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_2_CachedChild; // 0x0460(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_2_CachedParent; // 0x0470(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_3_3_1_1_Result; // 0x0480(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionToRotator_1_1_Result;   // 0x04A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetRelativeTransformForItem_1_1_RelativeTransform; // 0x04C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_1_1_CachedChild; // 0x0520(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_1_1_CachedParent; // 0x0530(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionToRotator_1_1_Value;    // 0x0540(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_3_3_1_1_Rotator__IO; // 0x0560(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetRelativeTransformForItem_1_1_Value__IO; // 0x0580(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_1_1_CachedChild; // 0x05E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_1_1_CachedParent; // 0x05F0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_3_3_2_1_Result; // 0x0600(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionToRotator_2_1_Result;   // 0x0620(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_638[0x8];                                      // 0x0638(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_RelativeTransform; // 0x0640(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_CachedChild; // 0x06A0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_CachedParent; // 0x06B0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionToRotator_2_1_Value;    // 0x06C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_3_3_2_1_Rotator__IO; // 0x06E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F8[0x8];                                      // 0x06F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_Value__IO; // 0x0700(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_CachedChild; // 0x0760(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_CachedParent; // 0x0770(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionFromRotator_3_3_2_1_1_Result; // 0x0780(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionToRotator_2_1_1_Result; // 0x07A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B8[0x8];                                      // 0x07B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_1_RelativeTransform; // 0x07C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_1_CachedChild; // 0x0820(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_2_1_1_CachedParent; // 0x0830(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionToRotator_2_1_1_Value;  // 0x0840(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___MathQuaternionFromRotator_3_3_2_1_1_Rotator__IO; // 0x0860(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_878[0x8];                                      // 0x0878(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_1_Value__IO; // 0x0880(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_1_CachedChild; // 0x08E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_2_1_1_CachedParent; // 0x08F0(0x0010)(Edit)
};
static_assert(alignof(FPropertyBag_2ce83e0c3f83124a) == 0x000010, "Wrong alignment on FPropertyBag_2ce83e0c3f83124a");
static_assert(sizeof(FPropertyBag_2ce83e0c3f83124a) == 0x000900, "Wrong size on FPropertyBag_2ce83e0c3f83124a");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___MathQuaternionFromRotator_3_3_Result) == 0x000000, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___MathQuaternionFromRotator_3_3_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___MathQuaternionToRotator_Result) == 0x000020, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___MathQuaternionToRotator_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_GetRelativeTransformForItem_RelativeTransform) == 0x000040, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_GetRelativeTransformForItem_RelativeTransform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_GetRelativeTransformForItem_CachedChild) == 0x0000A0, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_GetRelativeTransformForItem_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_GetRelativeTransformForItem_CachedParent) == 0x0000B0, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_GetRelativeTransformForItem_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___MathQuaternionToRotator_Value) == 0x0000C0, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___MathQuaternionToRotator_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___MathQuaternionFromRotator_3_3_Rotator__IO) == 0x0000E0, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___MathQuaternionFromRotator_3_3_Rotator__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_SetRelativeTransformForItem_Value__IO) == 0x000100, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_SetRelativeTransformForItem_Value__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_SetRelativeTransformForItem_CachedChild) == 0x000160, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_SetRelativeTransformForItem_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_SetRelativeTransformForItem_CachedParent) == 0x000170, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_SetRelativeTransformForItem_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___MathQuaternionFromRotator_3_3_1_Result) == 0x000180, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___MathQuaternionFromRotator_3_3_1_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___MathQuaternionToRotator_1_Result) == 0x0001A0, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___MathQuaternionToRotator_1_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_GetRelativeTransformForItem_1_RelativeTransform) == 0x0001C0, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_GetRelativeTransformForItem_1_RelativeTransform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_GetRelativeTransformForItem_1_CachedChild) == 0x000220, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_GetRelativeTransformForItem_1_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_GetRelativeTransformForItem_1_CachedParent) == 0x000230, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_GetRelativeTransformForItem_1_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___MathQuaternionToRotator_1_Value) == 0x000240, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___MathQuaternionToRotator_1_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___MathQuaternionFromRotator_3_3_1_Rotator__IO) == 0x000260, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___MathQuaternionFromRotator_3_3_1_Rotator__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2ce83e0c3f83124a, RigVMModel___RigUnit_SetRelativeTransformForItem_1_Value__IO) == 0x000280, "Member 'FPropertyBag_2ce83e0c3f83124a::RigVMModel___RigUnit_SetRelativeTransformForItem_1_Value__IO' has a wrong offset!");
