#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tuto_SwitchSquare

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tuto_SwitchSquare.Tuto_SwitchSquare_C.Check Items on Square
// 0x0004 (0x0004 - 0x0000)
struct Tuto_SwitchSquare_C_Check_Items_on_Square final
{
public:
	int32                                         Item_In_Count;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_SwitchSquare_C_Check_Items_on_Square) == 0x000004, "Wrong alignment on Tuto_SwitchSquare_C_Check_Items_on_Square");
static_assert(sizeof(Tuto_SwitchSquare_C_Check_Items_on_Square) == 0x000004, "Wrong size on Tuto_SwitchSquare_C_Check_Items_on_Square");
static_assert(offsetof(Tuto_SwitchSquare_C_Check_Items_on_Square, Item_In_Count) == 0x000000, "Member 'Tuto_SwitchSquare_C_Check_Items_on_Square::Item_In_Count' has a wrong offset!");

// Function Tuto_SwitchSquare.Tuto_SwitchSquare_C.ExecuteUbergraph_Tuto_SwitchSquare
// 0x0090 (0x0090 - 0x0000)
struct Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_State;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBox_ReturnValue;                 // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare) == 0x000008, "Wrong alignment on Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare");
static_assert(sizeof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare) == 0x000090, "Wrong size on Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, EntryPoint) == 0x000000, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, CallFunc_GetPlayerPawn_ReturnValue) == 0x000020, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, K2Node_DynamicCast_AsMec) == 0x000028, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, K2Node_CustomEvent_State) == 0x000050, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, CallFunc_IsValid_ReturnValue_1) == 0x000064, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, CallFunc_IsValid_ReturnValue_2) == 0x000065, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, K2Node_SwitchInteger_CmpSuccess) == 0x000066, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, CallFunc_IsPointInBox_ReturnValue) == 0x000067, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::CallFunc_IsPointInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, CallFunc_GetGameMode_ReturnValue) == 0x000068, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, K2Node_DynamicCast_AsGM) == 0x000080, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'Tuto_SwitchSquare_C_ExecuteUbergraph_Tuto_SwitchSquare::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function Tuto_SwitchSquare.Tuto_SwitchSquare_C.Go To State
// 0x0004 (0x0004 - 0x0000)
struct Tuto_SwitchSquare_C_Go_To_State final
{
public:
	int32                                         State_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_SwitchSquare_C_Go_To_State) == 0x000004, "Wrong alignment on Tuto_SwitchSquare_C_Go_To_State");
static_assert(sizeof(Tuto_SwitchSquare_C_Go_To_State) == 0x000004, "Wrong size on Tuto_SwitchSquare_C_Go_To_State");
static_assert(offsetof(Tuto_SwitchSquare_C_Go_To_State, State_0) == 0x000000, "Member 'Tuto_SwitchSquare_C_Go_To_State::State_0' has a wrong offset!");

}

