#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutoManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Str_TutorialRoom_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TutoManager.TutoManager_C
// 0x0068 (0x0310 - 0x02A8)
class ATutoManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_TutorialRoom>              Rooms;                                             // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ATuto_Check_C*>                  All_Checks;                                        // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ATuto_Door_C*>                   All_Doors;                                         // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ATuto_ItemSpawn_C*>              All_Spawners;                                      // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ATuto_ItemSquare_C*                     Square_Item;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Check_Updated(int32 Room);
	void Check_Validation(int32 Room, bool* Validate, class ATuto_Door_C** Door);
	void Clear();
	void Close_Tutorial();
	void ExecuteUbergraph_TutoManager(int32 EntryPoint);
	void Get_Key(class AActor** Key);
	void Get_Name(class AMec_C* Mec, class FString* Name_0);
	void Local_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Net_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Other_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void ReceiveBeginPlay();
	void Resart_Tutorial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutoManager_C">();
	}
	static class ATutoManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATutoManager_C>();
	}
};
static_assert(alignof(ATutoManager_C) == 0x000008, "Wrong alignment on ATutoManager_C");
static_assert(sizeof(ATutoManager_C) == 0x000310, "Wrong size on ATutoManager_C");
static_assert(offsetof(ATutoManager_C, UberGraphFrame) == 0x0002A8, "Member 'ATutoManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATutoManager_C, DefaultSceneRoot) == 0x0002B0, "Member 'ATutoManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATutoManager_C, Rooms) == 0x0002B8, "Member 'ATutoManager_C::Rooms' has a wrong offset!");
static_assert(offsetof(ATutoManager_C, All_Checks) == 0x0002C8, "Member 'ATutoManager_C::All_Checks' has a wrong offset!");
static_assert(offsetof(ATutoManager_C, All_Doors) == 0x0002D8, "Member 'ATutoManager_C::All_Doors' has a wrong offset!");
static_assert(offsetof(ATutoManager_C, All_Spawners) == 0x0002E8, "Member 'ATutoManager_C::All_Spawners' has a wrong offset!");
static_assert(offsetof(ATutoManager_C, Square_Item) == 0x0002F8, "Member 'ATutoManager_C::Square_Item' has a wrong offset!");
static_assert(offsetof(ATutoManager_C, GM_Ref) == 0x000300, "Member 'ATutoManager_C::GM_Ref' has a wrong offset!");
static_assert(offsetof(ATutoManager_C, Mec_Ref) == 0x000308, "Member 'ATutoManager_C::Mec_Ref' has a wrong offset!");

}

