#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tutorial_Screen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tutorial_Screen.Tutorial_Screen_C.ExecuteUbergraph_Tutorial_Screen
// 0x01B8 (0x01B8 - 0x0000)
struct Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Pause_ReturnValue;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetTime_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetTime_ReturnValue_1;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetTime_ReturnValue_2;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Pause_ReturnValue_1;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetDuration_ReturnValue_1;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetTime_ReturnValue_3;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_2;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_3;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Rewind_ReturnValue;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              K2Node_CustomEvent_Time_1;                         // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_Time;                           // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Seek_ReturnValue;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Seek_ReturnValue_1;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSource*                           K2Node_CustomEvent_Source;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_TutoScreeWorld_C*                    K2Node_DynamicCast_AsW_Tuto_Scree_World;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Foward;                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetDuration_ReturnValue_2;                // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetTime_ReturnValue_4;                    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_4;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetDuration_ReturnValue_3;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_5;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetTime_ReturnValue_5;                    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_TimespanTimespan_ReturnValue;     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalSeconds_ReturnValue_6;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_Select_Default;                             // 0x0120(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetDuration_ReturnValue_4;                // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetTime_ReturnValue_6;                    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_7;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_8;            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Update_jauge_Value_ImplicitCast;          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Update_jauge_Value_ImplicitCast_1;        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromSeconds_Seconds_ImplicitCast;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_2;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Update_jauge_Value_ImplicitCast_2;        // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_3;     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_3;     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Update_jauge_Value_ImplicitCast_3;        // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen) == 0x000008, "Wrong alignment on Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen");
static_assert(sizeof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen) == 0x0001B8, "Wrong size on Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, EntryPoint) == 0x000000, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_IsPlaying_ReturnValue) == 0x000004, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Pause_ReturnValue) == 0x000005, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Pause_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetDuration_ReturnValue) == 0x000008, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTime_ReturnValue) == 0x000010, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTotalSeconds_ReturnValue) == 0x000018, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTotalSeconds_ReturnValue_1) == 0x00001C, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTotalSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTime_ReturnValue_1) == 0x000028, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTime_ReturnValue_2) == 0x000030, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_IsPlaying_ReturnValue_1) == 0x000038, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Pause_ReturnValue_1) == 0x000039, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Pause_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_HasAuthority_ReturnValue) == 0x00003A, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetDuration_ReturnValue_1) == 0x000040, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetDuration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTime_ReturnValue_3) == 0x000048, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTotalSeconds_ReturnValue_2) == 0x000050, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTotalSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTotalSeconds_ReturnValue_3) == 0x000054, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTotalSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Rewind_ReturnValue) == 0x000060, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Rewind_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_HasAuthority_ReturnValue_1) == 0x000061, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_HasAuthority_ReturnValue_2) == 0x000062, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Play_ReturnValue) == 0x000063, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, K2Node_CustomEvent_Time_1) == 0x000068, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::K2Node_CustomEvent_Time_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, K2Node_CustomEvent_Time) == 0x000070, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Seek_ReturnValue) == 0x000078, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Seek_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Seek_ReturnValue_1) == 0x000079, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Seek_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, K2Node_CustomEvent_Source) == 0x000080, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_OpenSource_ReturnValue) == 0x000088, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_OpenSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetWidget_ReturnValue) == 0x000090, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, K2Node_DynamicCast_AsW_Tuto_Scree_World) == 0x000098, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::K2Node_DynamicCast_AsW_Tuto_Scree_World' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, Temp_bool_Variable) == 0x0000A1, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_MakeTimespan_ReturnValue) == 0x0000A8, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, K2Node_CustomEvent_Foward) == 0x0000B0, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::K2Node_CustomEvent_Foward' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_SelectFloat_ReturnValue) == 0x0000B8, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, K2Node_Event_DeltaSeconds) == 0x0000C0, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetDuration_ReturnValue_2) == 0x0000C8, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetDuration_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTime_ReturnValue_4) == 0x0000D0, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTime_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTotalSeconds_ReturnValue_4) == 0x0000D8, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTotalSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetDuration_ReturnValue_3) == 0x0000E8, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetDuration_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_FClamp_ReturnValue) == 0x0000F0, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTotalSeconds_ReturnValue_5) == 0x0000F8, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTotalSeconds_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_FromSeconds_ReturnValue) == 0x000100, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTime_ReturnValue_5) == 0x000108, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTime_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Greater_TimespanTimespan_ReturnValue) == 0x000110, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Greater_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTotalSeconds_ReturnValue_6) == 0x000114, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTotalSeconds_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000118, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, K2Node_Select_Default) == 0x000120, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetDuration_ReturnValue_4) == 0x000128, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetDuration_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTime_ReturnValue_6) == 0x000130, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTime_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTotalSeconds_ReturnValue_7) == 0x000138, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTotalSeconds_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_GetTotalSeconds_ReturnValue_8) == 0x00013C, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_GetTotalSeconds_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000140, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000148, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000150, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Update_jauge_Value_ImplicitCast) == 0x000158, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Update_jauge_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000160, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000168, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Update_jauge_Value_ImplicitCast_1) == 0x000170, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Update_jauge_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000178, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_FromSeconds_Seconds_ImplicitCast) == 0x000180, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_FromSeconds_Seconds_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_B_ImplicitCast_2) == 0x000188, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_A_ImplicitCast_2) == 0x000190, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Update_jauge_Value_ImplicitCast_2) == 0x000198, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Update_jauge_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_B_ImplicitCast_3) == 0x0001A0, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Divide_DoubleDouble_A_ImplicitCast_3) == 0x0001A8, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Divide_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen, CallFunc_Update_jauge_Value_ImplicitCast_3) == 0x0001B0, "Member 'Tutorial_Screen_C_ExecuteUbergraph_Tutorial_Screen::CallFunc_Update_jauge_Value_ImplicitCast_3' has a wrong offset!");

// Function Tutorial_Screen.Tutorial_Screen_C.Move in Video
// 0x0001 (0x0001 - 0x0000)
struct Tutorial_Screen_C_Move_in_Video final
{
public:
	bool                                          Foward;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_Screen_C_Move_in_Video) == 0x000001, "Wrong alignment on Tutorial_Screen_C_Move_in_Video");
static_assert(sizeof(Tutorial_Screen_C_Move_in_Video) == 0x000001, "Wrong size on Tutorial_Screen_C_Move_in_Video");
static_assert(offsetof(Tutorial_Screen_C_Move_in_Video, Foward) == 0x000000, "Member 'Tutorial_Screen_C_Move_in_Video::Foward' has a wrong offset!");

// Function Tutorial_Screen.Tutorial_Screen_C.Pause Video
// 0x0008 (0x0008 - 0x0000)
struct Tutorial_Screen_C_Pause_Video final
{
public:
	struct FTimespan                              Time;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_Screen_C_Pause_Video) == 0x000008, "Wrong alignment on Tutorial_Screen_C_Pause_Video");
static_assert(sizeof(Tutorial_Screen_C_Pause_Video) == 0x000008, "Wrong size on Tutorial_Screen_C_Pause_Video");
static_assert(offsetof(Tutorial_Screen_C_Pause_Video, Time) == 0x000000, "Member 'Tutorial_Screen_C_Pause_Video::Time' has a wrong offset!");

// Function Tutorial_Screen.Tutorial_Screen_C.Play Video
// 0x0008 (0x0008 - 0x0000)
struct Tutorial_Screen_C_Play_Video final
{
public:
	struct FTimespan                              Time;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_Screen_C_Play_Video) == 0x000008, "Wrong alignment on Tutorial_Screen_C_Play_Video");
static_assert(sizeof(Tutorial_Screen_C_Play_Video) == 0x000008, "Wrong size on Tutorial_Screen_C_Play_Video");
static_assert(offsetof(Tutorial_Screen_C_Play_Video, Time) == 0x000000, "Member 'Tutorial_Screen_C_Play_Video::Time' has a wrong offset!");

// Function Tutorial_Screen.Tutorial_Screen_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Tutorial_Screen_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_Screen_C_ReceiveTick) == 0x000004, "Wrong alignment on Tutorial_Screen_C_ReceiveTick");
static_assert(sizeof(Tutorial_Screen_C_ReceiveTick) == 0x000004, "Wrong size on Tutorial_Screen_C_ReceiveTick");
static_assert(offsetof(Tutorial_Screen_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Tutorial_Screen_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Tutorial_Screen.Tutorial_Screen_C.Set Video
// 0x0008 (0x0008 - 0x0000)
struct Tutorial_Screen_C_Set_Video final
{
public:
	class UMediaSource*                           Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tutorial_Screen_C_Set_Video) == 0x000008, "Wrong alignment on Tutorial_Screen_C_Set_Video");
static_assert(sizeof(Tutorial_Screen_C_Set_Video) == 0x000008, "Wrong size on Tutorial_Screen_C_Set_Video");
static_assert(offsetof(Tutorial_Screen_C_Set_Video, Source) == 0x000000, "Member 'Tutorial_Screen_C_Set_Video::Source' has a wrong offset!");

}

