#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutoSprintJauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TutoSprintJauge.TutoSprintJauge_C
// 0x0060 (0x0308 - 0x02A8)
class ATutoSprintJauge_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Value_47FEF54543AB4AF46CB33890A9744DFE;   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_47FEF54543AB4AF46CB33890A9744DFE; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ATuto_Button_C*                         Button_1;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ATuto_Button_C*                         Button_2;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ATuto_Check_C*                          Check_1;                                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ATuto_Check_C*                          Check_2;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         State;                                             // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Jauge_M;                                           // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__TutoSprintJauge_Button_1_K2Node_ComponentBoundEvent_2_Press__DelegateSignature();
	void BndEvt__TutoSprintJauge_Button_2_K2Node_ComponentBoundEvent_3_Press__DelegateSignature();
	void Clear();
	void ExecuteUbergraph_TutoSprintJauge(int32 EntryPoint);
	void Go_To_State(int32 State_0);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void Tutorial_Change(bool Start);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutoSprintJauge_C">();
	}
	static class ATutoSprintJauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATutoSprintJauge_C>();
	}
};
static_assert(alignof(ATutoSprintJauge_C) == 0x000008, "Wrong alignment on ATutoSprintJauge_C");
static_assert(sizeof(ATutoSprintJauge_C) == 0x000308, "Wrong size on ATutoSprintJauge_C");
static_assert(offsetof(ATutoSprintJauge_C, UberGraphFrame) == 0x0002A8, "Member 'ATutoSprintJauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, Plane) == 0x0002B0, "Member 'ATutoSprintJauge_C::Plane' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, DefaultSceneRoot) == 0x0002B8, "Member 'ATutoSprintJauge_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, Timeline_Value_47FEF54543AB4AF46CB33890A9744DFE) == 0x0002C0, "Member 'ATutoSprintJauge_C::Timeline_Value_47FEF54543AB4AF46CB33890A9744DFE' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, Timeline__Direction_47FEF54543AB4AF46CB33890A9744DFE) == 0x0002C4, "Member 'ATutoSprintJauge_C::Timeline__Direction_47FEF54543AB4AF46CB33890A9744DFE' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, Timeline) == 0x0002C8, "Member 'ATutoSprintJauge_C::Timeline' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, Button_1) == 0x0002D0, "Member 'ATutoSprintJauge_C::Button_1' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, Button_2) == 0x0002D8, "Member 'ATutoSprintJauge_C::Button_2' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, Check_1) == 0x0002E0, "Member 'ATutoSprintJauge_C::Check_1' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, Check_2) == 0x0002E8, "Member 'ATutoSprintJauge_C::Check_2' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, State) == 0x0002F0, "Member 'ATutoSprintJauge_C::State' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, Jauge_M) == 0x0002F8, "Member 'ATutoSprintJauge_C::Jauge_M' has a wrong offset!");
static_assert(offsetof(ATutoSprintJauge_C, GM_Ref) == 0x000300, "Member 'ATutoSprintJauge_C::GM_Ref' has a wrong offset!");

}

