#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tuto_ItemSquare

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tuto_ItemSquare.Tuto_ItemSquare_C
// 0x0030 (0x02D8 - 0x02A8)
class ATuto_ItemSquare_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ATuto_Check_C*>                  Checks;                                            // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void Check_Items_on_Square(int32* Count);
	void Check_Square_Item();
	void Clear();
	void Error(bool Force);
	void ExecuteUbergraph_Tuto_ItemSquare(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tuto_ItemSquare_C">();
	}
	static class ATuto_ItemSquare_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATuto_ItemSquare_C>();
	}
};
static_assert(alignof(ATuto_ItemSquare_C) == 0x000008, "Wrong alignment on ATuto_ItemSquare_C");
static_assert(sizeof(ATuto_ItemSquare_C) == 0x0002D8, "Wrong size on ATuto_ItemSquare_C");
static_assert(offsetof(ATuto_ItemSquare_C, UberGraphFrame) == 0x0002A8, "Member 'ATuto_ItemSquare_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSquare_C, Plane) == 0x0002B0, "Member 'ATuto_ItemSquare_C::Plane' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSquare_C, DefaultSceneRoot) == 0x0002B8, "Member 'ATuto_ItemSquare_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSquare_C, GM_Ref) == 0x0002C0, "Member 'ATuto_ItemSquare_C::GM_Ref' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSquare_C, Checks) == 0x0002C8, "Member 'ATuto_ItemSquare_C::Checks' has a wrong offset!");

}

