#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tuto_ItemSpawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Str_ItemSpawnLocation_structs.hpp"
#include "Str_Item_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tuto_ItemSpawn.Tuto_ItemSpawn_C
// 0x0058 (0x0300 - 0x02A8)
class ATuto_ItemSpawn_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   C_DynamicMesh;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Used;                                              // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Zone;                                              // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 Location;                                          // 0x02D8(0x0002)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Item                              Item;                                              // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AItemDynamicMesh_C*                     DynamicMesh;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Clear();
	void ExecuteUbergraph_Tuto_ItemSpawn(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Spawn_Item();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tuto_ItemSpawn_C">();
	}
	static class ATuto_ItemSpawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATuto_ItemSpawn_C>();
	}
};
static_assert(alignof(ATuto_ItemSpawn_C) == 0x000008, "Wrong alignment on ATuto_ItemSpawn_C");
static_assert(sizeof(ATuto_ItemSpawn_C) == 0x000300, "Wrong size on ATuto_ItemSpawn_C");
static_assert(offsetof(ATuto_ItemSpawn_C, UberGraphFrame) == 0x0002A8, "Member 'ATuto_ItemSpawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, C_DynamicMesh) == 0x0002B0, "Member 'ATuto_ItemSpawn_C::C_DynamicMesh' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, Arrow) == 0x0002B8, "Member 'ATuto_ItemSpawn_C::Arrow' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, Cylinder) == 0x0002C0, "Member 'ATuto_ItemSpawn_C::Cylinder' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, Root) == 0x0002C8, "Member 'ATuto_ItemSpawn_C::Root' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, Used) == 0x0002D0, "Member 'ATuto_ItemSpawn_C::Used' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, Zone) == 0x0002D4, "Member 'ATuto_ItemSpawn_C::Zone' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, Location) == 0x0002D8, "Member 'ATuto_ItemSpawn_C::Location' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, Item) == 0x0002E0, "Member 'ATuto_ItemSpawn_C::Item' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, DynamicMesh) == 0x0002F0, "Member 'ATuto_ItemSpawn_C::DynamicMesh' has a wrong offset!");
static_assert(offsetof(ATuto_ItemSpawn_C, GM_Ref) == 0x0002F8, "Member 'ATuto_ItemSpawn_C::GM_Ref' has a wrong offset!");

}

