#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tuto_Door

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tuto_Door.Tuto_Door_C
// 0x0058 (0x0300 - 0x02A8)
class ATuto_Door_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   C_Check;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DoorBase;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Position_9ABAF97846A215DCE8EB398D53603854; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_9ABAF97846A215DCE8EB398D53603854; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Open;                                              // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Room;                                              // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATuto_Check_C*                          Check;                                             // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Close_Door();
	void ExecuteUbergraph_Tuto_Door(int32 EntryPoint);
	void Get_Key(class AActor** Key);
	void Get_Name(class AMec_C* Mec, class FString* Name_0);
	void Local_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Net_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void Open_Door();
	void Other_Interaction(int32 Index_0, class AActor* Source, const struct FStr_ItemState& Item_State);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void Tutorial_Change(bool Start);
	void UserConstructionScript();
	void Validate_Room();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tuto_Door_C">();
	}
	static class ATuto_Door_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATuto_Door_C>();
	}
};
static_assert(alignof(ATuto_Door_C) == 0x000008, "Wrong alignment on ATuto_Door_C");
static_assert(sizeof(ATuto_Door_C) == 0x000300, "Wrong size on ATuto_Door_C");
static_assert(offsetof(ATuto_Door_C, UberGraphFrame) == 0x0002A8, "Member 'ATuto_Door_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, C_Check) == 0x0002B0, "Member 'ATuto_Door_C::C_Check' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, HitBox) == 0x0002B8, "Member 'ATuto_Door_C::HitBox' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, Cube) == 0x0002C0, "Member 'ATuto_Door_C::Cube' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, DoorBase) == 0x0002C8, "Member 'ATuto_Door_C::DoorBase' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, Root) == 0x0002D0, "Member 'ATuto_Door_C::Root' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, Timeline_Position_9ABAF97846A215DCE8EB398D53603854) == 0x0002D8, "Member 'ATuto_Door_C::Timeline_Position_9ABAF97846A215DCE8EB398D53603854' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, Timeline__Direction_9ABAF97846A215DCE8EB398D53603854) == 0x0002DC, "Member 'ATuto_Door_C::Timeline__Direction_9ABAF97846A215DCE8EB398D53603854' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, Timeline) == 0x0002E0, "Member 'ATuto_Door_C::Timeline' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, GM_Ref) == 0x0002E8, "Member 'ATuto_Door_C::GM_Ref' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, Open) == 0x0002F0, "Member 'ATuto_Door_C::Open' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, Room) == 0x0002F4, "Member 'ATuto_Door_C::Room' has a wrong offset!");
static_assert(offsetof(ATuto_Door_C, Check) == 0x0002F8, "Member 'ATuto_Door_C::Check' has a wrong offset!");

}

