#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tuto_Button

#include "Basic.hpp"


namespace SDK::Params
{

// Function Tuto_Button.Tuto_Button_C.BndEvt__Tuto_Button_Button_K2Node_ComponentBoundEvent_0_Button Push__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Tuto_Button_C_BndEvt__Tuto_Button_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature final
{
public:
	class AMec_C*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Button_C_BndEvt__Tuto_Button_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong alignment on Tuto_Button_C_BndEvt__Tuto_Button_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(sizeof(Tuto_Button_C_BndEvt__Tuto_Button_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature) == 0x000008, "Wrong size on Tuto_Button_C_BndEvt__Tuto_Button_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature");
static_assert(offsetof(Tuto_Button_C_BndEvt__Tuto_Button_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature, Source) == 0x000000, "Member 'Tuto_Button_C_BndEvt__Tuto_Button_Button_K2Node_ComponentBoundEvent_0_Button_Push__DelegateSignature::Source' has a wrong offset!");

// Function Tuto_Button.Tuto_Button_C.ExecuteUbergraph_Tuto_Button
// 0x0068 (0x0068 - 0x0000)
struct Tuto_Button_C_ExecuteUbergraph_Tuto_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_ComponentBoundEvent_Source;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction;              // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button) == 0x000008, "Wrong alignment on Tuto_Button_C_ExecuteUbergraph_Tuto_Button");
static_assert(sizeof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button) == 0x000068, "Wrong size on Tuto_Button_C_ExecuteUbergraph_Tuto_Button");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, EntryPoint) == 0x000000, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, K2Node_ComponentBoundEvent_Source) == 0x000010, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::K2Node_ComponentBoundEvent_Source' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, CallFunc_Map_Values_Values) == 0x000028, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, CallFunc_Array_Get_Item) == 0x000038, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, K2Node_DynamicCast_AsBPI_Interaction) == 0x000048, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::K2Node_DynamicCast_AsBPI_Interaction' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_ExecuteUbergraph_Tuto_Button, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'Tuto_Button_C_ExecuteUbergraph_Tuto_Button::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Tuto_Button.Tuto_Button_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Tuto_Button_C_UserConstructionScript final
{
public:
	class AButton_C*                              K2Node_DynamicCast_AsButton;                       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Button_C_UserConstructionScript) == 0x000008, "Wrong alignment on Tuto_Button_C_UserConstructionScript");
static_assert(sizeof(Tuto_Button_C_UserConstructionScript) == 0x000010, "Wrong size on Tuto_Button_C_UserConstructionScript");
static_assert(offsetof(Tuto_Button_C_UserConstructionScript, K2Node_DynamicCast_AsButton) == 0x000000, "Member 'Tuto_Button_C_UserConstructionScript::K2Node_DynamicCast_AsButton' has a wrong offset!");
static_assert(offsetof(Tuto_Button_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Tuto_Button_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

