#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutoManager

#include "Basic.hpp"

#include "Str_TutorialRoom_structs.hpp"
#include "Str_ItemState_structs.hpp"


namespace SDK::Params
{

// Function TutoManager.TutoManager_C.Check Updated
// 0x0004 (0x0004 - 0x0000)
struct TutoManager_C_Check_Updated final
{
public:
	int32                                         Room;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutoManager_C_Check_Updated) == 0x000004, "Wrong alignment on TutoManager_C_Check_Updated");
static_assert(sizeof(TutoManager_C_Check_Updated) == 0x000004, "Wrong size on TutoManager_C_Check_Updated");
static_assert(offsetof(TutoManager_C_Check_Updated, Room) == 0x000000, "Member 'TutoManager_C_Check_Updated::Room' has a wrong offset!");

// Function TutoManager.TutoManager_C.Check Validation
// 0x0068 (0x0068 - 0x0000)
struct TutoManager_C_Check_Validation final
{
public:
	int32                                         Room;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Validate;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATuto_Door_C*                           Door;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Validate_;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_TutorialRoom                      CallFunc_Array_Get_Item;                           // 0x0028(0x0030)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATuto_Check_C*                          CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutoManager_C_Check_Validation) == 0x000008, "Wrong alignment on TutoManager_C_Check_Validation");
static_assert(sizeof(TutoManager_C_Check_Validation) == 0x000068, "Wrong size on TutoManager_C_Check_Validation");
static_assert(offsetof(TutoManager_C_Check_Validation, Room) == 0x000000, "Member 'TutoManager_C_Check_Validation::Room' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, Validate) == 0x000004, "Member 'TutoManager_C_Check_Validation::Validate' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, Door) == 0x000008, "Member 'TutoManager_C_Check_Validation::Door' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, Validate_) == 0x000010, "Member 'TutoManager_C_Check_Validation::Validate_' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'TutoManager_C_Check_Validation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, Temp_int_Array_Index_Variable) == 0x000018, "Member 'TutoManager_C_Check_Validation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'TutoManager_C_Check_Validation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'TutoManager_C_Check_Validation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, CallFunc_Array_Get_Item) == 0x000028, "Member 'TutoManager_C_Check_Validation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'TutoManager_C_Check_Validation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'TutoManager_C_Check_Validation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Check_Validation, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'TutoManager_C_Check_Validation::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function TutoManager.TutoManager_C.ExecuteUbergraph_TutoManager
// 0x0238 (0x0238 - 0x0000)
struct TutoManager_C_ExecuteUbergraph_TutoManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_TutorialRoom                      CallFunc_Array_Get_Item;                           // 0x0060(0x0030)(HasGetValueTypeHash)
	class ATuto_Door_C*                           CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATuto_Check_C*                          CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_TutorialRoom                      CallFunc_Array_Get_Item_3;                         // 0x00C0(0x0030)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATuto_Check_C*                          CallFunc_Array_Get_Item_4;                         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Room)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Room;                           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Validation_Validate;                // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATuto_Door_C*                           CallFunc_Check_Validation_Door;                    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATuto_Check_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x01E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATuto_Door_C*>                   CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x01F8(0x0010)(ReferenceParm)
	TArray<class ATuto_ItemSpawn_C*>              CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0208(0x0010)(ReferenceParm)
	class ATuto_ItemSquare_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutoManager_C_ExecuteUbergraph_TutoManager) == 0x000008, "Wrong alignment on TutoManager_C_ExecuteUbergraph_TutoManager");
static_assert(sizeof(TutoManager_C_ExecuteUbergraph_TutoManager) == 0x000238, "Wrong size on TutoManager_C_ExecuteUbergraph_TutoManager");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, EntryPoint) == 0x000000, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Array_Index_Variable) == 0x000004, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Array_Index_Variable_2) == 0x000014, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Array_Index_Variable_3) == 0x000028, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Array_Index_Variable_4) == 0x00002C, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_Event_Index_2) == 0x000030, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_Event_Source_2) == 0x000038, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_Event_Item_State_2) == 0x000040, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_Event_Index_1) == 0x000048, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_Event_Source_1) == 0x000050, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_Event_Item_State_1) == 0x000058, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Get_Item) == 0x000060, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00009C, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000B1, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Length_ReturnValue_2) == 0x0000B4, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Get_Item_3) == 0x0000C0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Add_ReturnValue) == 0x0000F0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Length_ReturnValue_3) == 0x0000F4, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Get_Item_4) == 0x0000F8, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x000100, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_GetDisplayName_ReturnValue) == 0x000108, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Array_Length_ReturnValue_4) == 0x000118, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Conv_IntToString_ReturnValue) == 0x000120, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Less_IntInt_ReturnValue_2) == 0x000130, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Concat_StrStr_ReturnValue) == 0x000138, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000148, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Loop_Counter_Variable_3) == 0x000158, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000160, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Less_IntInt_ReturnValue_3) == 0x000170, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Add_IntInt_ReturnValue_3) == 0x000174, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_CustomEvent_Room) == 0x000188, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_CustomEvent_Room' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Check_Validation_Validate) == 0x00018C, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Check_Validation_Validate' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Check_Validation_Door) == 0x000190, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Check_Validation_Door' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_Event_Index) == 0x000198, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_Event_Source) == 0x0001A0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_Event_Item_State) == 0x0001A8, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_SwitchInteger_CmpSuccess) == 0x0001B0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_GetGameMode_ReturnValue) == 0x0001B8, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001C0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_DynamicCast_AsGM) == 0x0001D0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, Temp_int_Loop_Counter_Variable_4) == 0x0001DC, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x0001E0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Less_IntInt_ReturnValue_4) == 0x0001F0, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001F4, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0001F8, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000208, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_GetActorOfClass_ReturnValue) == 0x000218, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, CallFunc_GetPlayerPawn_ReturnValue) == 0x000220, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_DynamicCast_AsMec) == 0x000228, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(TutoManager_C_ExecuteUbergraph_TutoManager, K2Node_DynamicCast_bSuccess_1) == 0x000230, "Member 'TutoManager_C_ExecuteUbergraph_TutoManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function TutoManager.TutoManager_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct TutoManager_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutoManager_C_Get_Key) == 0x000008, "Wrong alignment on TutoManager_C_Get_Key");
static_assert(sizeof(TutoManager_C_Get_Key) == 0x000008, "Wrong size on TutoManager_C_Get_Key");
static_assert(offsetof(TutoManager_C_Get_Key, Key) == 0x000000, "Member 'TutoManager_C_Get_Key::Key' has a wrong offset!");

// Function TutoManager.TutoManager_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct TutoManager_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TutoManager_C_Get_Name) == 0x000008, "Wrong alignment on TutoManager_C_Get_Name");
static_assert(sizeof(TutoManager_C_Get_Name) == 0x000018, "Wrong size on TutoManager_C_Get_Name");
static_assert(offsetof(TutoManager_C_Get_Name, Mec) == 0x000000, "Member 'TutoManager_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Get_Name, Name_0) == 0x000008, "Member 'TutoManager_C_Get_Name::Name_0' has a wrong offset!");

// Function TutoManager.TutoManager_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct TutoManager_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutoManager_C_Local_Interaction) == 0x000008, "Wrong alignment on TutoManager_C_Local_Interaction");
static_assert(sizeof(TutoManager_C_Local_Interaction) == 0x000018, "Wrong size on TutoManager_C_Local_Interaction");
static_assert(offsetof(TutoManager_C_Local_Interaction, Index_0) == 0x000000, "Member 'TutoManager_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Local_Interaction, Source) == 0x000008, "Member 'TutoManager_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Local_Interaction, Item_State) == 0x000010, "Member 'TutoManager_C_Local_Interaction::Item_State' has a wrong offset!");

// Function TutoManager.TutoManager_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct TutoManager_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutoManager_C_Net_Interaction) == 0x000008, "Wrong alignment on TutoManager_C_Net_Interaction");
static_assert(sizeof(TutoManager_C_Net_Interaction) == 0x000018, "Wrong size on TutoManager_C_Net_Interaction");
static_assert(offsetof(TutoManager_C_Net_Interaction, Index_0) == 0x000000, "Member 'TutoManager_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Net_Interaction, Source) == 0x000008, "Member 'TutoManager_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Net_Interaction, Item_State) == 0x000010, "Member 'TutoManager_C_Net_Interaction::Item_State' has a wrong offset!");

// Function TutoManager.TutoManager_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct TutoManager_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutoManager_C_Other_Interaction) == 0x000008, "Wrong alignment on TutoManager_C_Other_Interaction");
static_assert(sizeof(TutoManager_C_Other_Interaction) == 0x000018, "Wrong size on TutoManager_C_Other_Interaction");
static_assert(offsetof(TutoManager_C_Other_Interaction, Index_0) == 0x000000, "Member 'TutoManager_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Other_Interaction, Source) == 0x000008, "Member 'TutoManager_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(TutoManager_C_Other_Interaction, Item_State) == 0x000010, "Member 'TutoManager_C_Other_Interaction::Item_State' has a wrong offset!");

}

