#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tuto_Door

#include "Basic.hpp"

#include "Str_ItemState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Tuto_Door.Tuto_Door_C.ExecuteUbergraph_Tuto_Door
// 0x03F0 (0x03F0 - 0x0000)
struct Tuto_Door_C_ExecuteUbergraph_Tuto_Door final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_2;                             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_2;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source_1;                             // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State_1;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Source;                               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         K2Node_Event_Item_State;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00C0(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x01C0(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Start)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x02C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Start;                          // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x02E8(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door) == 0x000008, "Wrong alignment on Tuto_Door_C_ExecuteUbergraph_Tuto_Door");
static_assert(sizeof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door) == 0x0003F0, "Wrong size on Tuto_Door_C_ExecuteUbergraph_Tuto_Door");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, EntryPoint) == 0x000000, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, Temp_byte_Variable) == 0x000028, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, Temp_real_Variable) == 0x000030, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, Temp_real_Variable_1) == 0x000038, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, CallFunc_MakeVector_ReturnValue_1) == 0x000040, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Select_Default) == 0x000058, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, CallFunc_MakeVector_ReturnValue_2) == 0x000060, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Event_Index_2) == 0x000078, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Event_Source_2) == 0x000080, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Event_Source_2' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Event_Item_State_2) == 0x000088, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Event_Item_State_2' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Event_Index_1) == 0x000090, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Event_Source_1) == 0x000098, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Event_Source_1' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Event_Item_State_1) == 0x0000A0, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Event_Item_State_1' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Event_Index) == 0x0000A8, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Event_Source) == 0x0000B0, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Event_Source' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_Event_Item_State) == 0x0000B8, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_Event_Item_State' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000C0, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0001C0, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, CallFunc_GetGameMode_ReturnValue) == 0x0002C0, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_CreateDelegate_OutputDelegate) == 0x0002C8, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_DynamicCast_AsGM) == 0x0002D8, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_DynamicCast_bSuccess) == 0x0002E0, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, K2Node_CustomEvent_Start) == 0x0002E1, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::K2Node_CustomEvent_Start' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x0002E8, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_ExecuteUbergraph_Tuto_Door, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x0003E8, "Member 'Tuto_Door_C_ExecuteUbergraph_Tuto_Door::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");

// Function Tuto_Door.Tuto_Door_C.Get Key
// 0x0008 (0x0008 - 0x0000)
struct Tuto_Door_C_Get_Key final
{
public:
	class AActor*                                 Key;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Door_C_Get_Key) == 0x000008, "Wrong alignment on Tuto_Door_C_Get_Key");
static_assert(sizeof(Tuto_Door_C_Get_Key) == 0x000008, "Wrong size on Tuto_Door_C_Get_Key");
static_assert(offsetof(Tuto_Door_C_Get_Key, Key) == 0x000000, "Member 'Tuto_Door_C_Get_Key::Key' has a wrong offset!");

// Function Tuto_Door.Tuto_Door_C.Get Name
// 0x0018 (0x0018 - 0x0000)
struct Tuto_Door_C_Get_Name final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Door_C_Get_Name) == 0x000008, "Wrong alignment on Tuto_Door_C_Get_Name");
static_assert(sizeof(Tuto_Door_C_Get_Name) == 0x000018, "Wrong size on Tuto_Door_C_Get_Name");
static_assert(offsetof(Tuto_Door_C_Get_Name, Mec) == 0x000000, "Member 'Tuto_Door_C_Get_Name::Mec' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_Get_Name, Name_0) == 0x000008, "Member 'Tuto_Door_C_Get_Name::Name_0' has a wrong offset!");

// Function Tuto_Door.Tuto_Door_C.Local Interaction
// 0x0018 (0x0018 - 0x0000)
struct Tuto_Door_C_Local_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Door_C_Local_Interaction) == 0x000008, "Wrong alignment on Tuto_Door_C_Local_Interaction");
static_assert(sizeof(Tuto_Door_C_Local_Interaction) == 0x000018, "Wrong size on Tuto_Door_C_Local_Interaction");
static_assert(offsetof(Tuto_Door_C_Local_Interaction, Index_0) == 0x000000, "Member 'Tuto_Door_C_Local_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_Local_Interaction, Source) == 0x000008, "Member 'Tuto_Door_C_Local_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_Local_Interaction, Item_State) == 0x000010, "Member 'Tuto_Door_C_Local_Interaction::Item_State' has a wrong offset!");

// Function Tuto_Door.Tuto_Door_C.Net Interaction
// 0x0018 (0x0018 - 0x0000)
struct Tuto_Door_C_Net_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Door_C_Net_Interaction) == 0x000008, "Wrong alignment on Tuto_Door_C_Net_Interaction");
static_assert(sizeof(Tuto_Door_C_Net_Interaction) == 0x000018, "Wrong size on Tuto_Door_C_Net_Interaction");
static_assert(offsetof(Tuto_Door_C_Net_Interaction, Index_0) == 0x000000, "Member 'Tuto_Door_C_Net_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_Net_Interaction, Source) == 0x000008, "Member 'Tuto_Door_C_Net_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_Net_Interaction, Item_State) == 0x000010, "Member 'Tuto_Door_C_Net_Interaction::Item_State' has a wrong offset!");

// Function Tuto_Door.Tuto_Door_C.Other Interaction
// 0x0018 (0x0018 - 0x0000)
struct Tuto_Door_C_Other_Interaction final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         Item_State;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Door_C_Other_Interaction) == 0x000008, "Wrong alignment on Tuto_Door_C_Other_Interaction");
static_assert(sizeof(Tuto_Door_C_Other_Interaction) == 0x000018, "Wrong size on Tuto_Door_C_Other_Interaction");
static_assert(offsetof(Tuto_Door_C_Other_Interaction, Index_0) == 0x000000, "Member 'Tuto_Door_C_Other_Interaction::Index_0' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_Other_Interaction, Source) == 0x000008, "Member 'Tuto_Door_C_Other_Interaction::Source' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_Other_Interaction, Item_State) == 0x000010, "Member 'Tuto_Door_C_Other_Interaction::Item_State' has a wrong offset!");

// Function Tuto_Door.Tuto_Door_C.Tutorial Change
// 0x0001 (0x0001 - 0x0000)
struct Tuto_Door_C_Tutorial_Change final
{
public:
	bool                                          Start;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Door_C_Tutorial_Change) == 0x000001, "Wrong alignment on Tuto_Door_C_Tutorial_Change");
static_assert(sizeof(Tuto_Door_C_Tutorial_Change) == 0x000001, "Wrong size on Tuto_Door_C_Tutorial_Change");
static_assert(offsetof(Tuto_Door_C_Tutorial_Change, Start) == 0x000000, "Member 'Tuto_Door_C_Tutorial_Change::Start' has a wrong offset!");

// Function Tuto_Door.Tuto_Door_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Tuto_Door_C_UserConstructionScript final
{
public:
	class ATuto_Check_C*                          K2Node_DynamicCast_AsTuto_Check;                   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Door_C_UserConstructionScript) == 0x000008, "Wrong alignment on Tuto_Door_C_UserConstructionScript");
static_assert(sizeof(Tuto_Door_C_UserConstructionScript) == 0x000010, "Wrong size on Tuto_Door_C_UserConstructionScript");
static_assert(offsetof(Tuto_Door_C_UserConstructionScript, K2Node_DynamicCast_AsTuto_Check) == 0x000000, "Member 'Tuto_Door_C_UserConstructionScript::K2Node_DynamicCast_AsTuto_Check' has a wrong offset!");
static_assert(offsetof(Tuto_Door_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Tuto_Door_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

