#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tuto_HandsSquare

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tuto_HandsSquare.Tuto_HandsSquare_C.Check Items on Square
// 0x0004 (0x0004 - 0x0000)
struct Tuto_HandsSquare_C_Check_Items_on_Square final
{
public:
	int32                                         Item_In_Count;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_HandsSquare_C_Check_Items_on_Square) == 0x000004, "Wrong alignment on Tuto_HandsSquare_C_Check_Items_on_Square");
static_assert(sizeof(Tuto_HandsSquare_C_Check_Items_on_Square) == 0x000004, "Wrong size on Tuto_HandsSquare_C_Check_Items_on_Square");
static_assert(offsetof(Tuto_HandsSquare_C_Check_Items_on_Square, Item_In_Count) == 0x000000, "Member 'Tuto_HandsSquare_C_Check_Items_on_Square::Item_In_Count' has a wrong offset!");

// Function Tuto_HandsSquare.Tuto_HandsSquare_C.ExecuteUbergraph_Tuto_HandsSquare
// 0x00E0 (0x00E0 - 0x0000)
struct Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_State;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBox_ReturnValue;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Start)>                   K2Node_CreateDelegate_OutputDelegate_1;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Start;                          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare) == 0x000008, "Wrong alignment on Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare");
static_assert(sizeof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare) == 0x0000E0, "Wrong size on Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, EntryPoint) == 0x000000, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_SwitchInteger_CmpSuccess_1) == 0x000005, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_SwitchInteger_CmpSuccess_2) == 0x000006, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000020, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, CallFunc_GetPlayerPawn_ReturnValue) == 0x000038, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_DynamicCast_AsMec) == 0x000040, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_CustomEvent_State) == 0x000068, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_SwitchInteger_CmpSuccess_3) == 0x00006C, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_SwitchInteger_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, CallFunc_Conv_IntToVector_ReturnValue) == 0x000070, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000088, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, CallFunc_IsPointInBox_ReturnValue) == 0x0000A0, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::CallFunc_IsPointInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_Event_DeltaSeconds) == 0x0000A4, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, CallFunc_GetGameMode_ReturnValue) == 0x0000A8, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_DynamicCast_AsGM) == 0x0000B0, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000CC, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare, K2Node_CustomEvent_Start) == 0x0000DC, "Member 'Tuto_HandsSquare_C_ExecuteUbergraph_Tuto_HandsSquare::K2Node_CustomEvent_Start' has a wrong offset!");

// Function Tuto_HandsSquare.Tuto_HandsSquare_C.Go To State
// 0x0004 (0x0004 - 0x0000)
struct Tuto_HandsSquare_C_Go_To_State final
{
public:
	int32                                         State_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_HandsSquare_C_Go_To_State) == 0x000004, "Wrong alignment on Tuto_HandsSquare_C_Go_To_State");
static_assert(sizeof(Tuto_HandsSquare_C_Go_To_State) == 0x000004, "Wrong size on Tuto_HandsSquare_C_Go_To_State");
static_assert(offsetof(Tuto_HandsSquare_C_Go_To_State, State_0) == 0x000000, "Member 'Tuto_HandsSquare_C_Go_To_State::State_0' has a wrong offset!");

// Function Tuto_HandsSquare.Tuto_HandsSquare_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Tuto_HandsSquare_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_HandsSquare_C_ReceiveTick) == 0x000004, "Wrong alignment on Tuto_HandsSquare_C_ReceiveTick");
static_assert(sizeof(Tuto_HandsSquare_C_ReceiveTick) == 0x000004, "Wrong size on Tuto_HandsSquare_C_ReceiveTick");
static_assert(offsetof(Tuto_HandsSquare_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Tuto_HandsSquare_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Tuto_HandsSquare.Tuto_HandsSquare_C.Tutorial Change
// 0x0001 (0x0001 - 0x0000)
struct Tuto_HandsSquare_C_Tutorial_Change final
{
public:
	bool                                          Start;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_HandsSquare_C_Tutorial_Change) == 0x000001, "Wrong alignment on Tuto_HandsSquare_C_Tutorial_Change");
static_assert(sizeof(Tuto_HandsSquare_C_Tutorial_Change) == 0x000001, "Wrong size on Tuto_HandsSquare_C_Tutorial_Change");
static_assert(offsetof(Tuto_HandsSquare_C_Tutorial_Change, Start) == 0x000000, "Member 'Tuto_HandsSquare_C_Tutorial_Change::Start' has a wrong offset!");

}

