#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tuto_Mannequin

#include "Basic.hpp"

#include "Enum_TutoMannequinState_structs.hpp"


namespace SDK::Params
{

// Function Tuto_Mannequin.Tuto_Mannequin_C.ExecuteUbergraph_Tuto_Mannequin
// 0x0068 (0x0068 - 0x0000)
struct Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_TutoMannequinState                       K2Node_CustomEvent_State;                          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Health;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Stamina;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Crit;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0058(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_InterpSpeed_ImplicitCast;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin) == 0x000008, "Wrong alignment on Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin");
static_assert(sizeof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin) == 0x000068, "Wrong size on Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, EntryPoint) == 0x000000, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, K2Node_DynamicCast_AsGM) == 0x000018, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, K2Node_CustomEvent_State) == 0x000034, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, K2Node_CustomEvent_Health) == 0x000038, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::K2Node_CustomEvent_Health' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, K2Node_CustomEvent_Stamina) == 0x00003C, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::K2Node_CustomEvent_Stamina' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, K2Node_CustomEvent_Crit) == 0x000040, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::K2Node_CustomEvent_Crit' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, CallFunc_FInterpTo_ReturnValue) == 0x000050, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000058, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin, CallFunc_FInterpTo_InterpSpeed_ImplicitCast) == 0x000060, "Member 'Tuto_Mannequin_C_ExecuteUbergraph_Tuto_Mannequin::CallFunc_FInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");

// Function Tuto_Mannequin.Tuto_Mannequin_C.Hit
// 0x000C (0x000C - 0x0000)
struct Tuto_Mannequin_C_Hit final
{
public:
	int32                                         Health;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stamina;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Crit;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Mannequin_C_Hit) == 0x000004, "Wrong alignment on Tuto_Mannequin_C_Hit");
static_assert(sizeof(Tuto_Mannequin_C_Hit) == 0x00000C, "Wrong size on Tuto_Mannequin_C_Hit");
static_assert(offsetof(Tuto_Mannequin_C_Hit, Health) == 0x000000, "Member 'Tuto_Mannequin_C_Hit::Health' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_Hit, Stamina) == 0x000004, "Member 'Tuto_Mannequin_C_Hit::Stamina' has a wrong offset!");
static_assert(offsetof(Tuto_Mannequin_C_Hit, Crit) == 0x000008, "Member 'Tuto_Mannequin_C_Hit::Crit' has a wrong offset!");

// Function Tuto_Mannequin.Tuto_Mannequin_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Tuto_Mannequin_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Mannequin_C_ReceiveTick) == 0x000004, "Wrong alignment on Tuto_Mannequin_C_ReceiveTick");
static_assert(sizeof(Tuto_Mannequin_C_ReceiveTick) == 0x000004, "Wrong size on Tuto_Mannequin_C_ReceiveTick");
static_assert(offsetof(Tuto_Mannequin_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Tuto_Mannequin_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Tuto_Mannequin.Tuto_Mannequin_C.Set State
// 0x0001 (0x0001 - 0x0000)
struct Tuto_Mannequin_C_Set_State final
{
public:
	Enum_TutoMannequinState                       State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Mannequin_C_Set_State) == 0x000001, "Wrong alignment on Tuto_Mannequin_C_Set_State");
static_assert(sizeof(Tuto_Mannequin_C_Set_State) == 0x000001, "Wrong size on Tuto_Mannequin_C_Set_State");
static_assert(offsetof(Tuto_Mannequin_C_Set_State, State_0) == 0x000000, "Member 'Tuto_Mannequin_C_Set_State::State_0' has a wrong offset!");

// Function Tuto_Mannequin.Tuto_Mannequin_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct Tuto_Mannequin_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_Mannequin_C_UserConstructionScript) == 0x000008, "Wrong alignment on Tuto_Mannequin_C_UserConstructionScript");
static_assert(sizeof(Tuto_Mannequin_C_UserConstructionScript) == 0x000008, "Wrong size on Tuto_Mannequin_C_UserConstructionScript");
static_assert(offsetof(Tuto_Mannequin_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Tuto_Mannequin_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

