#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tuto_ItemSpawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Str_ItemState_structs.hpp"


namespace SDK::Params
{

// Function Tuto_ItemSpawn.Tuto_ItemSpawn_C.ExecuteUbergraph_Tuto_ItemSpawn
// 0x0270 (0x0270 - 0x0000)
struct Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         K2Node_MakeStruct_Str_ItemState;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UData_Gun_C*                            K2Node_DynamicCast_AsData_Gun;                     // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_ItemState                         K2Node_Select_Default;                             // 0x0224(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWorldItem_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x024C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn) == 0x000010, "Wrong alignment on Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn");
static_assert(sizeof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn) == 0x000270, "Wrong size on Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, EntryPoint) == 0x000000, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, Temp_bool_Variable) == 0x000004, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, K2Node_MakeStruct_Str_ItemState) == 0x000008, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::K2Node_MakeStruct_Str_ItemState' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_BreakTransform_Location) == 0x000070, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_BreakRotator_Roll) == 0x0000B8, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_BreakRotator_Pitch) == 0x0000BC, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_BreakRotator_Yaw) == 0x0000C0, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000C8, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_MakeRotator_ReturnValue) == 0x0000D0, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000E8, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_MakeVector_ReturnValue) == 0x000150, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000168, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_TransformLocation_ReturnValue) == 0x000170, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000188, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_Add_VectorVector_ReturnValue) == 0x000190, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_MakeTransform_ReturnValue_1) == 0x0001B0, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000210, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, K2Node_DynamicCast_AsData_Gun) == 0x000218, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::K2Node_DynamicCast_AsData_Gun' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, K2Node_Select_Default) == 0x000224, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_FinishSpawningActor_ReturnValue) == 0x000230, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_GetGameMode_ReturnValue) == 0x000238, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, K2Node_DynamicCast_AsGM) == 0x000240, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_IsValid_ReturnValue) == 0x000249, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, K2Node_CreateDelegate_OutputDelegate) == 0x00024C, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000260, "Member 'Tuto_ItemSpawn_C_ExecuteUbergraph_Tuto_ItemSpawn::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Tuto_ItemSpawn.Tuto_ItemSpawn_C.UserConstructionScript
// 0x0168 (0x0168 - 0x0000)
struct Tuto_ItemSpawn_C_UserConstructionScript final
{
public:
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemDynamicMesh_C*                     K2Node_DynamicCast_AsItem_Dynamic_Mesh;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0068(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Tuto_ItemSpawn_C_UserConstructionScript) == 0x000008, "Wrong alignment on Tuto_ItemSpawn_C_UserConstructionScript");
static_assert(sizeof(Tuto_ItemSpawn_C_UserConstructionScript) == 0x000168, "Wrong size on Tuto_ItemSpawn_C_UserConstructionScript");
static_assert(offsetof(Tuto_ItemSpawn_C_UserConstructionScript, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000000, "Member 'Tuto_ItemSpawn_C_UserConstructionScript::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Tuto_ItemSpawn_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_UserConstructionScript, K2Node_DynamicCast_AsItem_Dynamic_Mesh) == 0x000010, "Member 'Tuto_ItemSpawn_C_UserConstructionScript::K2Node_DynamicCast_AsItem_Dynamic_Mesh' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Tuto_ItemSpawn_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000020, "Member 'Tuto_ItemSpawn_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x000038, "Member 'Tuto_ItemSpawn_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000050, "Member 'Tuto_ItemSpawn_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Tuto_ItemSpawn_C_UserConstructionScript, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000068, "Member 'Tuto_ItemSpawn_C_UserConstructionScript::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");

}

