#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceSource

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function VoiceSource.VoiceSource_C.ExecuteUbergraph_VoiceSource
// 0x05E0 (0x05E0 - 0x0000)
struct VoiceSource_C_ExecuteUbergraph_VoiceSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorTickInterval_ReturnValue;         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0218(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0334(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue; // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x0408(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPathLength_ReturnValue;                // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0420(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_435[0x3];                                      // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue;     // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A[0x6];                                      // 0x056A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Target_Deviation_ImplicitCast;  // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Target_Distance_ImplicitCast;   // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Last_Direction_ImplicitCast;    // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Last_Direction_ImplicitCast_1;  // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Target_Direction_ImplicitCast;  // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActorTickInterval_TickInterval_ImplicitCast; // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_1; // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_2; // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceSource_C_ExecuteUbergraph_VoiceSource) == 0x000010, "Wrong alignment on VoiceSource_C_ExecuteUbergraph_VoiceSource");
static_assert(sizeof(VoiceSource_C_ExecuteUbergraph_VoiceSource) == 0x0005E0, "Wrong size on VoiceSource_C_ExecuteUbergraph_VoiceSource");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, EntryPoint) == 0x000000, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::EntryPoint' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_struct_Variable) == 0x000004, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_struct_Variable_1) == 0x000014, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_struct_Variable_2) == 0x000028, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_struct_Variable_3) == 0x000068, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeRotator_ReturnValue) == 0x000078, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000090, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_GetForwardVector_ReturnValue) == 0x0000A0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_struct_Variable_4) == 0x0000B8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_X) == 0x0000C8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_Y) == 0x0000D0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_Z) == 0x0000D8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeVector_ReturnValue) == 0x0000E0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_struct_Variable_5) == 0x0000F8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_struct_Variable_6) == 0x000108, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000118, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000120, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000128, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000140, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000158, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000170, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Add_VectorVector_ReturnValue) == 0x000188, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001A0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_X_1) == 0x0001B8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_Y_1) == 0x0001C0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_Z_1) == 0x0001C8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeVector_ReturnValue_1) == 0x0001D0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001E8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_GetActorTickInterval_ReturnValue) == 0x000200, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_GetActorTickInterval_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Vector_Distance_ReturnValue) == 0x000208, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Round_ReturnValue) == 0x000210, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000218, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Divide_IntInt_ReturnValue) == 0x000318, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Conv_IntToString_ReturnValue) == 0x000320, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, K2Node_Event_DeltaSeconds) == 0x000330, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_struct_Variable_7) == 0x000334, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_int_Loop_Counter_Variable) == 0x000344, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeRotator_ReturnValue_1) == 0x000348, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Add_IntInt_ReturnValue) == 0x000360, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000368, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_X_2) == 0x000380, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_Y_2) == 0x000388, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_Z_2) == 0x000390, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000398, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeVector_ReturnValue_2) == 0x0003B0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_X_3) == 0x0003C8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_Y_3) == 0x0003D0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakVector_Z_3) == 0x0003D8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_int_Variable) == 0x0003E0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeVector_ReturnValue_3) == 0x0003E8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_FindPathToLocationSynchronously_ReturnValue) == 0x000400, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_FindPathToLocationSynchronously_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_struct_Variable_8) == 0x000408, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_GetPathLength_ReturnValue) == 0x000418, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_GetPathLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, K2Node_Select_Default) == 0x000420, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Array_Length_ReturnValue) == 0x000430, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Less_IntInt_ReturnValue) == 0x000434, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, Temp_int_Array_Index_Variable) == 0x000438, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Greater_IntInt_ReturnValue) == 0x00043C, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Array_Get_Item) == 0x000440, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_FindLookAtRotation_ReturnValue) == 0x000458, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakRotator_Roll) == 0x000470, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakRotator_Pitch) == 0x000474, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakRotator_Yaw) == 0x000478, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeRotator_ReturnValue_2) == 0x000480, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeTransform_ReturnValue) == 0x0004A0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_InverseTransformRotation_ReturnValue) == 0x000500, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_InverseTransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakRotator_Roll_1) == 0x000518, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakRotator_Pitch_1) == 0x00051C, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_BreakRotator_Yaw_1) == 0x000520, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Abs_ReturnValue) == 0x000528, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000530, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_GetPlayerPawn_ReturnValue) == 0x000538, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000540, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, K2Node_DynamicCast_AsMec) == 0x000548, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, K2Node_DynamicCast_bSuccess) == 0x000550, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_RandomFloatInRange_ReturnValue) == 0x000558, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000560, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000568, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000569, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000570, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000578, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000580, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000588, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, K2Node_VariableSet_Target_Deviation_ImplicitCast) == 0x000590, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::K2Node_VariableSet_Target_Deviation_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x000594, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, K2Node_VariableSet_Target_Distance_ImplicitCast) == 0x000598, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::K2Node_VariableSet_Target_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, K2Node_VariableSet_Last_Direction_ImplicitCast) == 0x0005A0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::K2Node_VariableSet_Last_Direction_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, K2Node_VariableSet_Last_Direction_ImplicitCast_1) == 0x0005A8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::K2Node_VariableSet_Last_Direction_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, K2Node_VariableSet_Target_Direction_ImplicitCast) == 0x0005B0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::K2Node_VariableSet_Target_Direction_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Abs_A_ImplicitCast) == 0x0005B8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_SetActorTickInterval_TickInterval_ImplicitCast) == 0x0005C0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_SetActorTickInterval_TickInterval_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_1) == 0x0005C4, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0005C8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0005D0, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VoiceSource_C_ExecuteUbergraph_VoiceSource, CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_2) == 0x0005D8, "Member 'VoiceSource_C_ExecuteUbergraph_VoiceSource::CallFunc_SetActorTickInterval_TickInterval_ImplicitCast_2' has a wrong offset!");

// Function VoiceSource.VoiceSource_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct VoiceSource_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceSource_C_ReceiveTick) == 0x000004, "Wrong alignment on VoiceSource_C_ReceiveTick");
static_assert(sizeof(VoiceSource_C_ReceiveTick) == 0x000004, "Wrong size on VoiceSource_C_ReceiveTick");
static_assert(offsetof(VoiceSource_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'VoiceSource_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

