#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceSource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass VoiceSource.VoiceSource_C
// 0x00A0 (0x0348 - 0x02A8)
class AVoiceSource_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Source;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Target_Location;                                   // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_Distance;                                   // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 Parent_Ref;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Last_Direction;                                    // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Last_Location;                                     // 0x02F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Path_Deviation;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Direct_Path;                                       // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Target_Deviation;                                  // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Target_Direction;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Deviation_Ratio;                                   // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta;                                             // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Distance_Factor;                                   // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Opti;                                              // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VoiceSource(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceSource_C">();
	}
	static class AVoiceSource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVoiceSource_C>();
	}
};
static_assert(alignof(AVoiceSource_C) == 0x000008, "Wrong alignment on AVoiceSource_C");
static_assert(sizeof(AVoiceSource_C) == 0x000348, "Wrong size on AVoiceSource_C");
static_assert(offsetof(AVoiceSource_C, UberGraphFrame) == 0x0002A8, "Member 'AVoiceSource_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Source) == 0x0002B0, "Member 'AVoiceSource_C::Source' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Root) == 0x0002B8, "Member 'AVoiceSource_C::Root' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Mec_Ref) == 0x0002C0, "Member 'AVoiceSource_C::Mec_Ref' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Target_Location) == 0x0002C8, "Member 'AVoiceSource_C::Target_Location' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Target_Distance) == 0x0002E0, "Member 'AVoiceSource_C::Target_Distance' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Active) == 0x0002E4, "Member 'AVoiceSource_C::Active' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Parent_Ref) == 0x0002E8, "Member 'AVoiceSource_C::Parent_Ref' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Last_Direction) == 0x0002F0, "Member 'AVoiceSource_C::Last_Direction' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Last_Location) == 0x0002F8, "Member 'AVoiceSource_C::Last_Location' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Path_Deviation) == 0x000310, "Member 'AVoiceSource_C::Path_Deviation' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Direct_Path) == 0x000318, "Member 'AVoiceSource_C::Direct_Path' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Target_Deviation) == 0x00031C, "Member 'AVoiceSource_C::Target_Deviation' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Target_Direction) == 0x000320, "Member 'AVoiceSource_C::Target_Direction' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Deviation_Ratio) == 0x000328, "Member 'AVoiceSource_C::Deviation_Ratio' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Delta) == 0x000330, "Member 'AVoiceSource_C::Delta' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Distance_Factor) == 0x000338, "Member 'AVoiceSource_C::Distance_Factor' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Debug) == 0x000340, "Member 'AVoiceSource_C::Debug' has a wrong offset!");
static_assert(offsetof(AVoiceSource_C, Opti) == 0x000341, "Member 'AVoiceSource_C::Opti' has a wrong offset!");

}

