#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Ammo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Ammo.W_Ammo_C
// 0x0058 (0x0328 - 0x02D0)
class UW_Ammo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AmmoTxt;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AmmoTxt_1;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AmmoTxt_2;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AmmoTxt_4;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AmmoTxt_5;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hidder;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RifleJauge;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Opacity;                                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_Ammo(int32 EntryPoint);
	void Refresh_Ammo();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Ammo_C">();
	}
	static class UW_Ammo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Ammo_C>();
	}
};
static_assert(alignof(UW_Ammo_C) == 0x000008, "Wrong alignment on UW_Ammo_C");
static_assert(sizeof(UW_Ammo_C) == 0x000328, "Wrong size on UW_Ammo_C");
static_assert(offsetof(UW_Ammo_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Ammo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, AmmoTxt) == 0x0002D8, "Member 'UW_Ammo_C::AmmoTxt' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, AmmoTxt_1) == 0x0002E0, "Member 'UW_Ammo_C::AmmoTxt_1' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, AmmoTxt_2) == 0x0002E8, "Member 'UW_Ammo_C::AmmoTxt_2' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, AmmoTxt_4) == 0x0002F0, "Member 'UW_Ammo_C::AmmoTxt_4' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, AmmoTxt_5) == 0x0002F8, "Member 'UW_Ammo_C::AmmoTxt_5' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, Hidder) == 0x000300, "Member 'UW_Ammo_C::Hidder' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, RifleJauge) == 0x000308, "Member 'UW_Ammo_C::RifleJauge' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, WidgetSwitcher) == 0x000310, "Member 'UW_Ammo_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, Mec_Ref) == 0x000318, "Member 'UW_Ammo_C::Mec_Ref' has a wrong offset!");
static_assert(offsetof(UW_Ammo_C, Opacity) == 0x000320, "Member 'UW_Ammo_C::Opacity' has a wrong offset!");

}

