#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AnalysisPC_UI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Str_ItemState_structs.hpp"


namespace SDK::Params
{

// Function W_AnalysisPC_UI.W_AnalysisPC_UI_C.Check Result
// 0x0010 (0x0010 - 0x0000)
struct W_AnalysisPC_UI_C_Check_Result final
{
public:
	TArray<bool>                                  List;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_AnalysisPC_UI_C_Check_Result) == 0x000008, "Wrong alignment on W_AnalysisPC_UI_C_Check_Result");
static_assert(sizeof(W_AnalysisPC_UI_C_Check_Result) == 0x000010, "Wrong size on W_AnalysisPC_UI_C_Check_Result");
static_assert(offsetof(W_AnalysisPC_UI_C_Check_Result, List) == 0x000000, "Member 'W_AnalysisPC_UI_C_Check_Result::List' has a wrong offset!");

// Function W_AnalysisPC_UI.W_AnalysisPC_UI_C.ExecuteUbergraph_W_AnalysisPC_UI
// 0x00F8 (0x00F8 - 0x0000)
struct W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStr_ItemState>                 K2Node_CustomEvent_Results;                        // 0x0078(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemState                         CallFunc_Array_Get_Item;                           // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  K2Node_CustomEvent_List;                           // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           K2Node_Select_Default;                             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           K2Node_Select_Default_1;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ProcessedRequest_C*                  K2Node_DynamicCast_AsW_Processed_Request;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ProcessedRequest_C*                  CallFunc_Create_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI) == 0x000008, "Wrong alignment on W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI");
static_assert(sizeof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI) == 0x0000F8, "Wrong size on W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, EntryPoint) == 0x000000, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Percent_IntInt_ReturnValue) == 0x000008, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, Temp_bool_Variable) == 0x00001C, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Divide_IntInt_ReturnValue) == 0x000020, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000028, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Divide_IntInt_ReturnValue_1) == 0x00002C, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000030, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_SelectInt_ReturnValue) == 0x000034, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, K2Node_Event_MyGeometry) == 0x000038, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, K2Node_Event_InDeltaTime) == 0x000070, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, K2Node_CustomEvent_Results) == 0x000078, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, Temp_int_Loop_Counter_Variable_1) == 0x000088, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Array_Get_Item) == 0x00008C, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, K2Node_CustomEvent_List) == 0x0000A0, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::K2Node_CustomEvent_List' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Array_Length_ReturnValue_1) == 0x0000B4, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B8, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, Temp_bool_Variable_1) == 0x0000B9, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, K2Node_Select_Default) == 0x0000C0, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_GetChildAt_ReturnValue) == 0x0000C8, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, K2Node_Select_Default_1) == 0x0000D0, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, K2Node_DynamicCast_AsW_Processed_Request) == 0x0000D8, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::K2Node_DynamicCast_AsW_Processed_Request' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_Create_ReturnValue) == 0x0000E8, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI, CallFunc_AddChild_ReturnValue) == 0x0000F0, "Member 'W_AnalysisPC_UI_C_ExecuteUbergraph_W_AnalysisPC_UI::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function W_AnalysisPC_UI.W_AnalysisPC_UI_C.Set List
// 0x0010 (0x0010 - 0x0000)
struct W_AnalysisPC_UI_C_Set_List final
{
public:
	TArray<struct FStr_ItemState>                 Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_AnalysisPC_UI_C_Set_List) == 0x000008, "Wrong alignment on W_AnalysisPC_UI_C_Set_List");
static_assert(sizeof(W_AnalysisPC_UI_C_Set_List) == 0x000010, "Wrong size on W_AnalysisPC_UI_C_Set_List");
static_assert(offsetof(W_AnalysisPC_UI_C_Set_List, Results) == 0x000000, "Member 'W_AnalysisPC_UI_C_Set_List::Results' has a wrong offset!");

// Function W_AnalysisPC_UI.W_AnalysisPC_UI_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_AnalysisPC_UI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AnalysisPC_UI_C_Tick) == 0x000004, "Wrong alignment on W_AnalysisPC_UI_C_Tick");
static_assert(sizeof(W_AnalysisPC_UI_C_Tick) == 0x00003C, "Wrong size on W_AnalysisPC_UI_C_Tick");
static_assert(offsetof(W_AnalysisPC_UI_C_Tick, MyGeometry) == 0x000000, "Member 'W_AnalysisPC_UI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_AnalysisPC_UI_C_Tick, InDeltaTime) == 0x000038, "Member 'W_AnalysisPC_UI_C_Tick::InDeltaTime' has a wrong offset!");

}

