#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AnalysisPC_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_AnalysisPC_UI.W_AnalysisPC_UI_C
// 0x0028 (0x02F8 - 0x02D0)
class UW_AnalysisPC_UI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           ListL;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ListR;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Truc;                                              // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Check_Result(const TArray<bool>& List);
	void Clear_List();
	void Construct();
	void ExecuteUbergraph_W_AnalysisPC_UI(int32 EntryPoint);
	void Set_List(const TArray<struct FStr_ItemState>& Results);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_AnalysisPC_UI_C">();
	}
	static class UW_AnalysisPC_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_AnalysisPC_UI_C>();
	}
};
static_assert(alignof(UW_AnalysisPC_UI_C) == 0x000008, "Wrong alignment on UW_AnalysisPC_UI_C");
static_assert(sizeof(UW_AnalysisPC_UI_C) == 0x0002F8, "Wrong size on UW_AnalysisPC_UI_C");
static_assert(offsetof(UW_AnalysisPC_UI_C, UberGraphFrame) == 0x0002D0, "Member 'UW_AnalysisPC_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_AnalysisPC_UI_C, ListL) == 0x0002D8, "Member 'UW_AnalysisPC_UI_C::ListL' has a wrong offset!");
static_assert(offsetof(UW_AnalysisPC_UI_C, ListR) == 0x0002E0, "Member 'UW_AnalysisPC_UI_C::ListR' has a wrong offset!");
static_assert(offsetof(UW_AnalysisPC_UI_C, TitleText) == 0x0002E8, "Member 'UW_AnalysisPC_UI_C::TitleText' has a wrong offset!");
static_assert(offsetof(UW_AnalysisPC_UI_C, Truc) == 0x0002F0, "Member 'UW_AnalysisPC_UI_C::Truc' has a wrong offset!");

}

