#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AudioSettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_AudioSettings.W_AudioSettings_C.BndEvt__W_AudioSettings_Slider_MicVolume_K2Node_ComponentBoundEvent_1_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_MicVolume_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_MicVolume_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong alignment on W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_MicVolume_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature");
static_assert(sizeof(W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_MicVolume_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong size on W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_MicVolume_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature");
static_assert(offsetof(W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_MicVolume_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature, Value) == 0x000000, "Member 'W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_MicVolume_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature::Value' has a wrong offset!");

// Function W_AudioSettings.W_AudioSettings_C.BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_0_On Value Change__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature) == 0x000008, "Wrong alignment on W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature");
static_assert(sizeof(W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature) == 0x000008, "Wrong size on W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature");
static_assert(offsetof(W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature, Value) == 0x000000, "Member 'W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature::Value' has a wrong offset!");

// Function W_AudioSettings.W_AudioSettings_C.BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_2_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong alignment on W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature");
static_assert(sizeof(W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong size on W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature");
static_assert(offsetof(W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature, Value) == 0x000000, "Member 'W_AudioSettings_C_BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature::Value' has a wrong offset!");

// Function W_AudioSettings.W_AudioSettings_C.ExecuteUbergraph_W_AudioSettings
// 0x0120 (0x0120 - 0x0000)
struct W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_2;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APC_C*                                  K2Node_DynamicCast_AsPC;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_1;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_Menu_C*>                      CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_Menu_C*                              CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Power_sign__Returne_Value;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Power_sign__Base_ImplicitCast;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings) == 0x000008, "Wrong alignment on W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings");
static_assert(sizeof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings) == 0x000120, "Wrong size on W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, EntryPoint) == 0x000000, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, K2Node_Event_MyGeometry) == 0x000004, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000040, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000048, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_MapRangeClamped_ReturnValue) == 0x000050, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, K2Node_ComponentBoundEvent_Value_2) == 0x000060, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, K2Node_DynamicCast_AsPC) == 0x000068, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::K2Node_DynamicCast_AsPC' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000078, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Round_ReturnValue) == 0x000080, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, K2Node_ComponentBoundEvent_Value_1) == 0x000090, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Round_ReturnValue_1) == 0x000098, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_SaveGameToSlot_ReturnValue) == 0x00009C, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, K2Node_ComponentBoundEvent_Value) == 0x0000A0, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Round_ReturnValue_2) == 0x0000A8, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0000B0, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_IsValid_ReturnValue_1) == 0x0000C9, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Power_sign__Returne_Value) == 0x0000D0, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Power_sign__Returne_Value' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_SelectColor_ReturnValue) == 0x0000EC, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000FC, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_SelectColor_ReturnValue_1) == 0x000100, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_Power_sign__Base_ImplicitCast) == 0x000110, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_Power_sign__Base_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000118, "Member 'W_AudioSettings_C_ExecuteUbergraph_W_AudioSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function W_AudioSettings.W_AudioSettings_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_AudioSettings_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioSettings_C_Tick) == 0x000004, "Wrong alignment on W_AudioSettings_C_Tick");
static_assert(sizeof(W_AudioSettings_C_Tick) == 0x00003C, "Wrong size on W_AudioSettings_C_Tick");
static_assert(offsetof(W_AudioSettings_C_Tick, MyGeometry) == 0x000000, "Member 'W_AudioSettings_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_AudioSettings_C_Tick, InDeltaTime) == 0x000038, "Member 'W_AudioSettings_C_Tick::InDeltaTime' has a wrong offset!");

}

