#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AudioSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_AudioSettings.W_AudioSettings_C
// 0x0050 (0x0320 - 0x02D0)
class UW_AudioSettings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Mic_JaugeOther;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Slider_C*                            Slider_MicVolume;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Slider_C*                            Slider_Volume;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Bannier_C*                           W_Bannier;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Bannier_C*                           W_Bannier_1;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APC_C*                                  PC_Ref;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               M_Other;                                           // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               M_Mic;                                             // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USave_Settings_C*                       Save_Ref;                                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_AudioSettings_Slider_MicVolume_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature(double Value);
	void BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature(double Value);
	void BndEvt__W_AudioSettings_Slider_Volume_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature(double Value);
	void Construct();
	void ExecuteUbergraph_W_AudioSettings(int32 EntryPoint);
	void On_Open();
	void Save_Settings();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_AudioSettings_C">();
	}
	static class UW_AudioSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_AudioSettings_C>();
	}
};
static_assert(alignof(UW_AudioSettings_C) == 0x000008, "Wrong alignment on UW_AudioSettings_C");
static_assert(sizeof(UW_AudioSettings_C) == 0x000320, "Wrong size on UW_AudioSettings_C");
static_assert(offsetof(UW_AudioSettings_C, UberGraphFrame) == 0x0002D0, "Member 'UW_AudioSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_AudioSettings_C, Mic_JaugeOther) == 0x0002D8, "Member 'UW_AudioSettings_C::Mic_JaugeOther' has a wrong offset!");
static_assert(offsetof(UW_AudioSettings_C, Slider_MicVolume) == 0x0002E0, "Member 'UW_AudioSettings_C::Slider_MicVolume' has a wrong offset!");
static_assert(offsetof(UW_AudioSettings_C, Slider_Volume) == 0x0002E8, "Member 'UW_AudioSettings_C::Slider_Volume' has a wrong offset!");
static_assert(offsetof(UW_AudioSettings_C, W_Bannier) == 0x0002F0, "Member 'UW_AudioSettings_C::W_Bannier' has a wrong offset!");
static_assert(offsetof(UW_AudioSettings_C, W_Bannier_1) == 0x0002F8, "Member 'UW_AudioSettings_C::W_Bannier_1' has a wrong offset!");
static_assert(offsetof(UW_AudioSettings_C, PC_Ref) == 0x000300, "Member 'UW_AudioSettings_C::PC_Ref' has a wrong offset!");
static_assert(offsetof(UW_AudioSettings_C, M_Other) == 0x000308, "Member 'UW_AudioSettings_C::M_Other' has a wrong offset!");
static_assert(offsetof(UW_AudioSettings_C, M_Mic) == 0x000310, "Member 'UW_AudioSettings_C::M_Mic' has a wrong offset!");
static_assert(offsetof(UW_AudioSettings_C, Save_Ref) == 0x000318, "Member 'UW_AudioSettings_C::Save_Ref' has a wrong offset!");

}

