#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BarPart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BarPart.W_BarPart_C
// 0x0070 (0x0340 - 0x02D0)
class UW_BarPart_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowBackground;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Trigger_C*                           W_Trigger;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              On_Pressed;                                        // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UW_Menu_C*                              Menu;                                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainBar_C*                           Bar_Ref;                                           // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Button_W_Trigger_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature();
	void BndEvt__W_Button_W_Trigger_K2Node_ComponentBoundEvent_2_On_Enter__DelegateSignature();
	void BndEvt__W_Button_W_Trigger_K2Node_ComponentBoundEvent_3_On_Leave__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_BarPart(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Select(bool TRUE_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BarPart_C">();
	}
	static class UW_BarPart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BarPart_C>();
	}
};
static_assert(alignof(UW_BarPart_C) == 0x000008, "Wrong alignment on UW_BarPart_C");
static_assert(sizeof(UW_BarPart_C) == 0x000340, "Wrong size on UW_BarPart_C");
static_assert(offsetof(UW_BarPart_C, UberGraphFrame) == 0x0002D0, "Member 'UW_BarPart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, ShowBackground) == 0x0002D8, "Member 'UW_BarPart_C::ShowBackground' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, Background) == 0x0002E0, "Member 'UW_BarPart_C::Background' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, ButtonText) == 0x0002E8, "Member 'UW_BarPart_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, W_Trigger) == 0x0002F0, "Member 'UW_BarPart_C::W_Trigger' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, Hovered) == 0x0002F8, "Member 'UW_BarPart_C::Hovered' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, On_Pressed) == 0x000300, "Member 'UW_BarPart_C::On_Pressed' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, Menu) == 0x000310, "Member 'UW_BarPart_C::Menu' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, Text) == 0x000318, "Member 'UW_BarPart_C::Text' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, Index_0) == 0x000328, "Member 'UW_BarPart_C::Index_0' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, Bar_Ref) == 0x000330, "Member 'UW_BarPart_C::Bar_Ref' has a wrong offset!");
static_assert(offsetof(UW_BarPart_C, Selected) == 0x000338, "Member 'UW_BarPart_C::Selected' has a wrong offset!");

}

