#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BlackList

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_BlackList.W_BlackList_C.ExecuteUbergraph_W_BlackList
// 0x01F0 (0x01F0 - 0x0000)
struct W_BlackList_C_ExecuteUbergraph_W_BlackList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PlayerFromList_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_C*                                  K2Node_DynamicCast_AsGM_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0138(0x0010)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_Menu_C*>                      CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0150(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMainGI_C*                              K2Node_DynamicCast_AsMain_GI;                      // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Menu_C*                              CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APC_C*>                          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0188(0x0010)(ReferenceParm)
	class APC_C*                                  CallFunc_Array_Get_Item_1;                         // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM_2;                         // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BlackList_C_ExecuteUbergraph_W_BlackList) == 0x000008, "Wrong alignment on W_BlackList_C_ExecuteUbergraph_W_BlackList");
static_assert(sizeof(W_BlackList_C_ExecuteUbergraph_W_BlackList) == 0x0001F0, "Wrong size on W_BlackList_C_ExecuteUbergraph_W_BlackList");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, EntryPoint) == 0x000000, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Create_ReturnValue) == 0x000018, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, Temp_int_Array_Index_Variable) == 0x000020, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_GetGameMode_ReturnValue) == 0x000028, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_AsGM) == 0x000030, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_GetGameMode_ReturnValue_1) == 0x000040, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_AsGM_1) == 0x000050, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_AsGM_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000060, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_MakeArray_Array) == 0x0000B0, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000D8, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_MakeArray_Array_1) == 0x000128, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Format_ReturnValue_1) == 0x000138, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_GetGameInstance_ReturnValue) == 0x000148, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000150, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_AsMain_GI) == 0x000160, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_AsMain_GI' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Array_Get_Item) == 0x000170, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000178, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_GetAllActorsOfClass_OutActors) == 0x000188, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Array_Get_Item_1) == 0x000198, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_K2_GetPawn_ReturnValue) == 0x0001A0, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Array_Length_ReturnValue_2) == 0x0001A8, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_AsMec) == 0x0001B0, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_bSuccess_3) == 0x0001B8, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0001C0, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, Temp_int_Loop_Counter_Variable) == 0x0001C8, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Less_IntInt_ReturnValue) == 0x0001CC, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_Add_IntInt_ReturnValue) == 0x0001D0, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_GetGameMode_ReturnValue_2) == 0x0001D8, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_GetGameMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_AsGM_2) == 0x0001E0, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_AsGM_2' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, K2Node_DynamicCast_bSuccess_4) == 0x0001E8, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_BlackList_C_ExecuteUbergraph_W_BlackList, CallFunc_SaveGameToSlot_ReturnValue) == 0x0001E9, "Member 'W_BlackList_C_ExecuteUbergraph_W_BlackList::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

}

