#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BlackList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BlackList.W_BlackList_C
// 0x0060 (0x0330 - 0x02D0)
class UW_BlackList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           ClientSide;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HostSide;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PlayerList;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            W_ResetBanList;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APC_C*                                  PC_Ref;                                            // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                GI_Ref;                                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Search;                                        // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainGI_C*                              As_Main_GI;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  GM_Ref;                                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_BlackList_W_ResetBanList_K2Node_ComponentBoundEvent_5_On_Pressed__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_BlackList(int32 EntryPoint);
	void On_Open();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BlackList_C">();
	}
	static class UW_BlackList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BlackList_C>();
	}
};
static_assert(alignof(UW_BlackList_C) == 0x000008, "Wrong alignment on UW_BlackList_C");
static_assert(sizeof(UW_BlackList_C) == 0x000330, "Wrong size on UW_BlackList_C");
static_assert(offsetof(UW_BlackList_C, UberGraphFrame) == 0x0002D0, "Member 'UW_BlackList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, ClientSide) == 0x0002D8, "Member 'UW_BlackList_C::ClientSide' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, HostSide) == 0x0002E0, "Member 'UW_BlackList_C::HostSide' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, PlayerList) == 0x0002E8, "Member 'UW_BlackList_C::PlayerList' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, TextBlock) == 0x0002F0, "Member 'UW_BlackList_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, W_ResetBanList) == 0x0002F8, "Member 'UW_BlackList_C::W_ResetBanList' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, WidgetSwitcher_0) == 0x000300, "Member 'UW_BlackList_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, PC_Ref) == 0x000308, "Member 'UW_BlackList_C::PC_Ref' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, GI_Ref) == 0x000310, "Member 'UW_BlackList_C::GI_Ref' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, Can_Search) == 0x000318, "Member 'UW_BlackList_C::Can_Search' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, As_Main_GI) == 0x000320, "Member 'UW_BlackList_C::As_Main_GI' has a wrong offset!");
static_assert(offsetof(UW_BlackList_C, GM_Ref) == 0x000328, "Member 'UW_BlackList_C::GM_Ref' has a wrong offset!");

}

