#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BottumScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BottumScreen.W_BottumScreen_C
// 0x0078 (0x0348 - 0x02D0)
class UW_BottumScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_InputInfo_C*                         InputInfo;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mic_Logo;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryText;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SecondaryText;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SecondaryInfo_C*                     W_SecondaryInfo;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delta;                                             // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Primary_Opacity;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Secondary_Opacity;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Jauge_M;                                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Jauge_M_2;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Mic_Open;                                          // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Mic_Flash;                                         // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double Mic_Volume)> Microphone_Sensitivity;                        // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_W_BottumScreen(int32 EntryPoint);
	void Set_Mic_State(bool Open);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BottumScreen_C">();
	}
	static class UW_BottumScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BottumScreen_C>();
	}
};
static_assert(alignof(UW_BottumScreen_C) == 0x000008, "Wrong alignment on UW_BottumScreen_C");
static_assert(sizeof(UW_BottumScreen_C) == 0x000348, "Wrong size on UW_BottumScreen_C");
static_assert(offsetof(UW_BottumScreen_C, UberGraphFrame) == 0x0002D0, "Member 'UW_BottumScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, InputInfo) == 0x0002D8, "Member 'UW_BottumScreen_C::InputInfo' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Mic_Logo) == 0x0002E0, "Member 'UW_BottumScreen_C::Mic_Logo' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, PrimaryText) == 0x0002E8, "Member 'UW_BottumScreen_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, SecondaryText) == 0x0002F0, "Member 'UW_BottumScreen_C::SecondaryText' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, W_SecondaryInfo) == 0x0002F8, "Member 'UW_BottumScreen_C::W_SecondaryInfo' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Mec_Ref) == 0x000300, "Member 'UW_BottumScreen_C::Mec_Ref' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Delta) == 0x000308, "Member 'UW_BottumScreen_C::Delta' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Primary_Opacity) == 0x000310, "Member 'UW_BottumScreen_C::Primary_Opacity' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Secondary_Opacity) == 0x000318, "Member 'UW_BottumScreen_C::Secondary_Opacity' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Jauge_M) == 0x000320, "Member 'UW_BottumScreen_C::Jauge_M' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Jauge_M_2) == 0x000328, "Member 'UW_BottumScreen_C::Jauge_M_2' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Mic_Open) == 0x000330, "Member 'UW_BottumScreen_C::Mic_Open' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Mic_Flash) == 0x000334, "Member 'UW_BottumScreen_C::Mic_Flash' has a wrong offset!");
static_assert(offsetof(UW_BottumScreen_C, Microphone_Sensitivity) == 0x000338, "Member 'UW_BottumScreen_C::Microphone_Sensitivity' has a wrong offset!");

}

