#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BottumScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_BottumScreen.W_BottumScreen_C.ExecuteUbergraph_W_BottumScreen
// 0x0290 (0x0290 - 0x0000)
struct W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Fraction_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_SelectObject_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0040(0x00B0)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_2;            // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue_1;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Open;                           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x01DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_ReturnValue_2;         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_3;            // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast_1; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast_1;     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast_1;     // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast_2;     // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast_2; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast;  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Mic_Flash_ImplicitCast;         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen) == 0x000010, "Wrong alignment on W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen");
static_assert(sizeof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen) == 0x000290, "Wrong size on W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, EntryPoint) == 0x000000, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_Fraction_ReturnValue) == 0x000010, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_LinearColorLerp_ReturnValue) == 0x000028, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SelectObject_ReturnValue) == 0x000038, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SelectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, K2Node_MakeStruct_SlateBrush) == 0x000040, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, K2Node_Event_MyGeometry) == 0x0000F0, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, K2Node_Event_InDeltaTime) == 0x000128, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SelectFloat_ReturnValue) == 0x000130, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SelectFloat_ReturnValue_1) == 0x000138, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000140, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000148, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SelectFloat_ReturnValue_2) == 0x000158, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SelectFloat_ReturnValue_3) == 0x000160, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x000168, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000169, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00016A, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_MapRangeClamped_ReturnValue) == 0x000170, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000178, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000180, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x000188, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_LinearColorLerp_ReturnValue_1) == 0x000190, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_LinearColorLerp_ReturnValue_2) == 0x0001A0, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_LinearColorLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_FInterpTo_Constant_ReturnValue_1) == 0x0001B0, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_FInterpTo_Constant_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SelectColor_ReturnValue) == 0x0001B8, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SelectColor_ReturnValue_1) == 0x0001C8, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, K2Node_CustomEvent_Open) == 0x0001D8, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::K2Node_CustomEvent_Open' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SelectColor_ReturnValue_2) == 0x0001DC, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x0001EC, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_FInterpTo_Constant_ReturnValue_2) == 0x0001F0, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_FInterpTo_Constant_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SelectColor_ReturnValue_3) == 0x0001F8, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SelectColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_LinearColorLerp_ReturnValue_3) == 0x000208, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_LinearColorLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000218, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_LinearColorLerp_Alpha_ImplicitCast) == 0x00021C, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_LinearColorLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x000220, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x000228, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast) == 0x000230, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast_1) == 0x000238, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000240, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_MapRangeClamped_Value_ImplicitCast_1) == 0x000248, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_MapRangeClamped_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000250, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000258, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_LinearColorLerp_Alpha_ImplicitCast_1) == 0x000260, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_LinearColorLerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_LinearColorLerp_Alpha_ImplicitCast_2) == 0x000264, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_LinearColorLerp_Alpha_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x000268, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast_2) == 0x000270, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, CallFunc_FInterpTo_Constant_Current_ImplicitCast) == 0x000278, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::CallFunc_FInterpTo_Constant_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen, K2Node_VariableSet_Mic_Flash_ImplicitCast) == 0x000280, "Member 'W_BottumScreen_C_ExecuteUbergraph_W_BottumScreen::K2Node_VariableSet_Mic_Flash_ImplicitCast' has a wrong offset!");

// Function W_BottumScreen.W_BottumScreen_C.Set Mic State
// 0x0001 (0x0001 - 0x0000)
struct W_BottumScreen_C_Set_Mic_State final
{
public:
	bool                                          Open;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BottumScreen_C_Set_Mic_State) == 0x000001, "Wrong alignment on W_BottumScreen_C_Set_Mic_State");
static_assert(sizeof(W_BottumScreen_C_Set_Mic_State) == 0x000001, "Wrong size on W_BottumScreen_C_Set_Mic_State");
static_assert(offsetof(W_BottumScreen_C_Set_Mic_State, Open) == 0x000000, "Member 'W_BottumScreen_C_Set_Mic_State::Open' has a wrong offset!");

// Function W_BottumScreen.W_BottumScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_BottumScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BottumScreen_C_Tick) == 0x000004, "Wrong alignment on W_BottumScreen_C_Tick");
static_assert(sizeof(W_BottumScreen_C_Tick) == 0x00003C, "Wrong size on W_BottumScreen_C_Tick");
static_assert(offsetof(W_BottumScreen_C_Tick, MyGeometry) == 0x000000, "Member 'W_BottumScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_BottumScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'W_BottumScreen_C_Tick::InDeltaTime' has a wrong offset!");

}

