#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Button.W_Button_C
// 0x0090 (0x0360 - 0x02D0)
class UW_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowBackground;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LargeText;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Trigger_C*                           W_Trigger;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              On_Pressed;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UW_Menu_C*                              Parent;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Width;                                             // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Large;                                             // 0x033C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Press_Color;                                       // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__W_Button_W_Trigger_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature();
	void BndEvt__W_Button_W_Trigger_K2Node_ComponentBoundEvent_2_On_Enter__DelegateSignature();
	void BndEvt__W_Button_W_Trigger_K2Node_ComponentBoundEvent_3_On_Leave__DelegateSignature();
	void ExecuteUbergraph_W_Button(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Button_C">();
	}
	static class UW_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Button_C>();
	}
};
static_assert(alignof(UW_Button_C) == 0x000008, "Wrong alignment on UW_Button_C");
static_assert(sizeof(UW_Button_C) == 0x000360, "Wrong size on UW_Button_C");
static_assert(offsetof(UW_Button_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Button_C, ShowBackground) == 0x0002D8, "Member 'UW_Button_C::ShowBackground' has a wrong offset!");
static_assert(offsetof(UW_Button_C, Background) == 0x0002E0, "Member 'UW_Button_C::Background' has a wrong offset!");
static_assert(offsetof(UW_Button_C, ButtonText) == 0x0002E8, "Member 'UW_Button_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UW_Button_C, LargeText) == 0x0002F0, "Member 'UW_Button_C::LargeText' has a wrong offset!");
static_assert(offsetof(UW_Button_C, SizeBox) == 0x0002F8, "Member 'UW_Button_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UW_Button_C, W_Trigger) == 0x000300, "Member 'UW_Button_C::W_Trigger' has a wrong offset!");
static_assert(offsetof(UW_Button_C, Hovered) == 0x000308, "Member 'UW_Button_C::Hovered' has a wrong offset!");
static_assert(offsetof(UW_Button_C, On_Pressed) == 0x000310, "Member 'UW_Button_C::On_Pressed' has a wrong offset!");
static_assert(offsetof(UW_Button_C, Parent) == 0x000320, "Member 'UW_Button_C::Parent' has a wrong offset!");
static_assert(offsetof(UW_Button_C, Text) == 0x000328, "Member 'UW_Button_C::Text' has a wrong offset!");
static_assert(offsetof(UW_Button_C, Width) == 0x000338, "Member 'UW_Button_C::Width' has a wrong offset!");
static_assert(offsetof(UW_Button_C, Large) == 0x00033C, "Member 'UW_Button_C::Large' has a wrong offset!");
static_assert(offsetof(UW_Button_C, Color) == 0x000340, "Member 'UW_Button_C::Color' has a wrong offset!");
static_assert(offsetof(UW_Button_C, Press_Color) == 0x000350, "Member 'UW_Button_C::Press_Color' has a wrong offset!");

}

