#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_Button.W_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Button_C_PreConstruct) == 0x000001, "Wrong alignment on W_Button_C_PreConstruct");
static_assert(sizeof(W_Button_C_PreConstruct) == 0x000001, "Wrong size on W_Button_C_PreConstruct");
static_assert(offsetof(W_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Button.W_Button_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Button_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Button_C_Tick) == 0x000004, "Wrong alignment on W_Button_C_Tick");
static_assert(sizeof(W_Button_C_Tick) == 0x00003C, "Wrong size on W_Button_C_Tick");
static_assert(offsetof(W_Button_C_Tick, MyGeometry) == 0x000000, "Member 'W_Button_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Button_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Button_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_Button.W_Button_C.ExecuteUbergraph_W_Button
// 0x0100 (0x0100 - 0x0000)
struct W_Button_C_ExecuteUbergraph_W_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_Menu_C*>                      CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_Menu_C*                              CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0010)()
	double                                        CallFunc_Delta__;                                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_LinearColorLinearColor_ReturnValue; // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Delta___1;                                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_CInterpTo_ReturnValue;                    // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CInterpTo_DeltaTime_ImplicitCast;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Button_C_ExecuteUbergraph_W_Button) == 0x000008, "Wrong alignment on W_Button_C_ExecuteUbergraph_W_Button");
static_assert(sizeof(W_Button_C_ExecuteUbergraph_W_Button) == 0x000100, "Wrong size on W_Button_C_ExecuteUbergraph_W_Button");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, EntryPoint) == 0x000000, "Member 'W_Button_C_ExecuteUbergraph_W_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, K2Node_Event_InDeltaTime) == 0x000040, "Member 'W_Button_C_ExecuteUbergraph_W_Button::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000048, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_Array_Get_Item) == 0x000058, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_Delta__) == 0x000078, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_Delta__' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_GetRenderOpacity_ReturnValue) == 0x000080, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_SelectFloat_ReturnValue) == 0x000088, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000090, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000098, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_SelectFloat_ReturnValue_1) == 0x0000A0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_FInterpTo_ReturnValue) == 0x0000A8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_SelectFloat_ReturnValue_2) == 0x0000B0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x0000B8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000BC, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_NotEqual_LinearColorLinearColor_ReturnValue) == 0x0000BD, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_NotEqual_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_Delta___1) == 0x0000C0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_Delta___1' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_CInterpTo_ReturnValue) == 0x0000C8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_CInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_FInterpTo_Current_ImplicitCast) == 0x0000D8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000E0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0000E8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0000EC, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x0000F0, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Button_C_ExecuteUbergraph_W_Button, CallFunc_CInterpTo_DeltaTime_ImplicitCast) == 0x0000F8, "Member 'W_Button_C_ExecuteUbergraph_W_Button::CallFunc_CInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

}

