#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Buff

#include "Basic.hpp"

#include "E_ConsumableType_structs.hpp"
#include "Engine_structs.hpp"
#include "E_ItemType_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Buff.W_Buff_C
// 0x0060 (0x0330 - 0x02D0)
class UW_Buff_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DeleteBox;                                         // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpawnBox;                                          // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             buffname_txt;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             time_txt;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuff_C*                                Buff_Ref;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Time;                                              // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Elevation;                                         // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PlayerState_C*                       Parent_Ref;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Spawn;                                             // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override;                                          // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Previous_Level;                                    // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FLinearColor Color_Level(const struct FLinearColor& _2, const struct FLinearColor& _1, const struct FLinearColor& One, const struct FLinearColor& Two);
	void Color_State(const struct FLinearColor& Heal, const struct FLinearColor& Speed, const struct FLinearColor& Armor, const struct FLinearColor& Sneak, struct FLinearColor* Value);
	void Color_Type(const struct FLinearColor& Seringe, const struct FLinearColor& Bottle, const struct FLinearColor& Grenade, struct FLinearColor* Value);
	void Construct();
	void Delete();
	void ExecuteUbergraph_W_Buff(int32 EntryPoint);
	void Full_Update();
	class FString Name_Level(const class FString& _2, const class FString& _1, const class FString& One, const class FString& Two);
	void Name_State(const class FString& Heal, const class FString& Speed, const class FString& Armor, const class FString& Sneak, class FString* Value);
	void Name_Type(const class FString& Seringe, const class FString& Bottle, const class FString& Grenade, class FString* Value);
	void Refresh();
	void Select_Name(class FString* Value);
	void Set_Color();
	void Set_Elevation(int32 Elevation_0);
	void Set_Time_Text();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Time_Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Buff_C">();
	}
	static class UW_Buff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Buff_C>();
	}
};
static_assert(alignof(UW_Buff_C) == 0x000008, "Wrong alignment on UW_Buff_C");
static_assert(sizeof(UW_Buff_C) == 0x000330, "Wrong size on UW_Buff_C");
static_assert(offsetof(UW_Buff_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Buff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, DeleteBox) == 0x0002D8, "Member 'UW_Buff_C::DeleteBox' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, SpawnBox) == 0x0002E0, "Member 'UW_Buff_C::SpawnBox' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Border) == 0x0002E8, "Member 'UW_Buff_C::Border' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, buffname_txt) == 0x0002F0, "Member 'UW_Buff_C::buffname_txt' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, time_txt) == 0x0002F8, "Member 'UW_Buff_C::time_txt' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Buff_Ref) == 0x000300, "Member 'UW_Buff_C::Buff_Ref' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Time) == 0x000308, "Member 'UW_Buff_C::Time' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Elevation) == 0x00030C, "Member 'UW_Buff_C::Elevation' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Mec_Ref) == 0x000310, "Member 'UW_Buff_C::Mec_Ref' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Active) == 0x000318, "Member 'UW_Buff_C::Active' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Parent_Ref) == 0x000320, "Member 'UW_Buff_C::Parent_Ref' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Spawn) == 0x000328, "Member 'UW_Buff_C::Spawn' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Override) == 0x000329, "Member 'UW_Buff_C::Override' has a wrong offset!");
static_assert(offsetof(UW_Buff_C, Previous_Level) == 0x00032C, "Member 'UW_Buff_C::Previous_Level' has a wrong offset!");

}

