#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CameraSector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CameraSector.W_CameraSector_C
// 0x0030 (0x0300 - 0x02D0)
class UW_CameraSector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_20;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Select;                                            // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_CameraSector(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CameraSector_C">();
	}
	static class UW_CameraSector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CameraSector_C>();
	}
};
static_assert(alignof(UW_CameraSector_C) == 0x000008, "Wrong alignment on UW_CameraSector_C");
static_assert(sizeof(UW_CameraSector_C) == 0x000300, "Wrong size on UW_CameraSector_C");
static_assert(offsetof(UW_CameraSector_C, UberGraphFrame) == 0x0002D0, "Member 'UW_CameraSector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CameraSector_C, Border_0) == 0x0002D8, "Member 'UW_CameraSector_C::Border_0' has a wrong offset!");
static_assert(offsetof(UW_CameraSector_C, TextBlock_20) == 0x0002E0, "Member 'UW_CameraSector_C::TextBlock_20' has a wrong offset!");
static_assert(offsetof(UW_CameraSector_C, Name_0) == 0x0002E8, "Member 'UW_CameraSector_C::Name_0' has a wrong offset!");
static_assert(offsetof(UW_CameraSector_C, Select) == 0x0002F8, "Member 'UW_CameraSector_C::Select' has a wrong offset!");

}

