#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CustomMenuTabs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_SkinElement_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CustomMenuTabs.W_CustomMenuTabs_C
// 0x0030 (0x0300 - 0x02D0)
class UW_CustomMenuTabs_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBox;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(Enum_SkinElement Type)> Select_Tab;                                // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<Enum_SkinElement>                      Tabs;                                              // 0x02F0(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_W_CustomMenuTabs(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Request_Tab(Enum_SkinElement Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CustomMenuTabs_C">();
	}
	static class UW_CustomMenuTabs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CustomMenuTabs_C>();
	}
};
static_assert(alignof(UW_CustomMenuTabs_C) == 0x000008, "Wrong alignment on UW_CustomMenuTabs_C");
static_assert(sizeof(UW_CustomMenuTabs_C) == 0x000300, "Wrong size on UW_CustomMenuTabs_C");
static_assert(offsetof(UW_CustomMenuTabs_C, UberGraphFrame) == 0x0002D0, "Member 'UW_CustomMenuTabs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CustomMenuTabs_C, VerticalBox) == 0x0002D8, "Member 'UW_CustomMenuTabs_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UW_CustomMenuTabs_C, Select_Tab) == 0x0002E0, "Member 'UW_CustomMenuTabs_C::Select_Tab' has a wrong offset!");
static_assert(offsetof(UW_CustomMenuTabs_C, Tabs) == 0x0002F0, "Member 'UW_CustomMenuTabs_C::Tabs' has a wrong offset!");

}

