#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DataPC_Underscore_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_DataPC_Underscore_UI.W_DataPC_Underscore_UI_C.ExecuteUbergraph_W_DataPC_Underscore_UI
// 0x0030 (0x0030 - 0x0000)
struct W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI) == 0x000008, "Wrong alignment on W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI");
static_assert(sizeof(W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI) == 0x000030, "Wrong size on W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI");
static_assert(offsetof(W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI, EntryPoint) == 0x000000, "Member 'W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI, Temp_bool_Variable) == 0x000004, "Member 'W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x00002C, "Member 'W_DataPC_Underscore_UI_C_ExecuteUbergraph_W_DataPC_Underscore_UI::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

}

