#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DataPC_UI

#include "Basic.hpp"

#include "E_DataPC_State_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Str_ItemSpawnLocation_structs.hpp"
#include "Enum_Sectors_structs.hpp"


namespace SDK::Params
{

// Function W_DataPC_UI.W_DataPC_UI_C.Draw Message
// 0x0020 (0x0020 - 0x0000)
struct W_DataPC_UI_C_Draw_Message final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DataPC_UI_C_Draw_Message) == 0x000008, "Wrong alignment on W_DataPC_UI_C_Draw_Message");
static_assert(sizeof(W_DataPC_UI_C_Draw_Message) == 0x000020, "Wrong size on W_DataPC_UI_C_Draw_Message");
static_assert(offsetof(W_DataPC_UI_C_Draw_Message, Message) == 0x000000, "Member 'W_DataPC_UI_C_Draw_Message::Message' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_Draw_Message, Color) == 0x000010, "Member 'W_DataPC_UI_C_Draw_Message::Color' has a wrong offset!");

// Function W_DataPC_UI.W_DataPC_UI_C.ExecuteUbergraph_W_DataPC_UI
// 0x0170 (0x0170 - 0x0000)
struct W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_DataPC_Underscore_UI_C*              CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Sectors                                  Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_6;                            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_7;                            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DataPC_State                                K2Node_CustomEvent_State;                          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Value;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Room;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_DataPC_Message_UI_C*                 CallFunc_Create_ReturnValue_1;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStr_ItemSpawnLocation                 K2Node_CustomEvent_Location;                       // 0x00E8(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0160(0x0010)()
};
static_assert(alignof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI) == 0x000008, "Wrong alignment on W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI");
static_assert(sizeof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI) == 0x000170, "Wrong size on W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, EntryPoint) == 0x000000, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, Temp_byte_Variable) == 0x000011, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, Temp_string_Variable) == 0x000018, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, Temp_string_Variable_1) == 0x000028, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, Temp_string_Variable_2) == 0x000038, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, Temp_string_Variable_3) == 0x000048, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, Temp_string_Variable_4) == 0x000058, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, Temp_string_Variable_5) == 0x000068, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, Temp_string_Variable_6) == 0x000078, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::Temp_string_Variable_6' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, Temp_string_Variable_7) == 0x000088, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::Temp_string_Variable_7' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, K2Node_Event_IsDesignTime) == 0x000098, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, K2Node_CustomEvent_State) == 0x000099, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, K2Node_CustomEvent_Value) == 0x00009C, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, K2Node_CustomEvent_Room) == 0x0000A0, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::K2Node_CustomEvent_Room' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, K2Node_CustomEvent_Message) == 0x0000A8, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, K2Node_CustomEvent_Color) == 0x0000B8, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_Create_ReturnValue_1) == 0x0000C8, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_AddChild_ReturnValue) == 0x0000D0, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_RemoveChild_ReturnValue) == 0x0000D8, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_AddChild_ReturnValue_1) == 0x0000E0, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, K2Node_CustomEvent_Location) == 0x0000E8, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_Greater_ByteByte_ReturnValue) == 0x0000EA, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_GetChildrenCount_ReturnValue) == 0x0000EC, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_Conv_ByteToString_ReturnValue) == 0x0000F0, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_Greater_IntInt_ReturnValue) == 0x000100, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_Concat_StrStr_ReturnValue) == 0x000108, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_SelectString_ReturnValue) == 0x000118, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, K2Node_Select_Default) == 0x000128, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_RemoveChildAt_ReturnValue) == 0x000138, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000140, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000150, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI, CallFunc_Conv_StringToText_ReturnValue) == 0x000160, "Member 'W_DataPC_UI_C_ExecuteUbergraph_W_DataPC_UI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_DataPC_UI.W_DataPC_UI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_DataPC_UI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DataPC_UI_C_PreConstruct) == 0x000001, "Wrong alignment on W_DataPC_UI_C_PreConstruct");
static_assert(sizeof(W_DataPC_UI_C_PreConstruct) == 0x000001, "Wrong size on W_DataPC_UI_C_PreConstruct");
static_assert(offsetof(W_DataPC_UI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_DataPC_UI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_DataPC_UI.W_DataPC_UI_C.Set Index
// 0x0002 (0x0002 - 0x0000)
struct W_DataPC_UI_C_Set_Index final
{
public:
	struct FStr_ItemSpawnLocation                 Location;                                          // 0x0000(0x0002)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DataPC_UI_C_Set_Index) == 0x000001, "Wrong alignment on W_DataPC_UI_C_Set_Index");
static_assert(sizeof(W_DataPC_UI_C_Set_Index) == 0x000002, "Wrong size on W_DataPC_UI_C_Set_Index");
static_assert(offsetof(W_DataPC_UI_C_Set_Index, Location) == 0x000000, "Member 'W_DataPC_UI_C_Set_Index::Location' has a wrong offset!");

// Function W_DataPC_UI.W_DataPC_UI_C.Set Partner
// 0x0004 (0x0004 - 0x0000)
struct W_DataPC_UI_C_Set_Partner final
{
public:
	int32                                         Room;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DataPC_UI_C_Set_Partner) == 0x000004, "Wrong alignment on W_DataPC_UI_C_Set_Partner");
static_assert(sizeof(W_DataPC_UI_C_Set_Partner) == 0x000004, "Wrong size on W_DataPC_UI_C_Set_Partner");
static_assert(offsetof(W_DataPC_UI_C_Set_Partner, Room) == 0x000000, "Member 'W_DataPC_UI_C_Set_Partner::Room' has a wrong offset!");

// Function W_DataPC_UI.W_DataPC_UI_C.Set Screen
// 0x0008 (0x0008 - 0x0000)
struct W_DataPC_UI_C_Set_Screen final
{
public:
	E_DataPC_State                                State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DataPC_UI_C_Set_Screen) == 0x000004, "Wrong alignment on W_DataPC_UI_C_Set_Screen");
static_assert(sizeof(W_DataPC_UI_C_Set_Screen) == 0x000008, "Wrong size on W_DataPC_UI_C_Set_Screen");
static_assert(offsetof(W_DataPC_UI_C_Set_Screen, State) == 0x000000, "Member 'W_DataPC_UI_C_Set_Screen::State' has a wrong offset!");
static_assert(offsetof(W_DataPC_UI_C_Set_Screen, Value) == 0x000004, "Member 'W_DataPC_UI_C_Set_Screen::Value' has a wrong offset!");

}

