#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DebugSpawnItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DebugSpawnItem.W_DebugSpawnItem_C
// 0x0048 (0x0318 - 0x02D0)
class UW_DebugSpawnItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                color_border;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txt_color;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        FPS;                                               // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APC_C*                                  Player_Ref;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delta;                                             // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Second_Time;                                       // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Add_Padding();
	void Construct();
	void ExecuteUbergraph_W_DebugSpawnItem(int32 EntryPoint);
	void Select(bool Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_DebugSpawnItem_C">();
	}
	static class UW_DebugSpawnItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DebugSpawnItem_C>();
	}
};
static_assert(alignof(UW_DebugSpawnItem_C) == 0x000008, "Wrong alignment on UW_DebugSpawnItem_C");
static_assert(sizeof(UW_DebugSpawnItem_C) == 0x000318, "Wrong size on UW_DebugSpawnItem_C");
static_assert(offsetof(UW_DebugSpawnItem_C, UberGraphFrame) == 0x0002D0, "Member 'UW_DebugSpawnItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawnItem_C, Border_0) == 0x0002D8, "Member 'UW_DebugSpawnItem_C::Border_0' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawnItem_C, color_border) == 0x0002E0, "Member 'UW_DebugSpawnItem_C::color_border' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawnItem_C, txt_color) == 0x0002E8, "Member 'UW_DebugSpawnItem_C::txt_color' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawnItem_C, FPS) == 0x0002F0, "Member 'UW_DebugSpawnItem_C::FPS' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawnItem_C, Player_Ref) == 0x0002F8, "Member 'UW_DebugSpawnItem_C::Player_Ref' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawnItem_C, Delta) == 0x000300, "Member 'UW_DebugSpawnItem_C::Delta' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawnItem_C, Second_Time) == 0x000304, "Member 'UW_DebugSpawnItem_C::Second_Time' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawnItem_C, Name_0) == 0x000308, "Member 'UW_DebugSpawnItem_C::Name_0' has a wrong offset!");

}

