#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DebugSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DebugSpawner.W_DebugSpawner_C
// 0x0040 (0x0310 - 0x02D0)
class UW_DebugSpawner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        FPS;                                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APC_C*                                  Player_Ref;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delta;                                             // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Second_Time;                                       // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_DebugSpawnItem_C*>            ListItem;                                          // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_W_DebugSpawner(int32 EntryPoint);
	void Set_List(const TArray<struct FStr_Item>& Items);
	void Set_Selection(int32 Index_0, bool Show_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_DebugSpawner_C">();
	}
	static class UW_DebugSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DebugSpawner_C>();
	}
};
static_assert(alignof(UW_DebugSpawner_C) == 0x000008, "Wrong alignment on UW_DebugSpawner_C");
static_assert(sizeof(UW_DebugSpawner_C) == 0x000310, "Wrong size on UW_DebugSpawner_C");
static_assert(offsetof(UW_DebugSpawner_C, UberGraphFrame) == 0x0002D0, "Member 'UW_DebugSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawner_C, Show) == 0x0002D8, "Member 'UW_DebugSpawner_C::Show' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawner_C, VerticalBox) == 0x0002E0, "Member 'UW_DebugSpawner_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawner_C, FPS) == 0x0002E8, "Member 'UW_DebugSpawner_C::FPS' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawner_C, Player_Ref) == 0x0002F0, "Member 'UW_DebugSpawner_C::Player_Ref' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawner_C, Delta) == 0x0002F8, "Member 'UW_DebugSpawner_C::Delta' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawner_C, Second_Time) == 0x0002FC, "Member 'UW_DebugSpawner_C::Second_Time' has a wrong offset!");
static_assert(offsetof(UW_DebugSpawner_C, ListItem) == 0x000300, "Member 'UW_DebugSpawner_C::ListItem' has a wrong offset!");

}

