#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DebugSpawner

#include "Basic.hpp"

#include "Str_Item_structs.hpp"


namespace SDK::Params
{

// Function W_DebugSpawner.W_DebugSpawner_C.ExecuteUbergraph_W_DebugSpawner
// 0x00A0 (0x00A0 - 0x0000)
struct W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APC_C*                                  K2Node_DynamicCast_AsPC;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStr_Item>                      K2Node_CustomEvent_Items;                          // 0x0040(0x0010)(ConstParm, ReferenceParm)
	struct FStr_Item                              CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_DebugSpawnItem_C*                    CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_DebugSpawnItem_C*                    CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner) == 0x000008, "Wrong alignment on W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner");
static_assert(sizeof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner) == 0x0000A0, "Wrong size on W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, EntryPoint) == 0x000000, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, K2Node_CustomEvent_Index) == 0x000028, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, K2Node_CustomEvent_Show) == 0x00002C, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, K2Node_DynamicCast_AsPC) == 0x000030, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::K2Node_DynamicCast_AsPC' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000039, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, K2Node_CustomEvent_Items) == 0x000040, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::K2Node_CustomEvent_Items' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Array_Get_Item) == 0x000050, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, Temp_int_Loop_Counter_Variable_1) == 0x000064, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Array_LastIndex_ReturnValue) == 0x000078, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00007C, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Create_ReturnValue) == 0x000088, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_Array_Add_ReturnValue) == 0x000094, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner, CallFunc_AddChild_ReturnValue) == 0x000098, "Member 'W_DebugSpawner_C_ExecuteUbergraph_W_DebugSpawner::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function W_DebugSpawner.W_DebugSpawner_C.Set List
// 0x0010 (0x0010 - 0x0000)
struct W_DebugSpawner_C_Set_List final
{
public:
	TArray<struct FStr_Item>                      Items;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_DebugSpawner_C_Set_List) == 0x000008, "Wrong alignment on W_DebugSpawner_C_Set_List");
static_assert(sizeof(W_DebugSpawner_C_Set_List) == 0x000010, "Wrong size on W_DebugSpawner_C_Set_List");
static_assert(offsetof(W_DebugSpawner_C_Set_List, Items) == 0x000000, "Member 'W_DebugSpawner_C_Set_List::Items' has a wrong offset!");

// Function W_DebugSpawner.W_DebugSpawner_C.Set Selection
// 0x0008 (0x0008 - 0x0000)
struct W_DebugSpawner_C_Set_Selection final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_0;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DebugSpawner_C_Set_Selection) == 0x000004, "Wrong alignment on W_DebugSpawner_C_Set_Selection");
static_assert(sizeof(W_DebugSpawner_C_Set_Selection) == 0x000008, "Wrong size on W_DebugSpawner_C_Set_Selection");
static_assert(offsetof(W_DebugSpawner_C_Set_Selection, Index_0) == 0x000000, "Member 'W_DebugSpawner_C_Set_Selection::Index_0' has a wrong offset!");
static_assert(offsetof(W_DebugSpawner_C_Set_Selection, Show_0) == 0x000004, "Member 'W_DebugSpawner_C_Set_Selection::Show_0' has a wrong offset!");

}

