#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GamepadSettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_GamepadSettings_Selector_UseGamepad_K2Node_ComponentBoundEvent_10_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_GamepadSettings_Selector_UseGamepad_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Selector_UseGamepad_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature) == 0x000004, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Selector_UseGamepad_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Selector_UseGamepad_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature) == 0x000004, "Wrong size on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Selector_UseGamepad_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Selector_UseGamepad_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature, Index_0) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_GamepadSettings_Selector_UseGamepad_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature::Index_0' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_GamepadSettings_Slider_Boost_1_K2Node_ComponentBoundEvent_8_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_1_K2Node_ComponentBoundEvent_8_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_1_K2Node_ComponentBoundEvent_8_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_1_K2Node_ComponentBoundEvent_8_On_Confirm_Value__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_1_K2Node_ComponentBoundEvent_8_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong size on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_1_K2Node_ComponentBoundEvent_8_On_Confirm_Value__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_1_K2Node_ComponentBoundEvent_8_On_Confirm_Value__DelegateSignature, Value) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_1_K2Node_ComponentBoundEvent_8_On_Confirm_Value__DelegateSignature::Value' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_GamepadSettings_Slider_Boost_K2Node_ComponentBoundEvent_7_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong size on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature, Value) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Boost_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature::Value' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_0_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_0_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_0_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_0_On_Confirm_Value__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_0_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong size on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_0_On_Confirm_Value__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_0_On_Confirm_Value__DelegateSignature, Value) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_0_On_Confirm_Value__DelegateSignature::Value' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_6_On Value Change__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature) == 0x000008, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature) == 0x000008, "Wrong size on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature, Value) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Deadzone_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature::Value' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_5_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong size on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature, Value) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature::Value' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_9_On Value Change__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature) == 0x000008, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature) == 0x000008, "Wrong size on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature, Value) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Limit_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature::Value' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_GamepadSettings_Slider_Linearity_K2Node_ComponentBoundEvent_2_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Linearity_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Linearity_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Linearity_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Linearity_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong size on W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Linearity_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Linearity_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature, Value) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_GamepadSettings_Slider_Linearity_K2Node_ComponentBoundEvent_2_On_Confirm_Value__DelegateSignature::Value' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong size on W_GamepadSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature, Value) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature::Value' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature) == 0x000004, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature) == 0x000004, "Wrong size on W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature, Index_0) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature::Index_0' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature) == 0x000004, "Wrong alignment on W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature");
static_assert(sizeof(W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature) == 0x000004, "Wrong size on W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature");
static_assert(offsetof(W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature, Index_0) == 0x000000, "Member 'W_GamepadSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature::Index_0' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.ExecuteUbergraph_W_GamepadSettings
// 0x0280 (0x0280 - 0x0000)
struct W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_7;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APC_C*                                  K2Node_DynamicCast_AsPC;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index_2;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value_6;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_5;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_4;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_3;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OneMinus___;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_2;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StickHandler_Out_X;                       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StickHandler_Out_Y;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StickHandler_Amplitude;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StickHandler_Inner;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StickHandler_Outter;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OneMinus____1;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StickHandler_Out_X_1;                     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StickHandler_Out_Y_1;                     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StickHandler_Amplitude_1;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StickHandler_Inner_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StickHandler_Outter_1;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_3;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value_1;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OneMinus____2;                            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_2;                           // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_10; // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_11; // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_12; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings) == 0x000008, "Wrong alignment on W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings");
static_assert(sizeof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings) == 0x000280, "Wrong size on W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, EntryPoint) == 0x000000, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, Temp_int_Variable) == 0x000004, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, Temp_bool_Variable) == 0x000008, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SelectInt_ReturnValue) == 0x00000C, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SelectInt_ReturnValue_1) == 0x000010, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SelectInt_ReturnValue_2) == 0x000014, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, Temp_int_Variable_1) == 0x00002C, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, Temp_bool_Variable_1) == 0x000030, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, Temp_bool_Variable_2) == 0x000031, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_IsValid_ReturnValue_2) == 0x000032, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Value_7) == 0x000040, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Value_7' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_DynamicCast_AsPC) == 0x000048, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_DynamicCast_AsPC' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Index_2) == 0x000054, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Index_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Index_1) == 0x000058, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_GetPlayerPawn_ReturnValue) == 0x000060, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_DynamicCast_AsMec) == 0x000068, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SaveGameToSlot_ReturnValue) == 0x000071, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, Temp_bool_Variable_3) == 0x000072, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Value_6) == 0x000078, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Value_6' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000080, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Value_5) == 0x000088, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Value_5' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Value_4) == 0x000090, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Value_4' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Value_3) == 0x000098, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Value_3' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_OneMinus___) == 0x0000A8, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_OneMinus___' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000B0, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Value_2) == 0x0000B8, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_Event_MyGeometry) == 0x0000C0, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_Event_InDeltaTime) == 0x0000F8, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_BreakVector2D_X) == 0x000100, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_BreakVector2D_Y) == 0x000108, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_MakeVector2D_ReturnValue_1) == 0x000110, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_BreakVector2D_X_1) == 0x000120, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_BreakVector2D_Y_1) == 0x000128, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Out_X) == 0x000130, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Out_X' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Out_Y) == 0x000138, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Out_Y' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Amplitude) == 0x000140, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Amplitude' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Inner) == 0x000148, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Inner' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Outter) == 0x000149, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Outter' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_MakeVector2D_ReturnValue_2) == 0x000150, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_MapRangeClamped_ReturnValue) == 0x000160, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000168, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_OneMinus____1) == 0x000170, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_OneMinus____1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_MakeVector2D_ReturnValue_3) == 0x000178, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Out_X_1) == 0x000188, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Out_X_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Out_Y_1) == 0x000190, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Out_Y_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Amplitude_1) == 0x000198, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Amplitude_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Inner_1) == 0x0001A0, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Inner_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_StickHandler_Outter_1) == 0x0001A1, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_StickHandler_Outter_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SelectFloat_ReturnValue) == 0x0001A8, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SelectFloat_ReturnValue_1) == 0x0001B0, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SelectFloat_ReturnValue_2) == 0x0001B8, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0001C0, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_MapRangeClamped_ReturnValue_3) == 0x0001C8, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, Temp_bool_Variable_4) == 0x0001D0, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Value_1) == 0x0001D8, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001E0, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, Temp_int_Variable_2) == 0x0001E8, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Value) == 0x0001F0, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_Select_Default) == 0x0001F8, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000200, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_OneMinus____2) == 0x000208, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_OneMinus____2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000210, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, Temp_bool_Variable_5) == 0x000218, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_ComponentBoundEvent_Index) == 0x00021C, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_Select_Default_1) == 0x000220, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, K2Node_Select_Default_2) == 0x000221, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000228, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000230, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000238, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000240, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000248, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00024C, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000250, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000254, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000258, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x00025C, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x000260, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x000264, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x000268, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x00026C, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_10) == 0x000270, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_11) == 0x000274, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_11' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings, CallFunc_SetScalarParameterValue_Value_ImplicitCast_12) == 0x000278, "Member 'W_GamepadSettings_C_ExecuteUbergraph_W_GamepadSettings::CallFunc_SetScalarParameterValue_Value_ImplicitCast_12' has a wrong offset!");

// Function W_GamepadSettings.W_GamepadSettings_C.Set Default Modes
// 0x0008 (0x0008 - 0x0000)
struct W_GamepadSettings_C_Set_Default_Modes final
{
public:
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadSettings_C_Set_Default_Modes) == 0x000004, "Wrong alignment on W_GamepadSettings_C_Set_Default_Modes");
static_assert(sizeof(W_GamepadSettings_C_Set_Default_Modes) == 0x000008, "Wrong size on W_GamepadSettings_C_Set_Default_Modes");
static_assert(offsetof(W_GamepadSettings_C_Set_Default_Modes, CallFunc_SelectInt_ReturnValue) == 0x000000, "Member 'W_GamepadSettings_C_Set_Default_Modes::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadSettings_C_Set_Default_Modes, CallFunc_SelectInt_ReturnValue_1) == 0x000004, "Member 'W_GamepadSettings_C_Set_Default_Modes::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");

