#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GI_HUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_GI_HUD.W_GI_HUD_C
// 0x0028 (0x02F8 - 0x02D0)
class UW_GI_HUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Transition_FadeOut;                                // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Transition_Spawn;                                  // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvas;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainText;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_GI_HUD(int32 EntryPoint);
	void FadeIn();
	void FadeOut();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_GI_HUD_C">();
	}
	static class UW_GI_HUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_GI_HUD_C>();
	}
};
static_assert(alignof(UW_GI_HUD_C) == 0x000008, "Wrong alignment on UW_GI_HUD_C");
static_assert(sizeof(UW_GI_HUD_C) == 0x0002F8, "Wrong size on UW_GI_HUD_C");
static_assert(offsetof(UW_GI_HUD_C, UberGraphFrame) == 0x0002D0, "Member 'UW_GI_HUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_GI_HUD_C, Transition_FadeOut) == 0x0002D8, "Member 'UW_GI_HUD_C::Transition_FadeOut' has a wrong offset!");
static_assert(offsetof(UW_GI_HUD_C, Transition_Spawn) == 0x0002E0, "Member 'UW_GI_HUD_C::Transition_Spawn' has a wrong offset!");
static_assert(offsetof(UW_GI_HUD_C, MainCanvas) == 0x0002E8, "Member 'UW_GI_HUD_C::MainCanvas' has a wrong offset!");
static_assert(offsetof(UW_GI_HUD_C, MainText) == 0x0002F0, "Member 'UW_GI_HUD_C::MainText' has a wrong offset!");

}

