#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GraphicSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_GraphicSettings.W_GraphicSettings_C
// 0x0078 (0x0348 - 0x02D0)
class UW_GraphicSettings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Selector_C*                          Selector_AA;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Selector_C*                          Selector_AO;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Selector_C*                          Selector_DOF;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Selector_C*                          Selector_Fog;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Selector_C*                          Selector_Reflex;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Switcher_C*                          Selector_Resolution;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Selector_C*                          Selector_ScreenMode;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Selector_C*                          Selector_Vsync;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Slider_C*                            Slider_FPSCap;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Slider_C*                            Slider_RenderScale;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Bannier_C*                           W_Bannier;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Bannier_C*                           W_Bannier_1;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Bannier_C*                           W_Bannier_2;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APC_C*                                  PC_Ref;                                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_GraphicSettings_Selector_AA_K2Node_ComponentBoundEvent_6_On_Value_Change__DelegateSignature(int32 Index_0);
	void BndEvt__W_GraphicSettings_Selector_DOF_K2Node_ComponentBoundEvent_2_On_Value_Change__DelegateSignature(int32 Index_0);
	void BndEvt__W_GraphicSettings_Selector_Fog_K2Node_ComponentBoundEvent_0_On_Value_Change__DelegateSignature(int32 Index_0);
	void BndEvt__W_GraphicSettings_Selector_Reflex_K2Node_ComponentBoundEvent_9_On_Value_Change__DelegateSignature(int32 Index_0);
	void BndEvt__W_GraphicSettings_Selector_Resolution_K2Node_ComponentBoundEvent_1_On_Apply__DelegateSignature(int32 Index_0);
	void BndEvt__W_GraphicSettings_Selector_ScreenMode_K2Node_ComponentBoundEvent_8_On_Value_Change__DelegateSignature(int32 Index_0);
	void BndEvt__W_GraphicSettings_Selector_Shadow_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature(int32 Index_0);
	void BndEvt__W_GraphicSettings_Selector_Vsync_K2Node_ComponentBoundEvent_10_On_Value_Change__DelegateSignature(int32 Index_0);
	void BndEvt__W_GraphicSettings_Slider_FPSCap_K2Node_ComponentBoundEvent_7_On_Confirm_Value__DelegateSignature(double Value);
	void BndEvt__W_GraphicSettings_Slider_RenderScale_K2Node_ComponentBoundEvent_5_On_Confirm_Value__DelegateSignature(double Value);
	void Construct();
	void ExecuteUbergraph_W_GraphicSettings(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Graphic_Settings();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_GraphicSettings_C">();
	}
	static class UW_GraphicSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_GraphicSettings_C>();
	}
};
static_assert(alignof(UW_GraphicSettings_C) == 0x000008, "Wrong alignment on UW_GraphicSettings_C");
static_assert(sizeof(UW_GraphicSettings_C) == 0x000348, "Wrong size on UW_GraphicSettings_C");
static_assert(offsetof(UW_GraphicSettings_C, UberGraphFrame) == 0x0002D0, "Member 'UW_GraphicSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Selector_AA) == 0x0002D8, "Member 'UW_GraphicSettings_C::Selector_AA' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Selector_AO) == 0x0002E0, "Member 'UW_GraphicSettings_C::Selector_AO' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Selector_DOF) == 0x0002E8, "Member 'UW_GraphicSettings_C::Selector_DOF' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Selector_Fog) == 0x0002F0, "Member 'UW_GraphicSettings_C::Selector_Fog' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Selector_Reflex) == 0x0002F8, "Member 'UW_GraphicSettings_C::Selector_Reflex' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Selector_Resolution) == 0x000300, "Member 'UW_GraphicSettings_C::Selector_Resolution' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Selector_ScreenMode) == 0x000308, "Member 'UW_GraphicSettings_C::Selector_ScreenMode' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Selector_Vsync) == 0x000310, "Member 'UW_GraphicSettings_C::Selector_Vsync' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Slider_FPSCap) == 0x000318, "Member 'UW_GraphicSettings_C::Slider_FPSCap' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, Slider_RenderScale) == 0x000320, "Member 'UW_GraphicSettings_C::Slider_RenderScale' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, W_Bannier) == 0x000328, "Member 'UW_GraphicSettings_C::W_Bannier' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, W_Bannier_1) == 0x000330, "Member 'UW_GraphicSettings_C::W_Bannier_1' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, W_Bannier_2) == 0x000338, "Member 'UW_GraphicSettings_C::W_Bannier_2' has a wrong offset!");
static_assert(offsetof(UW_GraphicSettings_C, PC_Ref) == 0x000340, "Member 'UW_GraphicSettings_C::PC_Ref' has a wrong offset!");

}

