#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Interaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Interaction.W_Interaction_C
// 0x0020 (0x02F0 - 0x02D0)
class UW_Interaction_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_34;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_1;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               M_Circle;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Interaction(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Opacity(float Value);
	void Set_Radius(float Value);
	void Set_Thickness(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Interaction_C">();
	}
	static class UW_Interaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Interaction_C>();
	}
};
static_assert(alignof(UW_Interaction_C) == 0x000008, "Wrong alignment on UW_Interaction_C");
static_assert(sizeof(UW_Interaction_C) == 0x0002F0, "Wrong size on UW_Interaction_C");
static_assert(offsetof(UW_Interaction_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Interaction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Interaction_C, Image_34) == 0x0002D8, "Member 'UW_Interaction_C::Image_34' has a wrong offset!");
static_assert(offsetof(UW_Interaction_C, RetainerBox_1) == 0x0002E0, "Member 'UW_Interaction_C::RetainerBox_1' has a wrong offset!");
static_assert(offsetof(UW_Interaction_C, M_Circle) == 0x0002E8, "Member 'UW_Interaction_C::M_Circle' has a wrong offset!");

}

