#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InputsSettings

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_InputsSettings.W_InputsSettings_C.BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On Confirm Value__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_InputsSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InputsSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong alignment on W_InputsSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature");
static_assert(sizeof(W_InputsSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature) == 0x000008, "Wrong size on W_InputsSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature");
static_assert(offsetof(W_InputsSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature, Value) == 0x000000, "Member 'W_InputsSettings_C_BndEvt__W_InputsSettings_Slider_Camera_K2Node_ComponentBoundEvent_1_On_Confirm_Value__DelegateSignature::Value' has a wrong offset!");

// Function W_InputsSettings.W_InputsSettings_C.BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature) == 0x000004, "Wrong alignment on W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature");
static_assert(sizeof(W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature) == 0x000004, "Wrong size on W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature");
static_assert(offsetof(W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature, Index_0) == 0x000000, "Member 'W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_2_K2Node_ComponentBoundEvent_4_On_Value_Change__DelegateSignature::Index_0' has a wrong offset!");

// Function W_InputsSettings.W_InputsSettings_C.BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On Value Change__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature) == 0x000004, "Wrong alignment on W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature");
static_assert(sizeof(W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature) == 0x000004, "Wrong size on W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature");
static_assert(offsetof(W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature, Index_0) == 0x000000, "Member 'W_InputsSettings_C_BndEvt__W_InputsSettings_W_Selector_3_K2Node_ComponentBoundEvent_3_On_Value_Change__DelegateSignature::Index_0' has a wrong offset!");

// Function W_InputsSettings.W_InputsSettings_C.ExecuteUbergraph_W_InputsSettings
// 0x0068 (0x0068 - 0x0000)
struct W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APC_C*                                  K2Node_DynamicCast_AsPC;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings) == 0x000008, "Wrong alignment on W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings");
static_assert(sizeof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings) == 0x000068, "Wrong size on W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, EntryPoint) == 0x000000, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, Temp_int_Variable) == 0x000004, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, Temp_bool_Variable) == 0x000008, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, Temp_bool_Variable_1) == 0x000009, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, Temp_int_Variable_1) == 0x00000C, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, Temp_bool_Variable_2) == 0x000010, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, Temp_bool_Variable_3) == 0x000011, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, CallFunc_SelectInt_ReturnValue_1) == 0x000018, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, CallFunc_IsValid_ReturnValue_1) == 0x00001C, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, K2Node_ComponentBoundEvent_Value) == 0x000028, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, K2Node_DynamicCast_AsPC) == 0x000030, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::K2Node_DynamicCast_AsPC' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, K2Node_ComponentBoundEvent_Index_1) == 0x00003C, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, K2Node_Select_Default) == 0x000040, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, K2Node_ComponentBoundEvent_Index) == 0x000044, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, K2Node_Select_Default_1) == 0x000048, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, CallFunc_GetPlayerPawn_ReturnValue) == 0x000050, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, K2Node_DynamicCast_AsMec) == 0x000058, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings, CallFunc_SaveGameToSlot_ReturnValue) == 0x000061, "Member 'W_InputsSettings_C_ExecuteUbergraph_W_InputsSettings::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function W_InputsSettings.W_InputsSettings_C.Set Default Modes
// 0x0008 (0x0008 - 0x0000)
struct W_InputsSettings_C_Set_Default_Modes final
{
public:
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InputsSettings_C_Set_Default_Modes) == 0x000004, "Wrong alignment on W_InputsSettings_C_Set_Default_Modes");
static_assert(sizeof(W_InputsSettings_C_Set_Default_Modes) == 0x000008, "Wrong size on W_InputsSettings_C_Set_Default_Modes");
static_assert(offsetof(W_InputsSettings_C_Set_Default_Modes, CallFunc_SelectInt_ReturnValue) == 0x000000, "Member 'W_InputsSettings_C_Set_Default_Modes::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputsSettings_C_Set_Default_Modes, CallFunc_SelectInt_ReturnValue_1) == 0x000004, "Member 'W_InputsSettings_C_Set_Default_Modes::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");

}

