#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InputInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_InputInfo.W_InputInfo_C.ExecuteUbergraph_W_InputInfo
// 0x0138 (0x0138 - 0x0000)
struct W_InputInfo_C_ExecuteUbergraph_W_InputInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0054(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Text;                           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Delta__;                                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo) == 0x000008, "Wrong alignment on W_InputInfo_C_ExecuteUbergraph_W_InputInfo");
static_assert(sizeof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo) == 0x000138, "Wrong size on W_InputInfo_C_ExecuteUbergraph_W_InputInfo");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, EntryPoint) == 0x000000, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, K2Node_Event_MyGeometry) == 0x000018, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, K2Node_Event_InDeltaTime) == 0x000050, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_GetCachedGeometry_ReturnValue) == 0x000054, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_GetLocalSize_ReturnValue) == 0x000090, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_BreakVector2D_X) == 0x0000A0, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_BreakVector2D_Y) == 0x0000A8, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_FClamp_ReturnValue) == 0x0000B0, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, K2Node_CustomEvent_Text) == 0x0000B8, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x0000C8, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x0000EC, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_Delta__) == 0x0000F0, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_Delta__' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_SelectFloat_ReturnValue) == 0x0000F8, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_FInterpTo_ReturnValue) == 0x000100, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000108, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000110, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_FInterpTo_ReturnValue_1) == 0x000118, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x000120, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000124, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000128, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_ExecuteUbergraph_W_InputInfo, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast) == 0x000130, "Member 'W_InputInfo_C_ExecuteUbergraph_W_InputInfo::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast' has a wrong offset!");

// Function W_InputInfo.W_InputInfo_C.Set Info
// 0x0010 (0x0010 - 0x0000)
struct W_InputInfo_C_Set_Info final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InputInfo_C_Set_Info) == 0x000008, "Wrong alignment on W_InputInfo_C_Set_Info");
static_assert(sizeof(W_InputInfo_C_Set_Info) == 0x000010, "Wrong size on W_InputInfo_C_Set_Info");
static_assert(offsetof(W_InputInfo_C_Set_Info, Text) == 0x000000, "Member 'W_InputInfo_C_Set_Info::Text' has a wrong offset!");

// Function W_InputInfo.W_InputInfo_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_InputInfo_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InputInfo_C_Tick) == 0x000004, "Wrong alignment on W_InputInfo_C_Tick");
static_assert(sizeof(W_InputInfo_C_Tick) == 0x00003C, "Wrong size on W_InputInfo_C_Tick");
static_assert(offsetof(W_InputInfo_C_Tick, MyGeometry) == 0x000000, "Member 'W_InputInfo_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_InputInfo_C_Tick, InDeltaTime) == 0x000038, "Member 'W_InputInfo_C_Tick::InDeltaTime' has a wrong offset!");

}

