#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Interaction

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Interaction.W_Interaction_C.ExecuteUbergraph_W_Interaction
// 0x0018 (0x0018 - 0x0000)
struct W_Interaction_C_ExecuteUbergraph_W_Interaction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Interaction_C_ExecuteUbergraph_W_Interaction) == 0x000008, "Wrong alignment on W_Interaction_C_ExecuteUbergraph_W_Interaction");
static_assert(sizeof(W_Interaction_C_ExecuteUbergraph_W_Interaction) == 0x000018, "Wrong size on W_Interaction_C_ExecuteUbergraph_W_Interaction");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, EntryPoint) == 0x000000, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_Event_IsDesignTime) == 0x000010, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_Interaction.W_Interaction_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Interaction_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Interaction_C_PreConstruct) == 0x000001, "Wrong alignment on W_Interaction_C_PreConstruct");
static_assert(sizeof(W_Interaction_C_PreConstruct) == 0x000001, "Wrong size on W_Interaction_C_PreConstruct");
static_assert(offsetof(W_Interaction_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Interaction_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Interaction.W_Interaction_C.Set Opacity
// 0x0008 (0x0008 - 0x0000)
struct W_Interaction_C_Set_Opacity final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Interaction_C_Set_Opacity) == 0x000004, "Wrong alignment on W_Interaction_C_Set_Opacity");
static_assert(sizeof(W_Interaction_C_Set_Opacity) == 0x000008, "Wrong size on W_Interaction_C_Set_Opacity");
static_assert(offsetof(W_Interaction_C_Set_Opacity, Value) == 0x000000, "Member 'W_Interaction_C_Set_Opacity::Value' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_Set_Opacity, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_Interaction_C_Set_Opacity::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_Interaction.W_Interaction_C.Set Radius
// 0x0008 (0x0008 - 0x0000)
struct W_Interaction_C_Set_Radius final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Interaction_C_Set_Radius) == 0x000004, "Wrong alignment on W_Interaction_C_Set_Radius");
static_assert(sizeof(W_Interaction_C_Set_Radius) == 0x000008, "Wrong size on W_Interaction_C_Set_Radius");
static_assert(offsetof(W_Interaction_C_Set_Radius, Value) == 0x000000, "Member 'W_Interaction_C_Set_Radius::Value' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_Set_Radius, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_Interaction_C_Set_Radius::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_Interaction.W_Interaction_C.Set Thickness
// 0x0008 (0x0008 - 0x0000)
struct W_Interaction_C_Set_Thickness final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Interaction_C_Set_Thickness) == 0x000004, "Wrong alignment on W_Interaction_C_Set_Thickness");
static_assert(sizeof(W_Interaction_C_Set_Thickness) == 0x000008, "Wrong size on W_Interaction_C_Set_Thickness");
static_assert(offsetof(W_Interaction_C_Set_Thickness, Value) == 0x000000, "Member 'W_Interaction_C_Set_Thickness::Value' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_Set_Thickness, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_Interaction_C_Set_Thickness::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

