#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Str_Item_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemStats.W_ItemStats_C
// 0x0118 (0x03E8 - 0x02D0)
class UW_ItemStats_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_Gun;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_Melee;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Hidder;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Cadency;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Capacity;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Cast;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Cost;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_DamageHeal;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_DamageHeal_Cirt;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_DamageStamina;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_DamageStamina_Cirt;                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gun_Cost;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gun_DamageHeal;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gun_DamageHeal_Cirt;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gun_DamageStamina;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gun_DamageStamina_Cirt;                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gun_Stun;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gun_Stun_Crit;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gun_StunType;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gun_StunType_Crit;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ItemName;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Range;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Speed;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Stun;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Stun_Crit;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_StunType;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_StunType_Crit;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FStr_Item                              Item;                                              // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         All_Opacity;                                       // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta;                                             // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UData_MeleeType_C*                      Melee_Data;                                        // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_Gun_C*                            Gun_Data;                                          // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_ItemStats(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Item(const struct FStr_Item& Item_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ItemStats_C">();
	}
	static class UW_ItemStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ItemStats_C>();
	}
};
static_assert(alignof(UW_ItemStats_C) == 0x000008, "Wrong alignment on UW_ItemStats_C");
static_assert(sizeof(UW_ItemStats_C) == 0x0003E8, "Wrong size on UW_ItemStats_C");
static_assert(offsetof(UW_ItemStats_C, UberGraphFrame) == 0x0002D0, "Member 'UW_ItemStats_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Canvas_Gun) == 0x0002D8, "Member 'UW_ItemStats_C::Canvas_Gun' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Canvas_Melee) == 0x0002E0, "Member 'UW_ItemStats_C::Canvas_Melee' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Hidder) == 0x0002E8, "Member 'UW_ItemStats_C::Hidder' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Cadency) == 0x0002F0, "Member 'UW_ItemStats_C::Txt_Cadency' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Capacity) == 0x0002F8, "Member 'UW_ItemStats_C::Txt_Capacity' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Cast) == 0x000300, "Member 'UW_ItemStats_C::Txt_Cast' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Cost) == 0x000308, "Member 'UW_ItemStats_C::Txt_Cost' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_DamageHeal) == 0x000310, "Member 'UW_ItemStats_C::Txt_DamageHeal' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_DamageHeal_Cirt) == 0x000318, "Member 'UW_ItemStats_C::Txt_DamageHeal_Cirt' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_DamageStamina) == 0x000320, "Member 'UW_ItemStats_C::Txt_DamageStamina' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_DamageStamina_Cirt) == 0x000328, "Member 'UW_ItemStats_C::Txt_DamageStamina_Cirt' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Gun_Cost) == 0x000330, "Member 'UW_ItemStats_C::Txt_Gun_Cost' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Gun_DamageHeal) == 0x000338, "Member 'UW_ItemStats_C::Txt_Gun_DamageHeal' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Gun_DamageHeal_Cirt) == 0x000340, "Member 'UW_ItemStats_C::Txt_Gun_DamageHeal_Cirt' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Gun_DamageStamina) == 0x000348, "Member 'UW_ItemStats_C::Txt_Gun_DamageStamina' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Gun_DamageStamina_Cirt) == 0x000350, "Member 'UW_ItemStats_C::Txt_Gun_DamageStamina_Cirt' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Gun_Stun) == 0x000358, "Member 'UW_ItemStats_C::Txt_Gun_Stun' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Gun_Stun_Crit) == 0x000360, "Member 'UW_ItemStats_C::Txt_Gun_Stun_Crit' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Gun_StunType) == 0x000368, "Member 'UW_ItemStats_C::Txt_Gun_StunType' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Gun_StunType_Crit) == 0x000370, "Member 'UW_ItemStats_C::Txt_Gun_StunType_Crit' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_ItemName) == 0x000378, "Member 'UW_ItemStats_C::Txt_ItemName' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Range) == 0x000380, "Member 'UW_ItemStats_C::Txt_Range' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Speed) == 0x000388, "Member 'UW_ItemStats_C::Txt_Speed' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Stun) == 0x000390, "Member 'UW_ItemStats_C::Txt_Stun' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_Stun_Crit) == 0x000398, "Member 'UW_ItemStats_C::Txt_Stun_Crit' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_StunType) == 0x0003A0, "Member 'UW_ItemStats_C::Txt_StunType' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Txt_StunType_Crit) == 0x0003A8, "Member 'UW_ItemStats_C::Txt_StunType_Crit' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, WidgetSwitcher_0) == 0x0003B0, "Member 'UW_ItemStats_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Item) == 0x0003B8, "Member 'UW_ItemStats_C::Item' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Mec_Ref) == 0x0003C8, "Member 'UW_ItemStats_C::Mec_Ref' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, All_Opacity) == 0x0003D0, "Member 'UW_ItemStats_C::All_Opacity' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Delta) == 0x0003D4, "Member 'UW_ItemStats_C::Delta' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Melee_Data) == 0x0003D8, "Member 'UW_ItemStats_C::Melee_Data' has a wrong offset!");
static_assert(offsetof(UW_ItemStats_C, Gun_Data) == 0x0003E0, "Member 'UW_ItemStats_C::Gun_Data' has a wrong offset!");

}

