#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MachinePannelScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MachinePannelScreen.W_MachinePannelScreen_C
// 0x0050 (0x0320 - 0x02D0)
class UW_MachinePannelScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 JaugeImage;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 JaugeTarget;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Pressure;                                          // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Jauge;                                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Jauge_Value;                                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Target;                                            // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Jauge_Target;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_MachinePannelScreen(int32 EntryPoint);
	void Set_Process(int32 Percent);
	void Set_Target(int32 Target_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MachinePannelScreen_C">();
	}
	static class UW_MachinePannelScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MachinePannelScreen_C>();
	}
};
static_assert(alignof(UW_MachinePannelScreen_C) == 0x000008, "Wrong alignment on UW_MachinePannelScreen_C");
static_assert(sizeof(UW_MachinePannelScreen_C) == 0x000320, "Wrong size on UW_MachinePannelScreen_C");
static_assert(offsetof(UW_MachinePannelScreen_C, UberGraphFrame) == 0x0002D0, "Member 'UW_MachinePannelScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_MachinePannelScreen_C, JaugeImage) == 0x0002D8, "Member 'UW_MachinePannelScreen_C::JaugeImage' has a wrong offset!");
static_assert(offsetof(UW_MachinePannelScreen_C, JaugeTarget) == 0x0002E0, "Member 'UW_MachinePannelScreen_C::JaugeTarget' has a wrong offset!");
static_assert(offsetof(UW_MachinePannelScreen_C, TextBlock) == 0x0002E8, "Member 'UW_MachinePannelScreen_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UW_MachinePannelScreen_C, TextBlock_0) == 0x0002F0, "Member 'UW_MachinePannelScreen_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UW_MachinePannelScreen_C, Pressure) == 0x0002F8, "Member 'UW_MachinePannelScreen_C::Pressure' has a wrong offset!");
static_assert(offsetof(UW_MachinePannelScreen_C, Jauge) == 0x000300, "Member 'UW_MachinePannelScreen_C::Jauge' has a wrong offset!");
static_assert(offsetof(UW_MachinePannelScreen_C, Jauge_Value) == 0x000308, "Member 'UW_MachinePannelScreen_C::Jauge_Value' has a wrong offset!");
static_assert(offsetof(UW_MachinePannelScreen_C, Target) == 0x000310, "Member 'UW_MachinePannelScreen_C::Target' has a wrong offset!");
static_assert(offsetof(UW_MachinePannelScreen_C, Jauge_Target) == 0x000318, "Member 'UW_MachinePannelScreen_C::Jauge_Target' has a wrong offset!");

}

