#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MachinePannelScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_MachinePannelScreen.W_MachinePannelScreen_C.ExecuteUbergraph_W_MachinePannelScreen
// 0x0050 (0x0050 - 0x0000)
struct W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Percent;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Target;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen) == 0x000008, "Wrong alignment on W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen");
static_assert(sizeof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen) == 0x000050, "Wrong size on W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, EntryPoint) == 0x000000, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, K2Node_CustomEvent_Percent) == 0x00001C, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::K2Node_CustomEvent_Percent' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, K2Node_CustomEvent_Target) == 0x000038, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000040, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000048, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00004C, "Member 'W_MachinePannelScreen_C_ExecuteUbergraph_W_MachinePannelScreen::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function W_MachinePannelScreen.W_MachinePannelScreen_C.Set Process
// 0x0004 (0x0004 - 0x0000)
struct W_MachinePannelScreen_C_Set_Process final
{
public:
	int32                                         Percent;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MachinePannelScreen_C_Set_Process) == 0x000004, "Wrong alignment on W_MachinePannelScreen_C_Set_Process");
static_assert(sizeof(W_MachinePannelScreen_C_Set_Process) == 0x000004, "Wrong size on W_MachinePannelScreen_C_Set_Process");
static_assert(offsetof(W_MachinePannelScreen_C_Set_Process, Percent) == 0x000000, "Member 'W_MachinePannelScreen_C_Set_Process::Percent' has a wrong offset!");

// Function W_MachinePannelScreen.W_MachinePannelScreen_C.Set Target
// 0x0004 (0x0004 - 0x0000)
struct W_MachinePannelScreen_C_Set_Target final
{
public:
	int32                                         Target_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MachinePannelScreen_C_Set_Target) == 0x000004, "Wrong alignment on W_MachinePannelScreen_C_Set_Target");
static_assert(sizeof(W_MachinePannelScreen_C_Set_Target) == 0x000004, "Wrong size on W_MachinePannelScreen_C_Set_Target");
static_assert(offsetof(W_MachinePannelScreen_C_Set_Target, Target_0) == 0x000000, "Member 'W_MachinePannelScreen_C_Set_Target::Target_0' has a wrong offset!");

}

