#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MainBar.W_MainBar_C
// 0x00A0 (0x0370 - 0x02D0)
class UW_MainBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowBackground;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BarPart_C*                           M_Audio;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BarPart_C*                           M_Gamepad;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BarPart_C*                           M_inputs;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BarPart_C*                           M_Players;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BarPart_C*                           M_Session;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BarPart_C*                           M_Video;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 Index)>   On_Select;                                         // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UW_Menu_C*                              Menu;                                              // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_BarPart_C*>                   Parts;                                             // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Selected_Index;                                    // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Cursor_Padding;                                    // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Smooth;                                            // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_MainBar_Menu_K2Node_ComponentBoundEvent_3_CloseMenu__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_MainBar(int32 EntryPoint);
	void Get_Padding(struct FVector2D* Padding_0);
	void Get_target_Padding(double* Left, double* Right);
	void PreConstruct(bool IsDesignTime);
	void Set_Bar_Index(int32 Index_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MainBar_C">();
	}
	static class UW_MainBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MainBar_C>();
	}
};
static_assert(alignof(UW_MainBar_C) == 0x000008, "Wrong alignment on UW_MainBar_C");
static_assert(sizeof(UW_MainBar_C) == 0x000370, "Wrong size on UW_MainBar_C");
static_assert(offsetof(UW_MainBar_C, UberGraphFrame) == 0x0002D0, "Member 'UW_MainBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, ShowBackground) == 0x0002D8, "Member 'UW_MainBar_C::ShowBackground' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, Background) == 0x0002E0, "Member 'UW_MainBar_C::Background' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, HorizontalBox) == 0x0002E8, "Member 'UW_MainBar_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, M_Audio) == 0x0002F0, "Member 'UW_MainBar_C::M_Audio' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, M_Gamepad) == 0x0002F8, "Member 'UW_MainBar_C::M_Gamepad' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, M_inputs) == 0x000300, "Member 'UW_MainBar_C::M_inputs' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, M_Players) == 0x000308, "Member 'UW_MainBar_C::M_Players' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, M_Session) == 0x000310, "Member 'UW_MainBar_C::M_Session' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, M_Video) == 0x000318, "Member 'UW_MainBar_C::M_Video' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, Hovered) == 0x000320, "Member 'UW_MainBar_C::Hovered' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, On_Select) == 0x000328, "Member 'UW_MainBar_C::On_Select' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, Menu) == 0x000338, "Member 'UW_MainBar_C::Menu' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, Parts) == 0x000340, "Member 'UW_MainBar_C::Parts' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, Selected_Index) == 0x000350, "Member 'UW_MainBar_C::Selected_Index' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, Cursor_Padding) == 0x000358, "Member 'UW_MainBar_C::Cursor_Padding' has a wrong offset!");
static_assert(offsetof(UW_MainBar_C, Smooth) == 0x000368, "Member 'UW_MainBar_C::Smooth' has a wrong offset!");

}

