#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_MainTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Menu_MainTab.W_Menu_MainTab_C
// 0x0038 (0x0308 - 0x02D0)
class UW_Menu_MainTab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBox_50;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Ref;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FText Name)> Tab_Selected;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UW_Menu_MainTabButton_C*>        Buttons;                                           // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_W_Menu_MainTab(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Select_Tab(int32 ID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Menu_MainTab_C">();
	}
	static class UW_Menu_MainTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Menu_MainTab_C>();
	}
};
static_assert(alignof(UW_Menu_MainTab_C) == 0x000008, "Wrong alignment on UW_Menu_MainTab_C");
static_assert(sizeof(UW_Menu_MainTab_C) == 0x000308, "Wrong size on UW_Menu_MainTab_C");
static_assert(offsetof(UW_Menu_MainTab_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Menu_MainTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Menu_MainTab_C, VerticalBox_50) == 0x0002D8, "Member 'UW_Menu_MainTab_C::VerticalBox_50' has a wrong offset!");
static_assert(offsetof(UW_Menu_MainTab_C, Switcher_Ref) == 0x0002E0, "Member 'UW_Menu_MainTab_C::Switcher_Ref' has a wrong offset!");
static_assert(offsetof(UW_Menu_MainTab_C, Tab_Selected) == 0x0002E8, "Member 'UW_Menu_MainTab_C::Tab_Selected' has a wrong offset!");
static_assert(offsetof(UW_Menu_MainTab_C, Buttons) == 0x0002F8, "Member 'UW_Menu_MainTab_C::Buttons' has a wrong offset!");

}

