#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_Graphics

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Menu_Graphics.W_Menu_Graphics_C.BndEvt__W_Menu_Graphics_Setting_DOF_K2Node_ComponentBoundEvent_0_Value Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Menu_Graphics_C_BndEvt__W_Menu_Graphics_Setting_DOF_K2Node_ComponentBoundEvent_0_Value_Changed__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_Graphics_C_BndEvt__W_Menu_Graphics_Setting_DOF_K2Node_ComponentBoundEvent_0_Value_Changed__DelegateSignature) == 0x000004, "Wrong alignment on W_Menu_Graphics_C_BndEvt__W_Menu_Graphics_Setting_DOF_K2Node_ComponentBoundEvent_0_Value_Changed__DelegateSignature");
static_assert(sizeof(W_Menu_Graphics_C_BndEvt__W_Menu_Graphics_Setting_DOF_K2Node_ComponentBoundEvent_0_Value_Changed__DelegateSignature) == 0x000004, "Wrong size on W_Menu_Graphics_C_BndEvt__W_Menu_Graphics_Setting_DOF_K2Node_ComponentBoundEvent_0_Value_Changed__DelegateSignature");
static_assert(offsetof(W_Menu_Graphics_C_BndEvt__W_Menu_Graphics_Setting_DOF_K2Node_ComponentBoundEvent_0_Value_Changed__DelegateSignature, Index_0) == 0x000000, "Member 'W_Menu_Graphics_C_BndEvt__W_Menu_Graphics_Setting_DOF_K2Node_ComponentBoundEvent_0_Value_Changed__DelegateSignature::Index_0' has a wrong offset!");

// Function W_Menu_Graphics.W_Menu_Graphics_C.ExecuteUbergraph_W_Menu_Graphics
// 0x0020 (0x0020 - 0x0000)
struct W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APC_C*                                  K2Node_DynamicCast_AsPC;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics) == 0x000008, "Wrong alignment on W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics");
static_assert(sizeof(W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics) == 0x000020, "Wrong size on W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics");
static_assert(offsetof(W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics, EntryPoint) == 0x000000, "Member 'W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics, K2Node_DynamicCast_AsPC) == 0x000010, "Member 'W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics::K2Node_DynamicCast_AsPC' has a wrong offset!");
static_assert(offsetof(W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics, K2Node_ComponentBoundEvent_Index) == 0x00001C, "Member 'W_Menu_Graphics_C_ExecuteUbergraph_W_Menu_Graphics::K2Node_ComponentBoundEvent_Index' has a wrong offset!");

}

