#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_Rules

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Menu_Rules.W_Menu_Rules_C.ExecuteUbergraph_W_Menu_Rules
// 0x0020 (0x0020 - 0x0000)
struct W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APC_C*                                  K2Node_DynamicCast_AsPC;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules) == 0x000008, "Wrong alignment on W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules");
static_assert(sizeof(W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules) == 0x000020, "Wrong size on W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules");
static_assert(offsetof(W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules, EntryPoint) == 0x000000, "Member 'W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules, K2Node_DynamicCast_AsPC) == 0x000010, "Member 'W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules::K2Node_DynamicCast_AsPC' has a wrong offset!");
static_assert(offsetof(W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_Menu_Rules_C_ExecuteUbergraph_W_Menu_Rules::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

