#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_MainTab

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Menu_MainTab.W_Menu_MainTab_C.ExecuteUbergraph_W_Menu_MainTab
// 0x0088 (0x0088 - 0x0000)
struct W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Menu_MainTabButton_C*                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ID;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Menu_MainTabButton_C*                CallFunc_Array_Get_Item_2;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Menu_MainTabButton_C*                K2Node_DynamicCast_AsW_Menu_Main_Tab_Button;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab) == 0x000008, "Wrong alignment on W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab");
static_assert(sizeof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab) == 0x000088, "Wrong size on W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, EntryPoint) == 0x000000, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, Temp_int_Array_Index_Variable) == 0x000008, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, Temp_int_Array_Index_Variable_2) == 0x000024, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Array_Get_Item) == 0x000028, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, K2Node_Event_IsDesignTime) == 0x000030, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, K2Node_CustomEvent_ID) == 0x000034, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::K2Node_CustomEvent_ID' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_GetAllChildren_ReturnValue) == 0x000040, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, K2Node_DynamicCast_AsW_Menu_Main_Tab_Button) == 0x000060, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::K2Node_DynamicCast_AsW_Menu_Main_Tab_Button' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Array_Length_ReturnValue_2) == 0x000074, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, Temp_int_Loop_Counter_Variable_2) == 0x00007C, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Less_IntInt_ReturnValue_2) == 0x000080, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab, CallFunc_Add_IntInt_ReturnValue_2) == 0x000084, "Member 'W_Menu_MainTab_C_ExecuteUbergraph_W_Menu_MainTab::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function W_Menu_MainTab.W_Menu_MainTab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Menu_MainTab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_MainTab_C_PreConstruct) == 0x000001, "Wrong alignment on W_Menu_MainTab_C_PreConstruct");
static_assert(sizeof(W_Menu_MainTab_C_PreConstruct) == 0x000001, "Wrong size on W_Menu_MainTab_C_PreConstruct");
static_assert(offsetof(W_Menu_MainTab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Menu_MainTab_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Menu_MainTab.W_Menu_MainTab_C.Select Tab
// 0x0004 (0x0004 - 0x0000)
struct W_Menu_MainTab_C_Select_Tab final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_MainTab_C_Select_Tab) == 0x000004, "Wrong alignment on W_Menu_MainTab_C_Select_Tab");
static_assert(sizeof(W_Menu_MainTab_C_Select_Tab) == 0x000004, "Wrong size on W_Menu_MainTab_C_Select_Tab");
static_assert(offsetof(W_Menu_MainTab_C_Select_Tab, ID) == 0x000000, "Member 'W_Menu_MainTab_C_Select_Tab::ID' has a wrong offset!");

}

