#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function W_Menu.W_Menu_C.BndEvt__W_Menu_W_MainMenu_K2Node_ComponentBoundEvent_0_On Select__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Menu_C_BndEvt__W_Menu_W_MainMenu_K2Node_ComponentBoundEvent_0_On_Select__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_C_BndEvt__W_Menu_W_MainMenu_K2Node_ComponentBoundEvent_0_On_Select__DelegateSignature) == 0x000004, "Wrong alignment on W_Menu_C_BndEvt__W_Menu_W_MainMenu_K2Node_ComponentBoundEvent_0_On_Select__DelegateSignature");
static_assert(sizeof(W_Menu_C_BndEvt__W_Menu_W_MainMenu_K2Node_ComponentBoundEvent_0_On_Select__DelegateSignature) == 0x000004, "Wrong size on W_Menu_C_BndEvt__W_Menu_W_MainMenu_K2Node_ComponentBoundEvent_0_On_Select__DelegateSignature");
static_assert(offsetof(W_Menu_C_BndEvt__W_Menu_W_MainMenu_K2Node_ComponentBoundEvent_0_On_Select__DelegateSignature, Index_0) == 0x000000, "Member 'W_Menu_C_BndEvt__W_Menu_W_MainMenu_K2Node_ComponentBoundEvent_0_On_Select__DelegateSignature::Index_0' has a wrong offset!");

// Function W_Menu.W_Menu_C.Center Mouse
// 0x0058 (0x0058 - 0x0000)
struct W_Menu_C_Center_Mouse final
{
public:
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_C_Center_Mouse) == 0x000008, "Wrong alignment on W_Menu_C_Center_Mouse");
static_assert(sizeof(W_Menu_C_Center_Mouse) == 0x000058, "Wrong size on W_Menu_C_Center_Mouse");
static_assert(offsetof(W_Menu_C_Center_Mouse, CallFunc_GetViewportSize_ReturnValue) == 0x000000, "Member 'W_Menu_C_Center_Mouse::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Center_Mouse, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000010, "Member 'W_Menu_C_Center_Mouse::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Center_Mouse, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'W_Menu_C_Center_Mouse::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Center_Mouse, CallFunc_BreakVector2D_X) == 0x000028, "Member 'W_Menu_C_Center_Mouse::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Center_Mouse, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'W_Menu_C_Center_Mouse::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Center_Mouse, CallFunc_FTrunc_ReturnValue) == 0x000038, "Member 'W_Menu_C_Center_Mouse::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Center_Mouse, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'W_Menu_C_Center_Mouse::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Center_Mouse, CallFunc_FTrunc_ReturnValue_1) == 0x000050, "Member 'W_Menu_C_Center_Mouse::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

// Function W_Menu.W_Menu_C.Clamp Mouse Location
// 0x00A0 (0x00A0 - 0x0000)
struct W_Menu_C_Clamp_Mouse_Location final
{
public:
	struct FVector2D                              DeadZone;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue_1;            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_C_Clamp_Mouse_Location) == 0x000008, "Wrong alignment on W_Menu_C_Clamp_Mouse_Location");
static_assert(sizeof(W_Menu_C_Clamp_Mouse_Location) == 0x0000A0, "Wrong size on W_Menu_C_Clamp_Mouse_Location");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, DeadZone) == 0x000000, "Member 'W_Menu_C_Clamp_Mouse_Location::DeadZone' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_GetViewportSize_ReturnValue) == 0x000010, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_BreakVector2D_X) == 0x000028, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_GetViewportSize_ReturnValue_1) == 0x000038, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_GetViewportSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000048, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_BreakVector2D_X_1) == 0x000058, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_BreakVector2D_Y_1) == 0x000060, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_BreakVector2D_X_2) == 0x000068, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_BreakVector2D_Y_2) == 0x000070, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000078, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_FTrunc_ReturnValue) == 0x000098, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_Clamp_Mouse_Location, CallFunc_FTrunc_ReturnValue_1) == 0x00009C, "Member 'W_Menu_C_Clamp_Mouse_Location::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

// Function W_Menu.W_Menu_C.Down Mouse
// 0x0004 (0x0004 - 0x0000)
struct W_Menu_C_Down_Mouse final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_C_Down_Mouse) == 0x000004, "Wrong alignment on W_Menu_C_Down_Mouse");
static_assert(sizeof(W_Menu_C_Down_Mouse) == 0x000004, "Wrong size on W_Menu_C_Down_Mouse");
static_assert(offsetof(W_Menu_C_Down_Mouse, Value) == 0x000000, "Member 'W_Menu_C_Down_Mouse::Value' has a wrong offset!");

// Function W_Menu.W_Menu_C.ExecuteUbergraph_W_Menu
// 0x03F0 (0x03F0 - 0x0000)
struct W_Menu_C_ExecuteUbergraph_W_Menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Get_Mouse_Relative_Location_Location;     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0058(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0080(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_InputActionValueToAxis2D_ReturnValue; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMousePosition_LocationX;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMousePosition_LocationY;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMousePosition_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00FC(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True;                           // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0180(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x01A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Get_Mouse_Location_Coordinate;            // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0200(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0228(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_1;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Range___;                             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Delta__;                                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Range____1;                           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_2;           // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Range____2;                           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_3;           // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Range____3;                           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_4;           // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Range____4;                           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_1;          // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_2;          // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_3;          // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Delta___1;                                // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Delta___2;                                // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Delta___3;                                // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_4;          // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_5;          // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_2;                  // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_3;                  // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Mouse_Down_Lerp_ImplicitCast;   // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Range_Value_ImplicitCast;             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Range_Value_ImplicitCast_1;           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Range_Value_ImplicitCast_2;           // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Range_Value_ImplicitCast_3;           // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast_1;         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_C_ExecuteUbergraph_W_Menu) == 0x000008, "Wrong alignment on W_Menu_C_ExecuteUbergraph_W_Menu");
static_assert(sizeof(W_Menu_C_ExecuteUbergraph_W_Menu) == 0x0003F0, "Wrong size on W_Menu_C_ExecuteUbergraph_W_Menu");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, EntryPoint) == 0x000000, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Get_Mouse_Relative_Location_Location) == 0x000008, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Get_Mouse_Relative_Location_Location' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000018, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_BreakVector2D_X) == 0x000028, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_object_Variable) == 0x000038, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable) == 0x000040, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable_1) == 0x000048, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_bool_Variable) == 0x000050, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000058, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000078, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00007C, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000080, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_object_Variable_1) == 0x000088, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Conv_InputActionValueToAxis2D_ReturnValue) == 0x000090, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Conv_InputActionValueToAxis2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable_2) == 0x0000A0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable_3) == 0x0000A8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable_2_0) == 0x0000B0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable_3_0) == 0x0000B8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_struct_Variable) == 0x0000C0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_BreakVector2D_X_1) == 0x0000D0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_BreakVector2D_Y_1) == 0x0000D8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_FTrunc_ReturnValue) == 0x0000E0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_FTrunc_ReturnValue_1) == 0x0000E4, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetMousePosition_LocationX) == 0x0000F0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetMousePosition_LocationX' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetMousePosition_LocationY) == 0x0000F4, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetMousePosition_LocationY' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetMousePosition_ReturnValue) == 0x0000F8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetMousePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_Event_MyGeometry) == 0x0000FC, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_Event_InDeltaTime) == 0x000134, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_MakeVector2D_ReturnValue) == 0x000138, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_CustomEvent_True) == 0x000148, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_CustomEvent_True' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000150, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000158, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000160, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_PlayAnimationForward_ReturnValue) == 0x000168, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000170, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_ComponentBoundEvent_Index) == 0x000178, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_Event_IsDesignTime) == 0x00017C, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000180, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x0001A0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x0001A4, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x0001A8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable_0) == 0x0001B0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable_1_0) == 0x0001B8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0001C0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Get_Mouse_Location_Coordinate) == 0x0001C8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Get_Mouse_Location_Coordinate' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetPlayerController_ReturnValue) == 0x0001D8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_BreakVector2D_X_2) == 0x0001E0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_BreakVector2D_Y_2) == 0x0001E8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_FTrunc_ReturnValue_2) == 0x0001F0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_FTrunc_ReturnValue_3) == 0x0001F4, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001F8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000200, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000220, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000224, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000228, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable_1) == 0x000230, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, Temp_real_Variable_1_1) == 0x000238, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::Temp_real_Variable_1_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000240, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SelectFloat_ReturnValue) == 0x000248, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_CustomEvent_Value) == 0x000250, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000254, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Map_Range___) == 0x000258, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Map_Range___' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Lerp_ReturnValue) == 0x000260, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000268, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SelectFloat_ReturnValue_1) == 0x000270, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Delta__) == 0x000278, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Delta__' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_FInterpTo_ReturnValue) == 0x000280, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetRenderOpacity_ReturnValue) == 0x000288, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x00028C, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Map_Range____1) == 0x000290, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Map_Range____1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetRenderOpacity_ReturnValue_2) == 0x000298, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetRenderOpacity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Map_Range____2) == 0x0002A0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Map_Range____2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetRenderOpacity_ReturnValue_3) == 0x0002A8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetRenderOpacity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002B0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Map_Range____3) == 0x0002B8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Map_Range____3' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetRenderOpacity_ReturnValue_4) == 0x0002C0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetRenderOpacity_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SelectFloat_ReturnValue_2) == 0x0002C8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Map_Range____4) == 0x0002D0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Map_Range____4' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x0002D8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SelectFloat_ReturnValue_3) == 0x0002E0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetEffectMaterial_ReturnValue) == 0x0002E8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetEffectMaterial_ReturnValue_1) == 0x0002F0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetEffectMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetEffectMaterial_ReturnValue_2) == 0x0002F8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetEffectMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetEffectMaterial_ReturnValue_3) == 0x000300, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetEffectMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Delta___1) == 0x000308, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Delta___1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_FInterpTo_ReturnValue_1) == 0x000310, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Delta___2) == 0x000318, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Delta___2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Delta___3) == 0x000320, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Delta___3' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetEffectMaterial_ReturnValue_4) == 0x000328, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetEffectMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_GetEffectMaterial_ReturnValue_5) == 0x000330, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_GetEffectMaterial_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000338, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_FInterpTo_ReturnValue_2) == 0x000348, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_FInterpTo_ReturnValue_3) == 0x000350, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_FInterpTo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_MakeStruct_LinearColor) == 0x000358, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000368, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000370, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_VariableSet_Mouse_Down_Lerp_ImplicitCast) == 0x000378, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_VariableSet_Mouse_Down_Lerp_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000380, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000384, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000388, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x00038C, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000390, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Map_Range_Value_ImplicitCast) == 0x000398, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Map_Range_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, K2Node_MakeStruct_B_ImplicitCast) == 0x0003A0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Map_Range_Value_ImplicitCast_1) == 0x0003A8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Map_Range_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x0003B0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Map_Range_Value_ImplicitCast_2) == 0x0003B8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Map_Range_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x0003C0, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x0003C4, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(W_Menu_C_ExecuteUbergraph_W_Menu, CallFunc_Map_Range_Value_ImplicitCast_3) == 0x0003C8, "Member 'W_Menu_C_ExecuteUbergraph_W_Menu::CallFunc_Map_Range_Value_ImplicitCast_3' has a wrong offset!");
