#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_MainTabButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Menu_MainTabButton.W_Menu_MainTabButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Menu_MainTabButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_MainTabButton_C_PreConstruct) == 0x000001, "Wrong alignment on W_Menu_MainTabButton_C_PreConstruct");
static_assert(sizeof(W_Menu_MainTabButton_C_PreConstruct) == 0x000001, "Wrong size on W_Menu_MainTabButton_C_PreConstruct");
static_assert(offsetof(W_Menu_MainTabButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Menu_MainTabButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Menu_MainTabButton.W_Menu_MainTabButton_C.Set Selection
// 0x0001 (0x0001 - 0x0000)
struct W_Menu_MainTabButton_C_Set_Selection final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_MainTabButton_C_Set_Selection) == 0x000001, "Wrong alignment on W_Menu_MainTabButton_C_Set_Selection");
static_assert(sizeof(W_Menu_MainTabButton_C_Set_Selection) == 0x000001, "Wrong size on W_Menu_MainTabButton_C_Set_Selection");
static_assert(offsetof(W_Menu_MainTabButton_C_Set_Selection, TRUE_0) == 0x000000, "Member 'W_Menu_MainTabButton_C_Set_Selection::TRUE_0' has a wrong offset!");

// Function W_Menu_MainTabButton.W_Menu_MainTabButton_C.ExecuteUbergraph_W_Menu_MainTabButton
// 0x00F0 (0x00F0 - 0x0000)
struct W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0020(0x00B0)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton) == 0x000010, "Wrong alignment on W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton");
static_assert(sizeof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton) == 0x0000F0, "Wrong size on W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton");
static_assert(offsetof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton, EntryPoint) == 0x000000, "Member 'W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton, K2Node_Event_IsDesignTime) == 0x000018, "Member 'W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton, K2Node_CustomEvent_True) == 0x000019, "Member 'W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton::K2Node_CustomEvent_True' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton, K2Node_MakeStruct_SlateBrush) == 0x000020, "Member 'W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000D0, "Member 'W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000D8, "Member 'W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x0000E0, "Member 'W_Menu_MainTabButton_C_ExecuteUbergraph_W_Menu_MainTabButton::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");

}

