#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerFromList

#include "Basic.hpp"

#include "SteamCorePro_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerFromList.W_PlayerFromList_C.ExecuteUbergraph_W_PlayerFromList
// 0x0078 (0x0078 - 0x0000)
struct W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_C*                                  K2Node_DynamicCast_AsGM_1;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0058(0x0010)()
	bool                                          CallFunc_KickPlayer_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               CallFunc_GetSteamIdFromPlayerState_ReturnValue;    // 0x0070(0x0008)(NoDestructor)
};
static_assert(alignof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList) == 0x000008, "Wrong alignment on W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList");
static_assert(sizeof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList) == 0x000078, "Wrong size on W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, EntryPoint) == 0x000000, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, CallFunc_GetGameMode_ReturnValue) == 0x000028, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, CallFunc_GetGameMode_ReturnValue_1) == 0x000030, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, K2Node_DynamicCast_AsGM) == 0x000038, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, K2Node_DynamicCast_AsGM_1) == 0x000048, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::K2Node_DynamicCast_AsGM_1' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, CallFunc_MakeLiteralText_ReturnValue) == 0x000058, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, CallFunc_KickPlayer_ReturnValue) == 0x000068, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::CallFunc_KickPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList, CallFunc_GetSteamIdFromPlayerState_ReturnValue) == 0x000070, "Member 'W_PlayerFromList_C_ExecuteUbergraph_W_PlayerFromList::CallFunc_GetSteamIdFromPlayerState_ReturnValue' has a wrong offset!");

}

