#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Player_List

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Player_List.W_Player_List_C.ExecuteUbergraph_W_Player_List
// 0x0038 (0x0038 - 0x0000)
struct W_Player_List_C_ExecuteUbergraph_W_Player_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Player_List_C_ExecuteUbergraph_W_Player_List) == 0x000008, "Wrong alignment on W_Player_List_C_ExecuteUbergraph_W_Player_List");
static_assert(sizeof(W_Player_List_C_ExecuteUbergraph_W_Player_List) == 0x000038, "Wrong size on W_Player_List_C_ExecuteUbergraph_W_Player_List");
static_assert(offsetof(W_Player_List_C_ExecuteUbergraph_W_Player_List, EntryPoint) == 0x000000, "Member 'W_Player_List_C_ExecuteUbergraph_W_Player_List::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Player_List_C_ExecuteUbergraph_W_Player_List, CallFunc_Left_ReturnValue) == 0x000008, "Member 'W_Player_List_C_ExecuteUbergraph_W_Player_List::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Player_List_C_ExecuteUbergraph_W_Player_List, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'W_Player_List_C_ExecuteUbergraph_W_Player_List::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Player_List_C_ExecuteUbergraph_W_Player_List, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'W_Player_List_C_ExecuteUbergraph_W_Player_List::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Player_List_C_ExecuteUbergraph_W_Player_List, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000030, "Member 'W_Player_List_C_ExecuteUbergraph_W_Player_List::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

}

