#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerDoorInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerDoorInfo.W_PlayerDoorInfo_C
// 0x0030 (0x0300 - 0x02D0)
class UW_PlayerDoorInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Hidder;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txt_index;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txt_name;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txt_ready;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlayerDoorInfo(int32 EntryPoint);
	void Set_Hidder(bool Hide);
	void Set_Image(class UObject* Image);
	void Set_Index(int32 Index_0);
	void Set_Name(const class FString& Name_0);
	void Set_Ready(bool Ready);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PlayerDoorInfo_C">();
	}
	static class UW_PlayerDoorInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlayerDoorInfo_C>();
	}
};
static_assert(alignof(UW_PlayerDoorInfo_C) == 0x000008, "Wrong alignment on UW_PlayerDoorInfo_C");
static_assert(sizeof(UW_PlayerDoorInfo_C) == 0x000300, "Wrong size on UW_PlayerDoorInfo_C");
static_assert(offsetof(UW_PlayerDoorInfo_C, UberGraphFrame) == 0x0002D0, "Member 'UW_PlayerDoorInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerDoorInfo_C, Hidder) == 0x0002D8, "Member 'UW_PlayerDoorInfo_C::Hidder' has a wrong offset!");
static_assert(offsetof(UW_PlayerDoorInfo_C, Image_0) == 0x0002E0, "Member 'UW_PlayerDoorInfo_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_PlayerDoorInfo_C, txt_index) == 0x0002E8, "Member 'UW_PlayerDoorInfo_C::txt_index' has a wrong offset!");
static_assert(offsetof(UW_PlayerDoorInfo_C, txt_name) == 0x0002F0, "Member 'UW_PlayerDoorInfo_C::txt_name' has a wrong offset!");
static_assert(offsetof(UW_PlayerDoorInfo_C, txt_ready) == 0x0002F8, "Member 'UW_PlayerDoorInfo_C::txt_ready' has a wrong offset!");

}

