#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Rice_Screen

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Rice_Screen.W_Rice_Screen_C.ExecuteUbergraph_W_Rice_Screen
// 0x0048 (0x0048 - 0x0000)
struct W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Title;                          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Indication;                     // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0038(0x0010)()
};
static_assert(alignof(W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen) == 0x000008, "Wrong alignment on W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen");
static_assert(sizeof(W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen) == 0x000048, "Wrong size on W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen");
static_assert(offsetof(W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen, EntryPoint) == 0x000000, "Member 'W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen, K2Node_CustomEvent_Title) == 0x000008, "Member 'W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen::K2Node_CustomEvent_Title' has a wrong offset!");
static_assert(offsetof(W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen, K2Node_CustomEvent_Indication) == 0x000018, "Member 'W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen::K2Node_CustomEvent_Indication' has a wrong offset!");
static_assert(offsetof(W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000038, "Member 'W_Rice_Screen_C_ExecuteUbergraph_W_Rice_Screen::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function W_Rice_Screen.W_Rice_Screen_C.Set Text
// 0x0020 (0x0020 - 0x0000)
struct W_Rice_Screen_C_Set_Text final
{
public:
	class FString                                 Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Indication;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Rice_Screen_C_Set_Text) == 0x000008, "Wrong alignment on W_Rice_Screen_C_Set_Text");
static_assert(sizeof(W_Rice_Screen_C_Set_Text) == 0x000020, "Wrong size on W_Rice_Screen_C_Set_Text");
static_assert(offsetof(W_Rice_Screen_C_Set_Text, Title) == 0x000000, "Member 'W_Rice_Screen_C_Set_Text::Title' has a wrong offset!");
static_assert(offsetof(W_Rice_Screen_C_Set_Text, Indication) == 0x000010, "Member 'W_Rice_Screen_C_Set_Text::Indication' has a wrong offset!");

}

