#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Rules

#include "Basic.hpp"

#include "Str_GunSettings_structs.hpp"


namespace SDK::Params
{

// Function W_Rules.W_Rules_C.ExecuteUbergraph_W_Rules
// 0x0088 (0x0088 - 0x0000)
struct W_Rules_C_ExecuteUbergraph_W_Rules final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_6;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_7;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_8;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_9;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_10;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_11;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Charge_Speed_ImplicitCast;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Rules_C_ExecuteUbergraph_W_Rules) == 0x000008, "Wrong alignment on W_Rules_C_ExecuteUbergraph_W_Rules");
static_assert(sizeof(W_Rules_C_ExecuteUbergraph_W_Rules) == 0x000088, "Wrong size on W_Rules_C_ExecuteUbergraph_W_Rules");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, EntryPoint) == 0x000000, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, K2Node_DynamicCast_AsGM) == 0x000010, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000030, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000038, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000040, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_5) == 0x000048, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_6) == 0x000050, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_7) == 0x000058, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_8) == 0x000060, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_9) == 0x000068, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_10) == 0x000070, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, CallFunc_Conv_IntToDouble_ReturnValue_11) == 0x000078, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::CallFunc_Conv_IntToDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(W_Rules_C_ExecuteUbergraph_W_Rules, K2Node_VariableSet_Charge_Speed_ImplicitCast) == 0x000080, "Member 'W_Rules_C_ExecuteUbergraph_W_Rules::K2Node_VariableSet_Charge_Speed_ImplicitCast' has a wrong offset!");

// Function W_Rules.W_Rules_C.Get Settings
// 0x01C0 (0x01C0 - 0x0000)
struct W_Rules_C_Get_Settings final
{
public:
	class UData_Gun_C*                            Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStr_GunSettings                       Settings;                                          // 0x0008(0x00D8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_GunSettings                       K2Node_MakeStruct_Str_GunSettings;                 // 0x00E8(0x00D8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Rules_C_Get_Settings) == 0x000008, "Wrong alignment on W_Rules_C_Get_Settings");
static_assert(sizeof(W_Rules_C_Get_Settings) == 0x0001C0, "Wrong size on W_Rules_C_Get_Settings");
static_assert(offsetof(W_Rules_C_Get_Settings, Data) == 0x000000, "Member 'W_Rules_C_Get_Settings::Data' has a wrong offset!");
static_assert(offsetof(W_Rules_C_Get_Settings, Settings) == 0x000008, "Member 'W_Rules_C_Get_Settings::Settings' has a wrong offset!");
static_assert(offsetof(W_Rules_C_Get_Settings, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000E0, "Member 'W_Rules_C_Get_Settings::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Rules_C_Get_Settings, K2Node_MakeStruct_Str_GunSettings) == 0x0000E8, "Member 'W_Rules_C_Get_Settings::K2Node_MakeStruct_Str_GunSettings' has a wrong offset!");

}

