#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ScannerUpdate_UI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Str_ScannerDot_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_ScannerUpdate_UI.W_ScannerUpdate_UI_C.Update MainRotation
// 0x0018 (0x0018 - 0x0000)
struct W_ScannerUpdate_UI_C_Update_MainRotation final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_ScannerUpdate_UI_C_Update_MainRotation) == 0x000008, "Wrong alignment on W_ScannerUpdate_UI_C_Update_MainRotation");
static_assert(sizeof(W_ScannerUpdate_UI_C_Update_MainRotation) == 0x000018, "Wrong size on W_ScannerUpdate_UI_C_Update_MainRotation");
static_assert(offsetof(W_ScannerUpdate_UI_C_Update_MainRotation, Rotation) == 0x000000, "Member 'W_ScannerUpdate_UI_C_Update_MainRotation::Rotation' has a wrong offset!");

// Function W_ScannerUpdate_UI.W_ScannerUpdate_UI_C.Show Dot
// 0x0001 (0x0001 - 0x0000)
struct W_ScannerUpdate_UI_C_Show_Dot final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ScannerUpdate_UI_C_Show_Dot) == 0x000001, "Wrong alignment on W_ScannerUpdate_UI_C_Show_Dot");
static_assert(sizeof(W_ScannerUpdate_UI_C_Show_Dot) == 0x000001, "Wrong size on W_ScannerUpdate_UI_C_Show_Dot");
static_assert(offsetof(W_ScannerUpdate_UI_C_Show_Dot, TRUE_0) == 0x000000, "Member 'W_ScannerUpdate_UI_C_Show_Dot::TRUE_0' has a wrong offset!");

// Function W_ScannerUpdate_UI.W_ScannerUpdate_UI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ScannerUpdate_UI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ScannerUpdate_UI_C_PreConstruct) == 0x000001, "Wrong alignment on W_ScannerUpdate_UI_C_PreConstruct");
static_assert(sizeof(W_ScannerUpdate_UI_C_PreConstruct) == 0x000001, "Wrong size on W_ScannerUpdate_UI_C_PreConstruct");
static_assert(offsetof(W_ScannerUpdate_UI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ScannerUpdate_UI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ScannerUpdate_UI.W_ScannerUpdate_UI_C.ExecuteUbergraph_W_ScannerUpdate_UI
// 0x02F8 (0x02F8 - 0x0000)
struct W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStr_ScannerDot>                K2Node_CustomEvent_Targets;                        // 0x0040(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ScannerDot                        CallFunc_Array_Get_Item;                           // 0x0060(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_3;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0120(0x0038)(NoDestructor)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_1;               // 0x0158(0x0038)(NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_2;               // 0x01A8(0x0038)(NoDestructor)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_5;               // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_4;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_3;               // 0x0210(0x0038)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Scanner_TargetDot_C*                 CallFunc_Array_Get_Item_1;                         // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0260(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Scanner_TargetDot_C*                 CallFunc_Create_ReturnValue;                       // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True;                           // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_ScannerDot                        K2Node_MakeStruct_Str_ScannerDot;                  // 0x0288(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_Angle_ImplicitCast;             // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_Angle_ImplicitCast_1;           // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast_1;     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_1;      // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_2;      // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_3;      // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI) == 0x000008, "Wrong alignment on W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI");
static_assert(sizeof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI) == 0x0002F8, "Wrong size on W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, EntryPoint) == 0x000000, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_Event_IsDesignTime) == 0x000010, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_CustomEvent_Rotation) == 0x000018, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_BreakRotator_Roll) == 0x000030, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_BreakRotator_Pitch) == 0x000034, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_BreakRotator_Yaw) == 0x000038, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_CustomEvent_Targets) == 0x000040, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Array_Get_Item) == 0x000060, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_BreakVector2D_X) == 0x000080, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_BreakVector2D_Y) == 0x000088, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MapRangeClamped_ReturnValue) == 0x000090, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_BreakVector2D_X_1) == 0x000098, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_BreakVector2D_Y_1) == 0x0000A0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0000B0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_ClampAxis_ReturnValue) == 0x0000B8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_ClampAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0000C8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_ClampAxis_ReturnValue_1) == 0x0000D0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_ClampAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000D8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MapRangeClamped_ReturnValue_3) == 0x0000E8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_BreakVector2D_X_2) == 0x0000F0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_BreakVector2D_Y_2) == 0x0000F8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MakeVector2D_ReturnValue_2) == 0x000100, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MakeVector2D_ReturnValue_3) == 0x000110, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_MakeStruct_WidgetTransform) == 0x000120, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_MakeStruct_WidgetTransform_1) == 0x000158, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_MakeStruct_WidgetTransform_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MakeVector2D_ReturnValue_4) == 0x000190, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MakeVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_MakeStruct_WidgetTransform_2) == 0x0001A8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_MakeStruct_WidgetTransform_2' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_SelectFloat_ReturnValue) == 0x0001E0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0001E8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Abs_ReturnValue) == 0x0001F0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MakeVector2D_ReturnValue_5) == 0x0001F8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MakeVector2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MapRangeClamped_ReturnValue_4) == 0x000208, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MapRangeClamped_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_MakeStruct_WidgetTransform_3) == 0x000210, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_MakeStruct_WidgetTransform_3' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Array_Length_ReturnValue) == 0x000248, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Less_IntInt_ReturnValue) == 0x00024C, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_CustomEvent_Index) == 0x000250, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Array_Get_Item_1) == 0x000258, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, Temp_struct_Variable) == 0x000260, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Create_ReturnValue) == 0x000270, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_CustomEvent_True) == 0x000278, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_CustomEvent_True' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000280, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, K2Node_MakeStruct_Str_ScannerDot) == 0x000288, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::K2Node_MakeStruct_Str_ScannerDot' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_AddChild_ReturnValue) == 0x0002A8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002B0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x0002B8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MakeVector2D_X_ImplicitCast) == 0x0002C0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_ClampAxis_Angle_ImplicitCast) == 0x0002C8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_ClampAxis_Angle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x0002D0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_ClampAxis_Angle_ImplicitCast_1) == 0x0002D8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_ClampAxis_Angle_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_MapRangeClamped_Value_ImplicitCast_1) == 0x0002E0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_MapRangeClamped_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x0002E8, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_SetOpacity_InOpacity_ImplicitCast_1) == 0x0002EC, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_SetOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_SetOpacity_InOpacity_ImplicitCast_2) == 0x0002F0, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_SetOpacity_InOpacity_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI, CallFunc_SetOpacity_InOpacity_ImplicitCast_3) == 0x0002F4, "Member 'W_ScannerUpdate_UI_C_ExecuteUbergraph_W_ScannerUpdate_UI::CallFunc_SetOpacity_InOpacity_ImplicitCast_3' has a wrong offset!");

// Function W_ScannerUpdate_UI.W_ScannerUpdate_UI_C.Delete Target
// 0x0004 (0x0004 - 0x0000)
struct W_ScannerUpdate_UI_C_Delete_Target final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ScannerUpdate_UI_C_Delete_Target) == 0x000004, "Wrong alignment on W_ScannerUpdate_UI_C_Delete_Target");
static_assert(sizeof(W_ScannerUpdate_UI_C_Delete_Target) == 0x000004, "Wrong size on W_ScannerUpdate_UI_C_Delete_Target");
static_assert(offsetof(W_ScannerUpdate_UI_C_Delete_Target, Index_0) == 0x000000, "Member 'W_ScannerUpdate_UI_C_Delete_Target::Index_0' has a wrong offset!");

// Function W_ScannerUpdate_UI.W_ScannerUpdate_UI_C.Add Targets
// 0x0010 (0x0010 - 0x0000)
struct W_ScannerUpdate_UI_C_Add_Targets final
{
public:
	TArray<struct FStr_ScannerDot>                Targets_0;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(W_ScannerUpdate_UI_C_Add_Targets) == 0x000008, "Wrong alignment on W_ScannerUpdate_UI_C_Add_Targets");
static_assert(sizeof(W_ScannerUpdate_UI_C_Add_Targets) == 0x000010, "Wrong size on W_ScannerUpdate_UI_C_Add_Targets");
static_assert(offsetof(W_ScannerUpdate_UI_C_Add_Targets, Targets_0) == 0x000000, "Member 'W_ScannerUpdate_UI_C_Add_Targets::Targets_0' has a wrong offset!");

}

