#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Selector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_Selector.W_Selector_C.Get target Padding
// 0x0128 (0x0128 - 0x0000)
struct W_Selector_C_Get_target_Padding final
{
public:
	double                                        Left;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Right;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0028(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_SelectorPart_C*                      CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_1;          // 0x0090(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue;              // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue_1;               // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Selector_C_Get_target_Padding) == 0x000008, "Wrong alignment on W_Selector_C_Get_target_Padding");
static_assert(sizeof(W_Selector_C_Get_target_Padding) == 0x000128, "Wrong size on W_Selector_C_Get_target_Padding");
static_assert(offsetof(W_Selector_C_Get_target_Padding, Left) == 0x000000, "Member 'W_Selector_C_Get_target_Padding::Left' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, Right) == 0x000008, "Member 'W_Selector_C_Get_target_Padding::Right' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'W_Selector_C_Get_target_Padding::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'W_Selector_C_Get_target_Padding::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_Array_LastIndex_ReturnValue) == 0x000020, "Member 'W_Selector_C_Get_target_Padding::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000024, "Member 'W_Selector_C_Get_target_Padding::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_GetCachedGeometry_ReturnValue) == 0x000028, "Member 'W_Selector_C_Get_target_Padding::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_SelectFloat_ReturnValue_1) == 0x000060, "Member 'W_Selector_C_Get_target_Padding::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_GetLocalSize_ReturnValue) == 0x000068, "Member 'W_Selector_C_Get_target_Padding::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_BreakVector2D_X) == 0x000078, "Member 'W_Selector_C_Get_target_Padding::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_BreakVector2D_Y) == 0x000080, "Member 'W_Selector_C_Get_target_Padding::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_Array_Get_Item) == 0x000088, "Member 'W_Selector_C_Get_target_Padding::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_GetCachedGeometry_ReturnValue_1) == 0x000090, "Member 'W_Selector_C_Get_target_Padding::CallFunc_GetCachedGeometry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_GetLocalTopLeft_ReturnValue) == 0x0000C8, "Member 'W_Selector_C_Get_target_Padding::CallFunc_GetLocalTopLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_GetLocalSize_ReturnValue_1) == 0x0000D8, "Member 'W_Selector_C_Get_target_Padding::CallFunc_GetLocalSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_BreakVector2D_X_1) == 0x0000E8, "Member 'W_Selector_C_Get_target_Padding::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_BreakVector2D_Y_1) == 0x0000F0, "Member 'W_Selector_C_Get_target_Padding::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_BreakVector2D_X_2) == 0x0000F8, "Member 'W_Selector_C_Get_target_Padding::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_BreakVector2D_Y_2) == 0x000100, "Member 'W_Selector_C_Get_target_Padding::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000108, "Member 'W_Selector_C_Get_target_Padding::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'W_Selector_C_Get_target_Padding::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000118, "Member 'W_Selector_C_Get_target_Padding::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Get_target_Padding, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000120, "Member 'W_Selector_C_Get_target_Padding::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function W_Selector.W_Selector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Selector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Selector_C_PreConstruct) == 0x000001, "Wrong alignment on W_Selector_C_PreConstruct");
static_assert(sizeof(W_Selector_C_PreConstruct) == 0x000001, "Wrong size on W_Selector_C_PreConstruct");
static_assert(offsetof(W_Selector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Selector_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Selector.W_Selector_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Selector_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Selector_C_Tick) == 0x000004, "Wrong alignment on W_Selector_C_Tick");
static_assert(sizeof(W_Selector_C_Tick) == 0x00003C, "Wrong size on W_Selector_C_Tick");
static_assert(offsetof(W_Selector_C_Tick, MyGeometry) == 0x000000, "Member 'W_Selector_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Selector_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Selector_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_Selector.W_Selector_C.Select
// 0x0004 (0x0004 - 0x0000)
struct W_Selector_C_Select final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Selector_C_Select) == 0x000004, "Wrong alignment on W_Selector_C_Select");
static_assert(sizeof(W_Selector_C_Select) == 0x000004, "Wrong size on W_Selector_C_Select");
static_assert(offsetof(W_Selector_C_Select, Index_0) == 0x000000, "Member 'W_Selector_C_Select::Index_0' has a wrong offset!");

// Function W_Selector.W_Selector_C.ExecuteUbergraph_W_Selector
// 0x0178 (0x0178 - 0x0000)
struct W_Selector_C_ExecuteUbergraph_W_Selector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_Menu_C*>                      CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_SelectorPart_C*                      CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Menu_C*                              CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_SelectorPart_C*                      CallFunc_Array_Get_Item_2;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Delta__;                                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Delta___1;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_target_Padding_Left;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_target_Padding_Right;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue_1;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_target_Padding_Left_1;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_target_Padding_Right_1;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast_1;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast_1;   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Selector_C_ExecuteUbergraph_W_Selector) == 0x000008, "Wrong alignment on W_Selector_C_ExecuteUbergraph_W_Selector");
static_assert(sizeof(W_Selector_C_ExecuteUbergraph_W_Selector) == 0x000178, "Wrong size on W_Selector_C_ExecuteUbergraph_W_Selector");
static_assert(offsetof(W_Selector_C_ExecuteUbergraph_W_Selector, EntryPoint) == 0x000000, "Member 'W_Selector_C_ExecuteUbergraph_W_Selector::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Selector_C_ExecuteUbergraph_W_Selector, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_Selector_C_ExecuteUbergraph_W_Selector::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Selector_C_ExecuteUbergraph_W_Selector, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_Selector_C_ExecuteUbergraph_W_Selector::Temp_int_Loop_Counter_Variable' has a wrong offset!");
