#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_List_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Settings_List_Item.W_Settings_List_Item_C
// 0x0038 (0x0308 - 0x02D0)
class UW_Settings_List_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selection;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_147;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Selected;                                          // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Settings_List_Item(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Selection(bool TRUE_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Settings_List_Item_C">();
	}
	static class UW_Settings_List_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Settings_List_Item_C>();
	}
};
static_assert(alignof(UW_Settings_List_Item_C) == 0x000008, "Wrong alignment on UW_Settings_List_Item_C");
static_assert(sizeof(UW_Settings_List_Item_C) == 0x000308, "Wrong size on UW_Settings_List_Item_C");
static_assert(offsetof(UW_Settings_List_Item_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Settings_List_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Settings_List_Item_C, Background) == 0x0002D8, "Member 'UW_Settings_List_Item_C::Background' has a wrong offset!");
static_assert(offsetof(UW_Settings_List_Item_C, Selection) == 0x0002E0, "Member 'UW_Settings_List_Item_C::Selection' has a wrong offset!");
static_assert(offsetof(UW_Settings_List_Item_C, TextBlock_147) == 0x0002E8, "Member 'UW_Settings_List_Item_C::TextBlock_147' has a wrong offset!");
static_assert(offsetof(UW_Settings_List_Item_C, Name_0) == 0x0002F0, "Member 'UW_Settings_List_Item_C::Name_0' has a wrong offset!");
static_assert(offsetof(UW_Settings_List_Item_C, Selected) == 0x000300, "Member 'UW_Settings_List_Item_C::Selected' has a wrong offset!");

}

