#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_Name

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Settings_Name.W_Settings_Name_C.ExecuteUbergraph_W_Settings_Name
// 0x0018 (0x0018 - 0x0000)
struct W_Settings_Name_C_ExecuteUbergraph_W_Settings_Name final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0008(0x0010)()
};
static_assert(alignof(W_Settings_Name_C_ExecuteUbergraph_W_Settings_Name) == 0x000008, "Wrong alignment on W_Settings_Name_C_ExecuteUbergraph_W_Settings_Name");
static_assert(sizeof(W_Settings_Name_C_ExecuteUbergraph_W_Settings_Name) == 0x000018, "Wrong size on W_Settings_Name_C_ExecuteUbergraph_W_Settings_Name");
static_assert(offsetof(W_Settings_Name_C_ExecuteUbergraph_W_Settings_Name, EntryPoint) == 0x000000, "Member 'W_Settings_Name_C_ExecuteUbergraph_W_Settings_Name::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Settings_Name_C_ExecuteUbergraph_W_Settings_Name, K2Node_CustomEvent_Name) == 0x000008, "Member 'W_Settings_Name_C_ExecuteUbergraph_W_Settings_Name::K2Node_CustomEvent_Name' has a wrong offset!");

// Function W_Settings_Name.W_Settings_Name_C.Set Name
// 0x0010 (0x0010 - 0x0000)
struct W_Settings_Name_C_Set_Name final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_Settings_Name_C_Set_Name) == 0x000008, "Wrong alignment on W_Settings_Name_C_Set_Name");
static_assert(sizeof(W_Settings_Name_C_Set_Name) == 0x000010, "Wrong size on W_Settings_Name_C_Set_Name");
static_assert(offsetof(W_Settings_Name_C_Set_Name, Name_0) == 0x000000, "Member 'W_Settings_Name_C_Set_Name::Name_0' has a wrong offset!");

}

