#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Selector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Selector.W_Selector_C
// 0x00A8 (0x0378 - 0x02D0)
class UW_Selector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowBackground;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_Trigger_C*                           All_Trigger;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Choice_Overlay;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_NameLine_C*                          W_NameLine;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 Index)>   On_Value_Change;                                   // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UW_Menu_C*                              Menu;                                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Choices;                                           // 0x0328(0x0010)(Edit, BlueprintVisible)
	int32                                         Height;                                            // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_SelectorPart_C*>              Parts;                                             // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Selected_Index;                                    // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Name_Width;                                        // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Detail;                                            // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void Get_target_Padding(double* Left, double* Right);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Select(int32 Index_0);
	void BndEvt__W_Selector_All_Trigger_K2Node_ComponentBoundEvent_0_On_Enter__DelegateSignature();
	void BndEvt__W_Selector_All_Trigger_K2Node_ComponentBoundEvent_1_On_Leave__DelegateSignature();
	void ExecuteUbergraph_W_Selector(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Selector_C">();
	}
	static class UW_Selector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Selector_C>();
	}
};
static_assert(alignof(UW_Selector_C) == 0x000008, "Wrong alignment on UW_Selector_C");
static_assert(sizeof(UW_Selector_C) == 0x000378, "Wrong size on UW_Selector_C");
static_assert(offsetof(UW_Selector_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Selector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, ShowBackground) == 0x0002D8, "Member 'UW_Selector_C::ShowBackground' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, All_Trigger) == 0x0002E0, "Member 'UW_Selector_C::All_Trigger' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Background) == 0x0002E8, "Member 'UW_Selector_C::Background' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Choice_Overlay) == 0x0002F0, "Member 'UW_Selector_C::Choice_Overlay' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, HorizontalBox) == 0x0002F8, "Member 'UW_Selector_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, SizeBox) == 0x000300, "Member 'UW_Selector_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, W_NameLine) == 0x000308, "Member 'UW_Selector_C::W_NameLine' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, On_Value_Change) == 0x000310, "Member 'UW_Selector_C::On_Value_Change' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Menu) == 0x000320, "Member 'UW_Selector_C::Menu' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Choices) == 0x000328, "Member 'UW_Selector_C::Choices' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Height) == 0x000338, "Member 'UW_Selector_C::Height' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Parts) == 0x000340, "Member 'UW_Selector_C::Parts' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Selected_Index) == 0x000350, "Member 'UW_Selector_C::Selected_Index' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Name_Width) == 0x000354, "Member 'UW_Selector_C::Name_Width' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Name_0) == 0x000358, "Member 'UW_Selector_C::Name_0' has a wrong offset!");
static_assert(offsetof(UW_Selector_C, Detail) == 0x000368, "Member 'UW_Selector_C::Detail' has a wrong offset!");

}

