#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_Checkbox

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Settings_Checkbox.W_Settings_Checkbox_C.ExecuteUbergraph_W_Settings_Checkbox
// 0x0018 (0x0018 - 0x0000)
struct W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox) == 0x000008, "Wrong alignment on W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox");
static_assert(sizeof(W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox) == 0x000018, "Wrong size on W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox");
static_assert(offsetof(W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox, EntryPoint) == 0x000000, "Member 'W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox, K2Node_Event_IsDesignTime) == 0x000010, "Member 'W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox, K2Node_CustomEvent_True) == 0x000011, "Member 'W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox::K2Node_CustomEvent_True' has a wrong offset!");
static_assert(offsetof(W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000014, "Member 'W_Settings_Checkbox_C_ExecuteUbergraph_W_Settings_Checkbox::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function W_Settings_Checkbox.W_Settings_Checkbox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Settings_Checkbox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Settings_Checkbox_C_PreConstruct) == 0x000001, "Wrong alignment on W_Settings_Checkbox_C_PreConstruct");
static_assert(sizeof(W_Settings_Checkbox_C_PreConstruct) == 0x000001, "Wrong size on W_Settings_Checkbox_C_PreConstruct");
static_assert(offsetof(W_Settings_Checkbox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Settings_Checkbox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Settings_Checkbox.W_Settings_Checkbox_C.Set Value
// 0x0001 (0x0001 - 0x0000)
struct W_Settings_Checkbox_C_Set_Value final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Settings_Checkbox_C_Set_Value) == 0x000001, "Wrong alignment on W_Settings_Checkbox_C_Set_Value");
static_assert(sizeof(W_Settings_Checkbox_C_Set_Value) == 0x000001, "Wrong size on W_Settings_Checkbox_C_Set_Value");
static_assert(offsetof(W_Settings_Checkbox_C_Set_Value, TRUE_0) == 0x000000, "Member 'W_Settings_Checkbox_C_Set_Value::TRUE_0' has a wrong offset!");

}

