#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_CategorySelector

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Settings_CategorySelector.W_Settings_CategorySelector_C
// 0x0148 (0x0418 - 0x02D0)
class UW_Settings_CategorySelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ArrowL;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArrowL_1;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArrowR;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_1;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonL;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonR;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Container;                                         // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Hidder;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectionText;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0340(0x0010)(Edit, BlueprintVisible)
	class UMainGI_C*                              GI_Ref;                                            // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            Reply;                                             // 0x0358(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Deployed;                                          // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Settings_Banner_Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_Settings_Banner_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_Settings_Banner_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_W_Settings_CategorySelector(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Deployed(bool TRUE_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Settings_CategorySelector_C">();
	}
	static class UW_Settings_CategorySelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Settings_CategorySelector_C>();
	}
};
static_assert(alignof(UW_Settings_CategorySelector_C) == 0x000008, "Wrong alignment on UW_Settings_CategorySelector_C");
static_assert(sizeof(UW_Settings_CategorySelector_C) == 0x000418, "Wrong size on UW_Settings_CategorySelector_C");
static_assert(offsetof(UW_Settings_CategorySelector_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Settings_CategorySelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, ArrowL) == 0x0002D8, "Member 'UW_Settings_CategorySelector_C::ArrowL' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, ArrowL_1) == 0x0002E0, "Member 'UW_Settings_CategorySelector_C::ArrowL_1' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, ArrowR) == 0x0002E8, "Member 'UW_Settings_CategorySelector_C::ArrowR' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Background) == 0x0002F0, "Member 'UW_Settings_CategorySelector_C::Background' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Background_1) == 0x0002F8, "Member 'UW_Settings_CategorySelector_C::Background_1' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Button) == 0x000300, "Member 'UW_Settings_CategorySelector_C::Button' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, ButtonL) == 0x000308, "Member 'UW_Settings_CategorySelector_C::ButtonL' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, ButtonR) == 0x000310, "Member 'UW_Settings_CategorySelector_C::ButtonR' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Container) == 0x000318, "Member 'UW_Settings_CategorySelector_C::Container' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Hidder) == 0x000320, "Member 'UW_Settings_CategorySelector_C::Hidder' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Overlay) == 0x000328, "Member 'UW_Settings_CategorySelector_C::Overlay' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, SelectionText) == 0x000330, "Member 'UW_Settings_CategorySelector_C::SelectionText' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Text) == 0x000338, "Member 'UW_Settings_CategorySelector_C::Text' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Name_0) == 0x000340, "Member 'UW_Settings_CategorySelector_C::Name_0' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, GI_Ref) == 0x000350, "Member 'UW_Settings_CategorySelector_C::GI_Ref' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Reply) == 0x000358, "Member 'UW_Settings_CategorySelector_C::Reply' has a wrong offset!");
static_assert(offsetof(UW_Settings_CategorySelector_C, Deployed) == 0x000410, "Member 'UW_Settings_CategorySelector_C::Deployed' has a wrong offset!");

}

