#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SessionMenu_2

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_SessionMenu_2.W_SessionMenu_2_C.ExecuteUbergraph_W_SessionMenu_2
// 0x0148 (0x0148 - 0x0000)
struct W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0030(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0040(0x0010)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMainGI_C*                              K2Node_DynamicCast_AsMain_GI;                      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_C*                                  K2Node_DynamicCast_AsGM;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMainGI_C*                              K2Node_DynamicCast_AsMain_GI_1;                    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, int64>                    CallFunc_Generate_FilesCode_Files;                 // 0x0098(0x0050)()
	class FString                                 CallFunc_Generate_FilesCode_Code;                  // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F8(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0108(0x0010)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMainGI_C*                              K2Node_DynamicCast_AsMain_GI_2;                    // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0130(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2) == 0x000008, "Wrong alignment on W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2");
static_assert(sizeof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2) == 0x000148, "Wrong size on W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, EntryPoint) == 0x000000, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, Temp_text_Variable) == 0x000008, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, Temp_text_Variable_1) == 0x000018, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, Temp_bool_Variable) == 0x000028, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, Temp_text_Variable_2) == 0x000030, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, Temp_text_Variable_3) == 0x000040, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, CallFunc_GetGameMode_ReturnValue) == 0x000058, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_DynamicCast_AsMain_GI) == 0x000060, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_DynamicCast_AsMain_GI' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_DynamicCast_AsGM) == 0x000070, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_DynamicCast_AsGM' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, CallFunc_GetGameInstance_ReturnValue_1) == 0x000080, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_DynamicCast_AsMain_GI_1) == 0x000088, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_DynamicCast_AsMain_GI_1' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, Temp_bool_Variable_1) == 0x000091, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, CallFunc_Generate_FilesCode_Files) == 0x000098, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::CallFunc_Generate_FilesCode_Files' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, CallFunc_Generate_FilesCode_Code) == 0x0000E8, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::CallFunc_Generate_FilesCode_Code' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F8, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_Select_Default) == 0x000108, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, CallFunc_GetGameInstance_ReturnValue_2) == 0x000118, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_DynamicCast_AsMain_GI_2) == 0x000120, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_DynamicCast_AsMain_GI_2' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, K2Node_Select_Default_1) == 0x000130, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2, CallFunc_Not_PreBool_ReturnValue) == 0x000140, "Member 'W_SessionMenu_2_C_ExecuteUbergraph_W_SessionMenu_2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

