#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SettingMenu.W_SettingMenu_C
// 0x0098 (0x0368 - 0x02D0)
class UW_SettingMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                B_heavy;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                B_knife;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                B_pistol;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                B_revolver;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                B_rifle;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                B_rules;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                B_shorty;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                B_shotgun;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                B_smg;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WeaponSetting_C*                     W_PistolSettings;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WeaponSetting_C*                     W_RevolverSettings;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WeaponSetting_C*                     W_RifleSettings;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Rules_C*                             W_Rules;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WeaponSetting_C*                     W_ShortySettings;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WeaponSetting_C*                     W_ShotgunSettings;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WeaponSetting_C*                     W_SMGSettings;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_114;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_SettingMenu_B_heavy_K2Node_ComponentBoundEvent_13_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettingMenu_B_knife_K2Node_ComponentBoundEvent_14_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettingMenu_B_light_K2Node_ComponentBoundEvent_12_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettingMenu_B_pistol_K2Node_ComponentBoundEvent_7_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettingMenu_B_revolver_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettingMenu_B_rifle_K2Node_ComponentBoundEvent_9_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettingMenu_B_shorty_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettingMenu_B_shotgun_K2Node_ComponentBoundEvent_11_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SettingMenu_B_smg_K2Node_ComponentBoundEvent_10_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_W_SettingMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SettingMenu_C">();
	}
	static class UW_SettingMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SettingMenu_C>();
	}
};
static_assert(alignof(UW_SettingMenu_C) == 0x000008, "Wrong alignment on UW_SettingMenu_C");
static_assert(sizeof(UW_SettingMenu_C) == 0x000368, "Wrong size on UW_SettingMenu_C");
static_assert(offsetof(UW_SettingMenu_C, UberGraphFrame) == 0x0002D0, "Member 'UW_SettingMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, B_heavy) == 0x0002D8, "Member 'UW_SettingMenu_C::B_heavy' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, B_knife) == 0x0002E0, "Member 'UW_SettingMenu_C::B_knife' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, B_pistol) == 0x0002E8, "Member 'UW_SettingMenu_C::B_pistol' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, B_revolver) == 0x0002F0, "Member 'UW_SettingMenu_C::B_revolver' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, B_rifle) == 0x0002F8, "Member 'UW_SettingMenu_C::B_rifle' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, B_rules) == 0x000300, "Member 'UW_SettingMenu_C::B_rules' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, B_shorty) == 0x000308, "Member 'UW_SettingMenu_C::B_shorty' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, B_shotgun) == 0x000310, "Member 'UW_SettingMenu_C::B_shotgun' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, B_smg) == 0x000318, "Member 'UW_SettingMenu_C::B_smg' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, W_PistolSettings) == 0x000320, "Member 'UW_SettingMenu_C::W_PistolSettings' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, W_RevolverSettings) == 0x000328, "Member 'UW_SettingMenu_C::W_RevolverSettings' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, W_RifleSettings) == 0x000330, "Member 'UW_SettingMenu_C::W_RifleSettings' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, W_Rules) == 0x000338, "Member 'UW_SettingMenu_C::W_Rules' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, W_ShortySettings) == 0x000340, "Member 'UW_SettingMenu_C::W_ShortySettings' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, W_ShotgunSettings) == 0x000348, "Member 'UW_SettingMenu_C::W_ShotgunSettings' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, W_SMGSettings) == 0x000350, "Member 'UW_SettingMenu_C::W_SMGSettings' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, WidgetSwitcher_114) == 0x000358, "Member 'UW_SettingMenu_C::WidgetSwitcher_114' has a wrong offset!");
static_assert(offsetof(UW_SettingMenu_C, Mec_Ref) == 0x000360, "Member 'UW_SettingMenu_C::Mec_Ref' has a wrong offset!");

}

