#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_List_Button

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_Settings_List_Button.W_Settings_List_Button_C.ExecuteUbergraph_W_Settings_List_Button
// 0x0018 (0x0018 - 0x0000)
struct W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button) == 0x000004, "Wrong alignment on W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button");
static_assert(sizeof(W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button) == 0x000018, "Wrong size on W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button");
static_assert(offsetof(W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button, EntryPoint) == 0x000000, "Member 'W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button, K2Node_Event_IsDesignTime) == 0x000014, "Member 'W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button, K2Node_CustomEvent_True) == 0x000015, "Member 'W_Settings_List_Button_C_ExecuteUbergraph_W_Settings_List_Button::K2Node_CustomEvent_True' has a wrong offset!");

// Function W_Settings_List_Button.W_Settings_List_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Settings_List_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Settings_List_Button_C_PreConstruct) == 0x000001, "Wrong alignment on W_Settings_List_Button_C_PreConstruct");
static_assert(sizeof(W_Settings_List_Button_C_PreConstruct) == 0x000001, "Wrong size on W_Settings_List_Button_C_PreConstruct");
static_assert(offsetof(W_Settings_List_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Settings_List_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Settings_List_Button.W_Settings_List_Button_C.Set Selection
// 0x0001 (0x0001 - 0x0000)
struct W_Settings_List_Button_C_Set_Selection final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Settings_List_Button_C_Set_Selection) == 0x000001, "Wrong alignment on W_Settings_List_Button_C_Set_Selection");
static_assert(sizeof(W_Settings_List_Button_C_Set_Selection) == 0x000001, "Wrong size on W_Settings_List_Button_C_Set_Selection");
static_assert(offsetof(W_Settings_List_Button_C_Set_Selection, TRUE_0) == 0x000000, "Member 'W_Settings_List_Button_C_Set_Selection::TRUE_0' has a wrong offset!");

}

