#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_Checkbox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Settings_Checkbox.W_Settings_Checkbox_C
// 0x0058 (0x0328 - 0x02D0)
class UW_Settings_Checkbox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 V_Check;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_Name_C*                     W_Settings_Name;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0308(0x0010)(Edit, BlueprintVisible)
	float                                         Size;                                              // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Default;                                           // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Settings_Checkbox_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_Settings_Checkbox_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_Settings_Checkbox_Button_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_Settings_Checkbox(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Value(bool TRUE_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Settings_Checkbox_C">();
	}
	static class UW_Settings_Checkbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Settings_Checkbox_C>();
	}
};
static_assert(alignof(UW_Settings_Checkbox_C) == 0x000008, "Wrong alignment on UW_Settings_Checkbox_C");
static_assert(sizeof(UW_Settings_Checkbox_C) == 0x000328, "Wrong size on UW_Settings_Checkbox_C");
static_assert(offsetof(UW_Settings_Checkbox_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Settings_Checkbox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, Background) == 0x0002D8, "Member 'UW_Settings_Checkbox_C::Background' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, Button) == 0x0002E0, "Member 'UW_Settings_Checkbox_C::Button' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, HorizontalBox) == 0x0002E8, "Member 'UW_Settings_Checkbox_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, SizeBox_1) == 0x0002F0, "Member 'UW_Settings_Checkbox_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, V_Check) == 0x0002F8, "Member 'UW_Settings_Checkbox_C::V_Check' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, W_Settings_Name) == 0x000300, "Member 'UW_Settings_Checkbox_C::W_Settings_Name' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, Name_0) == 0x000308, "Member 'UW_Settings_Checkbox_C::Name_0' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, Size) == 0x000318, "Member 'UW_Settings_Checkbox_C::Size' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, Default) == 0x00031C, "Member 'UW_Settings_Checkbox_C::Default' has a wrong offset!");
static_assert(offsetof(UW_Settings_Checkbox_C, Value) == 0x000320, "Member 'UW_Settings_Checkbox_C::Value' has a wrong offset!");

}

