#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings_CategorySelector

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_Settings_CategorySelector.W_Settings_CategorySelector_C.ExecuteUbergraph_W_Settings_CategorySelector
// 0x0030 (0x0030 - 0x0000)
struct W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector) == 0x000008, "Wrong alignment on W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector");
static_assert(sizeof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector) == 0x000030, "Wrong size on W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, EntryPoint) == 0x000000, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, Temp_bool_Variable) == 0x000004, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, Temp_byte_Variable) == 0x000005, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, Temp_byte_Variable_1) == 0x000006, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, Temp_bool_Variable_1) == 0x000007, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, K2Node_Select_Default) == 0x000008, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, Temp_object_Variable) == 0x000010, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, Temp_object_Variable_1) == 0x000018, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, K2Node_Select_Default_1) == 0x000020, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, K2Node_Event_IsDesignTime) == 0x000028, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector, K2Node_CustomEvent_True) == 0x00002A, "Member 'W_Settings_CategorySelector_C_ExecuteUbergraph_W_Settings_CategorySelector::K2Node_CustomEvent_True' has a wrong offset!");

// Function W_Settings_CategorySelector.W_Settings_CategorySelector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Settings_CategorySelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Settings_CategorySelector_C_PreConstruct) == 0x000001, "Wrong alignment on W_Settings_CategorySelector_C_PreConstruct");
static_assert(sizeof(W_Settings_CategorySelector_C_PreConstruct) == 0x000001, "Wrong size on W_Settings_CategorySelector_C_PreConstruct");
static_assert(offsetof(W_Settings_CategorySelector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Settings_CategorySelector_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Settings_CategorySelector.W_Settings_CategorySelector_C.Set Deployed
// 0x0001 (0x0001 - 0x0000)
struct W_Settings_CategorySelector_C_Set_Deployed final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Settings_CategorySelector_C_Set_Deployed) == 0x000001, "Wrong alignment on W_Settings_CategorySelector_C_Set_Deployed");
static_assert(sizeof(W_Settings_CategorySelector_C_Set_Deployed) == 0x000001, "Wrong size on W_Settings_CategorySelector_C_Set_Deployed");
static_assert(offsetof(W_Settings_CategorySelector_C_Set_Deployed, TRUE_0) == 0x000000, "Member 'W_Settings_CategorySelector_C_Set_Deployed::TRUE_0' has a wrong offset!");

}

