#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Skin_CharacterSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Skin_CharacterSelection.W_Skin_CharacterSelection_C
// 0x0138 (0x0408 - 0x02D0)
class UW_Skin_CharacterSelection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowBackground;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background_1;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DLC_Logo;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Frame;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Frame_1;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Highlight;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Tablet_Trigger_C*                    W_Tablet_Trigger;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              On_Pressed;                                        // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 Text;                                              // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Color;                                             // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Press_Color;                                       // 0x035C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Invert_Text;                                       // 0x036C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Text_Size;                                         // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Letter_Spacing;                                    // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Letter_Thickness;                                  // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor;                                         // 0x037C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Unovered_Color;                                    // 0x038C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hovered_Color;                                     // 0x039C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hovered_Text_Color;                                // 0x03AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Unovered_Text_Color;                               // 0x03BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Color_Preset;                                      // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lock;                                              // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              On_Enter;                                          // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_Leave;                                          // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               Face_M;                                            // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UData_Skin_Element_C*                   Skin_Data;                                         // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__W_Tablet_ButtonText_W_Tablet_Trigger_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature();
	void BndEvt__W_Tablet_ButtonText_W_Tablet_Trigger_K2Node_ComponentBoundEvent_4_On_Enter__DelegateSignature();
	void BndEvt__W_Tablet_ButtonText_W_Tablet_Trigger_K2Node_ComponentBoundEvent_5_On_Leave__DelegateSignature();
	void ExecuteUbergraph_W_Skin_CharacterSelection(int32 EntryPoint);
	void Open_Page();
	void PreConstruct(bool IsDesignTime);
	void Rename(const class FString& Text_0);
	void Reset();
	void Select_Skin();
	void Selected(bool TRUE_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Skin_CharacterSelection_C">();
	}
	static class UW_Skin_CharacterSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Skin_CharacterSelection_C>();
	}
};
static_assert(alignof(UW_Skin_CharacterSelection_C) == 0x000008, "Wrong alignment on UW_Skin_CharacterSelection_C");
static_assert(sizeof(UW_Skin_CharacterSelection_C) == 0x000408, "Wrong size on UW_Skin_CharacterSelection_C");
static_assert(offsetof(UW_Skin_CharacterSelection_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Skin_CharacterSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, ShowBackground) == 0x0002D8, "Member 'UW_Skin_CharacterSelection_C::ShowBackground' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Background_1) == 0x0002E0, "Member 'UW_Skin_CharacterSelection_C::Background_1' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, ButtonText) == 0x0002E8, "Member 'UW_Skin_CharacterSelection_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, DLC_Logo) == 0x0002F0, "Member 'UW_Skin_CharacterSelection_C::DLC_Logo' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Frame) == 0x0002F8, "Member 'UW_Skin_CharacterSelection_C::Frame' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Frame_1) == 0x000300, "Member 'UW_Skin_CharacterSelection_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Highlight) == 0x000308, "Member 'UW_Skin_CharacterSelection_C::Highlight' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Image) == 0x000310, "Member 'UW_Skin_CharacterSelection_C::Image' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, SizeBox) == 0x000318, "Member 'UW_Skin_CharacterSelection_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, SizeBox_1) == 0x000320, "Member 'UW_Skin_CharacterSelection_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, W_Tablet_Trigger) == 0x000328, "Member 'UW_Skin_CharacterSelection_C::W_Tablet_Trigger' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Hovered) == 0x000330, "Member 'UW_Skin_CharacterSelection_C::Hovered' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, On_Pressed) == 0x000338, "Member 'UW_Skin_CharacterSelection_C::On_Pressed' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Text) == 0x000348, "Member 'UW_Skin_CharacterSelection_C::Text' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Color) == 0x000358, "Member 'UW_Skin_CharacterSelection_C::Color' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Press_Color) == 0x00035C, "Member 'UW_Skin_CharacterSelection_C::Press_Color' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Invert_Text) == 0x00036C, "Member 'UW_Skin_CharacterSelection_C::Invert_Text' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Text_Size) == 0x000370, "Member 'UW_Skin_CharacterSelection_C::Text_Size' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Letter_Spacing) == 0x000374, "Member 'UW_Skin_CharacterSelection_C::Letter_Spacing' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Letter_Thickness) == 0x000378, "Member 'UW_Skin_CharacterSelection_C::Letter_Thickness' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, TextColor) == 0x00037C, "Member 'UW_Skin_CharacterSelection_C::TextColor' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Unovered_Color) == 0x00038C, "Member 'UW_Skin_CharacterSelection_C::Unovered_Color' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Hovered_Color) == 0x00039C, "Member 'UW_Skin_CharacterSelection_C::Hovered_Color' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Hovered_Text_Color) == 0x0003AC, "Member 'UW_Skin_CharacterSelection_C::Hovered_Text_Color' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Unovered_Text_Color) == 0x0003BC, "Member 'UW_Skin_CharacterSelection_C::Unovered_Text_Color' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Color_Preset) == 0x0003CC, "Member 'UW_Skin_CharacterSelection_C::Color_Preset' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Lock) == 0x0003D0, "Member 'UW_Skin_CharacterSelection_C::Lock' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, On_Enter) == 0x0003D8, "Member 'UW_Skin_CharacterSelection_C::On_Enter' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, On_Leave) == 0x0003E8, "Member 'UW_Skin_CharacterSelection_C::On_Leave' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Face_M) == 0x0003F8, "Member 'UW_Skin_CharacterSelection_C::Face_M' has a wrong offset!");
static_assert(offsetof(UW_Skin_CharacterSelection_C, Skin_Data) == 0x000400, "Member 'UW_Skin_CharacterSelection_C::Skin_Data' has a wrong offset!");

}

