#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Skin_ColorSelection

#include "Basic.hpp"

#include "Enum_SelectedColor_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_Skin_ColorSelection.W_Skin_ColorSelection_C.ExecuteUbergraph_W_Skin_ColorSelection
// 0x0210 (0x0210 - 0x0000)
struct W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	class FString                                 Temp_string_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_6;                            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_7;                            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_8;                            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_9;                            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	Enum_SelectedColor                            Temp_byte_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x012C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x013C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x014C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0160(0x0010)()
	class FString                                 K2Node_CustomEvent_Text;                           // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 K2Node_DynamicCast_AsMec;                          // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True;                           // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x01A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x01B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01C4(0x0014)()
	Enum_SelectedColor                            Temp_byte_Variable_1;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMec_C*                                 K2Node_CustomEvent_Mec;                            // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_1;                           // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0200(0x0010)()
};
static_assert(alignof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection) == 0x000008, "Wrong alignment on W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection");
static_assert(sizeof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection) == 0x000210, "Wrong size on W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, EntryPoint) == 0x000000, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable) == 0x000008, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable_1) == 0x000028, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable_2) == 0x000038, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable_3) == 0x000048, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable_4) == 0x000058, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable_5) == 0x000068, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable_6) == 0x000078, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable_6' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable_7) == 0x000088, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable_7' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable_8) == 0x000098, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable_8' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_string_Variable_9) == 0x0000A8, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_string_Variable_9' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_byte_Variable) == 0x0000B8, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable) == 0x0000BC, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable_1) == 0x0000CC, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable_2) == 0x0000DC, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable_3) == 0x0000EC, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable_4) == 0x0000FC, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable_5) == 0x00010C, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable_6) == 0x00011C, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable_7) == 0x00012C, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable_8) == 0x00013C, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_struct_Variable_9) == 0x00014C, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, K2Node_Event_IsDesignTime) == 0x00015C, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000160, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, K2Node_CustomEvent_Text) == 0x000170, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, K2Node_Select_Default) == 0x000180, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, CallFunc_GetPlayerPawn_ReturnValue) == 0x000190, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, K2Node_DynamicCast_AsMec) == 0x000198, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::K2Node_DynamicCast_AsMec' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, K2Node_CustomEvent_True) == 0x0001A1, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::K2Node_CustomEvent_True' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, CallFunc_SelectColor_ReturnValue) == 0x0001A4, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, CallFunc_SelectColor_ReturnValue_1) == 0x0001B4, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, K2Node_MakeStruct_SlateColor) == 0x0001C4, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, Temp_byte_Variable_1) == 0x0001D8, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, K2Node_CustomEvent_Mec) == 0x0001E0, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::K2Node_CustomEvent_Mec' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, K2Node_Select_Default_1) == 0x0001E8, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, CallFunc_IsValid_ReturnValue) == 0x0001F8, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000200, "Member 'W_Skin_ColorSelection_C_ExecuteUbergraph_W_Skin_ColorSelection::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");

// Function W_Skin_ColorSelection.W_Skin_ColorSelection_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Skin_ColorSelection_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Skin_ColorSelection_C_PreConstruct) == 0x000001, "Wrong alignment on W_Skin_ColorSelection_C_PreConstruct");
static_assert(sizeof(W_Skin_ColorSelection_C_PreConstruct) == 0x000001, "Wrong size on W_Skin_ColorSelection_C_PreConstruct");
static_assert(offsetof(W_Skin_ColorSelection_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Skin_ColorSelection_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Skin_ColorSelection.W_Skin_ColorSelection_C.Rename
// 0x0010 (0x0010 - 0x0000)
struct W_Skin_ColorSelection_C_Rename final
{
public:
	class FString                                 Text_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Skin_ColorSelection_C_Rename) == 0x000008, "Wrong alignment on W_Skin_ColorSelection_C_Rename");
static_assert(sizeof(W_Skin_ColorSelection_C_Rename) == 0x000010, "Wrong size on W_Skin_ColorSelection_C_Rename");
static_assert(offsetof(W_Skin_ColorSelection_C_Rename, Text_0) == 0x000000, "Member 'W_Skin_ColorSelection_C_Rename::Text_0' has a wrong offset!");

// Function W_Skin_ColorSelection.W_Skin_ColorSelection_C.Selected
// 0x0001 (0x0001 - 0x0000)
struct W_Skin_ColorSelection_C_Selected final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Skin_ColorSelection_C_Selected) == 0x000001, "Wrong alignment on W_Skin_ColorSelection_C_Selected");
static_assert(sizeof(W_Skin_ColorSelection_C_Selected) == 0x000001, "Wrong size on W_Skin_ColorSelection_C_Selected");
static_assert(offsetof(W_Skin_ColorSelection_C_Selected, TRUE_0) == 0x000000, "Member 'W_Skin_ColorSelection_C_Selected::TRUE_0' has a wrong offset!");

// Function W_Skin_ColorSelection.W_Skin_ColorSelection_C.Set Owner
// 0x0008 (0x0008 - 0x0000)
struct W_Skin_ColorSelection_C_Set_Owner final
{
public:
	class AMec_C*                                 Mec;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Skin_ColorSelection_C_Set_Owner) == 0x000008, "Wrong alignment on W_Skin_ColorSelection_C_Set_Owner");
static_assert(sizeof(W_Skin_ColorSelection_C_Set_Owner) == 0x000008, "Wrong size on W_Skin_ColorSelection_C_Set_Owner");
static_assert(offsetof(W_Skin_ColorSelection_C_Set_Owner, Mec) == 0x000000, "Member 'W_Skin_ColorSelection_C_Set_Owner::Mec' has a wrong offset!");

}

