#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TaskFromList

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_TaskFromList.W_TaskFromList_C.ExecuteUbergraph_W_TaskFromList
// 0x00B0 (0x00B0 - 0x0000)
struct W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0054(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Value)>                  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Value;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A0(0x0010)()
};
static_assert(alignof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList) == 0x000008, "Wrong alignment on W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList");
static_assert(sizeof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList) == 0x0000B0, "Wrong size on W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, EntryPoint) == 0x000000, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, K2Node_Event_IsDesignTime) == 0x000040, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, CallFunc_SelectColor_ReturnValue) == 0x000044, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, K2Node_MakeStruct_SlateColor_2) == 0x000054, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, CallFunc_SelectColor_ReturnValue_1) == 0x000068, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, K2Node_CustomEvent_Value) == 0x000098, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A0, "Member 'W_TaskFromList_C_ExecuteUbergraph_W_TaskFromList::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function W_TaskFromList.W_TaskFromList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_TaskFromList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TaskFromList_C_PreConstruct) == 0x000001, "Wrong alignment on W_TaskFromList_C_PreConstruct");
static_assert(sizeof(W_TaskFromList_C_PreConstruct) == 0x000001, "Wrong size on W_TaskFromList_C_PreConstruct");
static_assert(offsetof(W_TaskFromList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_TaskFromList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_TaskFromList.W_TaskFromList_C.Set Count
// 0x0004 (0x0004 - 0x0000)
struct W_TaskFromList_C_Set_Count final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TaskFromList_C_Set_Count) == 0x000004, "Wrong alignment on W_TaskFromList_C_Set_Count");
static_assert(sizeof(W_TaskFromList_C_Set_Count) == 0x000004, "Wrong size on W_TaskFromList_C_Set_Count");
static_assert(offsetof(W_TaskFromList_C_Set_Count, Value) == 0x000000, "Member 'W_TaskFromList_C_Set_Count::Value' has a wrong offset!");

}

