#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TaskList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TaskList.W_TaskList_C
// 0x0040 (0x0310 - 0x02D0)
class UW_TaskList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           ListBox;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Truc;                                              // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Tablet_UI_C*                         Tablet_Ref;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse_Position;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_TaskFromList_C*>              Tasks;                                             // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_W_TaskList(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update_Tasks(const TArray<class ATask_C*>& Tasks_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TaskList_C">();
	}
	static class UW_TaskList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TaskList_C>();
	}
};
static_assert(alignof(UW_TaskList_C) == 0x000008, "Wrong alignment on UW_TaskList_C");
static_assert(sizeof(UW_TaskList_C) == 0x000310, "Wrong size on UW_TaskList_C");
static_assert(offsetof(UW_TaskList_C, UberGraphFrame) == 0x0002D0, "Member 'UW_TaskList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_TaskList_C, ListBox) == 0x0002D8, "Member 'UW_TaskList_C::ListBox' has a wrong offset!");
static_assert(offsetof(UW_TaskList_C, Truc) == 0x0002E0, "Member 'UW_TaskList_C::Truc' has a wrong offset!");
static_assert(offsetof(UW_TaskList_C, Tablet_Ref) == 0x0002E8, "Member 'UW_TaskList_C::Tablet_Ref' has a wrong offset!");
static_assert(offsetof(UW_TaskList_C, Mouse_Position) == 0x0002F0, "Member 'UW_TaskList_C::Mouse_Position' has a wrong offset!");
static_assert(offsetof(UW_TaskList_C, Tasks) == 0x000300, "Member 'UW_TaskList_C::Tasks' has a wrong offset!");

}

