#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Tablet_ButtonVideo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Tablet_ButtonVideo.W_Tablet_ButtonVideo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Tablet_ButtonVideo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Tablet_ButtonVideo_C_PreConstruct) == 0x000001, "Wrong alignment on W_Tablet_ButtonVideo_C_PreConstruct");
static_assert(sizeof(W_Tablet_ButtonVideo_C_PreConstruct) == 0x000001, "Wrong size on W_Tablet_ButtonVideo_C_PreConstruct");
static_assert(offsetof(W_Tablet_ButtonVideo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Tablet_ButtonVideo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Tablet_ButtonVideo.W_Tablet_ButtonVideo_C.Set Color
// 0x0004 (0x0004 - 0x0000)
struct W_Tablet_ButtonVideo_C_Set_Color final
{
public:
	int32                                         Color_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Tablet_ButtonVideo_C_Set_Color) == 0x000004, "Wrong alignment on W_Tablet_ButtonVideo_C_Set_Color");
static_assert(sizeof(W_Tablet_ButtonVideo_C_Set_Color) == 0x000004, "Wrong size on W_Tablet_ButtonVideo_C_Set_Color");
static_assert(offsetof(W_Tablet_ButtonVideo_C_Set_Color, Color_0) == 0x000000, "Member 'W_Tablet_ButtonVideo_C_Set_Color::Color_0' has a wrong offset!");

// Function W_Tablet_ButtonVideo.W_Tablet_ButtonVideo_C.Rename
// 0x0010 (0x0010 - 0x0000)
struct W_Tablet_ButtonVideo_C_Rename final
{
public:
	class FString                                 Text_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Tablet_ButtonVideo_C_Rename) == 0x000008, "Wrong alignment on W_Tablet_ButtonVideo_C_Rename");
static_assert(sizeof(W_Tablet_ButtonVideo_C_Rename) == 0x000010, "Wrong size on W_Tablet_ButtonVideo_C_Rename");
static_assert(offsetof(W_Tablet_ButtonVideo_C_Rename, Text_0) == 0x000000, "Member 'W_Tablet_ButtonVideo_C_Rename::Text_0' has a wrong offset!");

// Function W_Tablet_ButtonVideo.W_Tablet_ButtonVideo_C.Set Lock
// 0x0001 (0x0001 - 0x0000)
struct W_Tablet_ButtonVideo_C_Set_Lock final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Tablet_ButtonVideo_C_Set_Lock) == 0x000001, "Wrong alignment on W_Tablet_ButtonVideo_C_Set_Lock");
static_assert(sizeof(W_Tablet_ButtonVideo_C_Set_Lock) == 0x000001, "Wrong size on W_Tablet_ButtonVideo_C_Set_Lock");
static_assert(offsetof(W_Tablet_ButtonVideo_C_Set_Lock, TRUE_0) == 0x000000, "Member 'W_Tablet_ButtonVideo_C_Set_Lock::TRUE_0' has a wrong offset!");

// Function W_Tablet_ButtonVideo.W_Tablet_ButtonVideo_C.ExecuteUbergraph_W_Tablet_ButtonVideo
// 0x0148 (0x0148 - 0x0000)
struct W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0024(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0014)()
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0060(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0074(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0088(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x009C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x00B0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x00C4(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E0(0x0010)()
	int32                                         K2Node_CustomEvent_Color;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Text;                           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_8;                    // 0x0118(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_9;                    // 0x012C(0x0014)()
	bool                                          K2Node_CustomEvent_True;                           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_SetFieldsInStruct_Size_ImplicitCast;        // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo) == 0x000008, "Wrong alignment on W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo");
static_assert(sizeof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo) == 0x000148, "Wrong size on W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, EntryPoint) == 0x000000, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, Temp_int_Variable) == 0x000004, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, Temp_name_Variable) == 0x000008, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, Temp_name_Variable_1) == 0x000010, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, Temp_name_Variable_2) == 0x000018, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_SwitchInteger_CmpSuccess) == 0x000020, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor) == 0x000024, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor_2) == 0x000060, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor_3) == 0x000074, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor_4) == 0x000088, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor_5) == 0x00009C, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor_6) == 0x0000B0, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor_7) == 0x0000C4, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_Event_IsDesignTime) == 0x0000D8, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E0, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_CustomEvent_Color) == 0x0000F0, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_CustomEvent_Text) == 0x0000F8, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000108, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_Select_Default) == 0x000110, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor_8) == 0x000118, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor_8' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_MakeStruct_SlateColor_9) == 0x00012C, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_MakeStruct_SlateColor_9' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_CustomEvent_True) == 0x000140, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_CustomEvent_True' has a wrong offset!");
static_assert(offsetof(W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo, K2Node_SetFieldsInStruct_Size_ImplicitCast) == 0x000144, "Member 'W_Tablet_ButtonVideo_C_ExecuteUbergraph_W_Tablet_ButtonVideo::K2Node_SetFieldsInStruct_Size_ImplicitCast' has a wrong offset!");

}

