#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TaskFromList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TaskFromList.W_TaskFromList_C
// 0x0050 (0x0320 - 0x02D0)
class UW_TaskFromList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Main;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Count;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Tablet_Trigger_C*                    Trigger;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 V_Check;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ATask_C*                                Task_Ref;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   Task_Name;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Tablet_UI_C*                         Tablet;                                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Checked;                                           // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_TaskFromList_Trigger_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature();
	void BndEvt__W_TaskFromList_Trigger_K2Node_ComponentBoundEvent_4_On_Enter__DelegateSignature();
	void BndEvt__W_TaskFromList_Trigger_K2Node_ComponentBoundEvent_5_On_Leave__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_TaskFromList(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Check();
	void Set_Count(int32 Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TaskFromList_C">();
	}
	static class UW_TaskFromList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TaskFromList_C>();
	}
};
static_assert(alignof(UW_TaskFromList_C) == 0x000008, "Wrong alignment on UW_TaskFromList_C");
static_assert(sizeof(UW_TaskFromList_C) == 0x000320, "Wrong size on UW_TaskFromList_C");
static_assert(offsetof(UW_TaskFromList_C, UberGraphFrame) == 0x0002D0, "Member 'UW_TaskFromList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_TaskFromList_C, Main) == 0x0002D8, "Member 'UW_TaskFromList_C::Main' has a wrong offset!");
static_assert(offsetof(UW_TaskFromList_C, Text) == 0x0002E0, "Member 'UW_TaskFromList_C::Text' has a wrong offset!");
static_assert(offsetof(UW_TaskFromList_C, Text_Count) == 0x0002E8, "Member 'UW_TaskFromList_C::Text_Count' has a wrong offset!");
static_assert(offsetof(UW_TaskFromList_C, Trigger) == 0x0002F0, "Member 'UW_TaskFromList_C::Trigger' has a wrong offset!");
static_assert(offsetof(UW_TaskFromList_C, V_Check) == 0x0002F8, "Member 'UW_TaskFromList_C::V_Check' has a wrong offset!");
static_assert(offsetof(UW_TaskFromList_C, Task_Ref) == 0x000300, "Member 'UW_TaskFromList_C::Task_Ref' has a wrong offset!");
static_assert(offsetof(UW_TaskFromList_C, Task_Name) == 0x000308, "Member 'UW_TaskFromList_C::Task_Name' has a wrong offset!");
static_assert(offsetof(UW_TaskFromList_C, Tablet) == 0x000310, "Member 'UW_TaskFromList_C::Tablet' has a wrong offset!");
static_assert(offsetof(UW_TaskFromList_C, Checked) == 0x000318, "Member 'UW_TaskFromList_C::Checked' has a wrong offset!");

}

