#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TaskTutorialButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TaskTutorialButton.W_TaskTutorialButton_C
// 0x0060 (0x0330 - 0x02D0)
class UW_TaskTutorialButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Tablet_ButtonText_C*                 B_Try;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Tablet_ButtonText_C*                 B_Video;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_Text;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Title;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& Name, class UMediaSource* Source)> Play_Video; // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMediaSource*                           Video_To_Play;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Try_Task;                                          // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 Task_Name;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void BndEvt__W_TaskTutorialButton_B_Try_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature();
	void BndEvt__W_TaskTutorialButton_B_Video_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature();
	void ExecuteUbergraph_W_TaskTutorialButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TaskTutorialButton_C">();
	}
	static class UW_TaskTutorialButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TaskTutorialButton_C>();
	}
};
static_assert(alignof(UW_TaskTutorialButton_C) == 0x000008, "Wrong alignment on UW_TaskTutorialButton_C");
static_assert(sizeof(UW_TaskTutorialButton_C) == 0x000330, "Wrong size on UW_TaskTutorialButton_C");
static_assert(offsetof(UW_TaskTutorialButton_C, UberGraphFrame) == 0x0002D0, "Member 'UW_TaskTutorialButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_TaskTutorialButton_C, B_Try) == 0x0002D8, "Member 'UW_TaskTutorialButton_C::B_Try' has a wrong offset!");
static_assert(offsetof(UW_TaskTutorialButton_C, B_Video) == 0x0002E0, "Member 'UW_TaskTutorialButton_C::B_Video' has a wrong offset!");
static_assert(offsetof(UW_TaskTutorialButton_C, Name_Text) == 0x0002E8, "Member 'UW_TaskTutorialButton_C::Name_Text' has a wrong offset!");
static_assert(offsetof(UW_TaskTutorialButton_C, Title) == 0x0002F0, "Member 'UW_TaskTutorialButton_C::Title' has a wrong offset!");
static_assert(offsetof(UW_TaskTutorialButton_C, Play_Video) == 0x0002F8, "Member 'UW_TaskTutorialButton_C::Play_Video' has a wrong offset!");
static_assert(offsetof(UW_TaskTutorialButton_C, Video_To_Play) == 0x000308, "Member 'UW_TaskTutorialButton_C::Video_To_Play' has a wrong offset!");
static_assert(offsetof(UW_TaskTutorialButton_C, Try_Task) == 0x000310, "Member 'UW_TaskTutorialButton_C::Try_Task' has a wrong offset!");
static_assert(offsetof(UW_TaskTutorialButton_C, Task_Name) == 0x000320, "Member 'UW_TaskTutorialButton_C::Task_Name' has a wrong offset!");

}

