#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TaskTutorialButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_TaskTutorialButton.W_TaskTutorialButton_C.ExecuteUbergraph_W_TaskTutorialButton
// 0x0018 (0x0018 - 0x0000)
struct W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0010)()
};
static_assert(alignof(W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton) == 0x000008, "Wrong alignment on W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton");
static_assert(sizeof(W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton) == 0x000018, "Wrong size on W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton");
static_assert(offsetof(W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton, EntryPoint) == 0x000000, "Member 'W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'W_TaskTutorialButton_C_ExecuteUbergraph_W_TaskTutorialButton::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_TaskTutorialButton.W_TaskTutorialButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_TaskTutorialButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TaskTutorialButton_C_PreConstruct) == 0x000001, "Wrong alignment on W_TaskTutorialButton_C_PreConstruct");
static_assert(sizeof(W_TaskTutorialButton_C_PreConstruct) == 0x000001, "Wrong size on W_TaskTutorialButton_C_PreConstruct");
static_assert(offsetof(W_TaskTutorialButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_TaskTutorialButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

