#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Tablet_TaskSetting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Tablet_TaskSetting.W_Tablet_TaskSetting_C
// 0x00E8 (0x03B8 - 0x02D0)
class UW_Tablet_TaskSetting_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowBackground;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_Tablet_ButtonText_C*                 B_Reset;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Left_Text;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                LeftBG;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_Text;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Right_Text;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RightBG;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Title;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Tablet_Trigger_C*                    Trigger_Left;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Tablet_Trigger_C*                    Trigger_Right;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_Text;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Text_Size;                                         // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Letter_Spacing;                                    // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Letter_Thickness;                                  // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Unovered_Color;                                    // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hovered_Color;                                     // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hovered_Text_Color;                                // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Unovered_Text_Color;                               // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Color_Preset;                                      // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATask_C*                                Task_Ref;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Last_Index;                                        // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Check_Tasks_Count;                                 // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UW_Tablet_UI_C*                         Parent;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__W_Tablet_ButtonText_W_Tablet_Trigger_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature();
	void BndEvt__W_Tablet_ButtonText_W_Tablet_Trigger_K2Node_ComponentBoundEvent_4_On_Enter__DelegateSignature();
	void BndEvt__W_Tablet_ButtonText_W_Tablet_Trigger_K2Node_ComponentBoundEvent_5_On_Leave__DelegateSignature();
	void BndEvt__W_Tablet_SessionSetting_Trigger_Right_K2Node_ComponentBoundEvent_1_On_Enter__DelegateSignature();
	void BndEvt__W_Tablet_SessionSetting_Trigger_Right_K2Node_ComponentBoundEvent_2_On_Leave__DelegateSignature();
	void BndEvt__W_Tablet_SessionSetting_Trigger_Right_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature();
	void BndEvt__W_Tablet_TaskSetting_B_Reset_K2Node_ComponentBoundEvent_6_On_Pressed__DelegateSignature();
	void ExecuteUbergraph_W_Tablet_TaskSetting(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Tablet_TaskSetting_C">();
	}
	static class UW_Tablet_TaskSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Tablet_TaskSetting_C>();
	}
};
static_assert(alignof(UW_Tablet_TaskSetting_C) == 0x000008, "Wrong alignment on UW_Tablet_TaskSetting_C");
static_assert(sizeof(UW_Tablet_TaskSetting_C) == 0x0003B8, "Wrong size on UW_Tablet_TaskSetting_C");
static_assert(offsetof(UW_Tablet_TaskSetting_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Tablet_TaskSetting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, ShowBackground) == 0x0002D8, "Member 'UW_Tablet_TaskSetting_C::ShowBackground' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, B_Reset) == 0x0002E0, "Member 'UW_Tablet_TaskSetting_C::B_Reset' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Background) == 0x0002E8, "Member 'UW_Tablet_TaskSetting_C::Background' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Left_Text) == 0x0002F0, "Member 'UW_Tablet_TaskSetting_C::Left_Text' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, LeftBG) == 0x0002F8, "Member 'UW_Tablet_TaskSetting_C::LeftBG' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Name_Text) == 0x000300, "Member 'UW_Tablet_TaskSetting_C::Name_Text' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Right_Text) == 0x000308, "Member 'UW_Tablet_TaskSetting_C::Right_Text' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, RightBG) == 0x000310, "Member 'UW_Tablet_TaskSetting_C::RightBG' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Title) == 0x000318, "Member 'UW_Tablet_TaskSetting_C::Title' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Trigger_Left) == 0x000320, "Member 'UW_Tablet_TaskSetting_C::Trigger_Left' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Trigger_Right) == 0x000328, "Member 'UW_Tablet_TaskSetting_C::Trigger_Right' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Value_Text) == 0x000330, "Member 'UW_Tablet_TaskSetting_C::Value_Text' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Hovered) == 0x000338, "Member 'UW_Tablet_TaskSetting_C::Hovered' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Text_Size) == 0x00033C, "Member 'UW_Tablet_TaskSetting_C::Text_Size' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Letter_Spacing) == 0x000340, "Member 'UW_Tablet_TaskSetting_C::Letter_Spacing' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Letter_Thickness) == 0x000344, "Member 'UW_Tablet_TaskSetting_C::Letter_Thickness' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Unovered_Color) == 0x000348, "Member 'UW_Tablet_TaskSetting_C::Unovered_Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Hovered_Color) == 0x000358, "Member 'UW_Tablet_TaskSetting_C::Hovered_Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Hovered_Text_Color) == 0x000368, "Member 'UW_Tablet_TaskSetting_C::Hovered_Text_Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Unovered_Text_Color) == 0x000378, "Member 'UW_Tablet_TaskSetting_C::Unovered_Text_Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Color_Preset) == 0x000388, "Member 'UW_Tablet_TaskSetting_C::Color_Preset' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Task_Ref) == 0x000390, "Member 'UW_Tablet_TaskSetting_C::Task_Ref' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Last_Index) == 0x000398, "Member 'UW_Tablet_TaskSetting_C::Last_Index' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Check_Tasks_Count) == 0x0003A0, "Member 'UW_Tablet_TaskSetting_C::Check_Tasks_Count' has a wrong offset!");
static_assert(offsetof(UW_Tablet_TaskSetting_C, Parent) == 0x0003B0, "Member 'UW_Tablet_TaskSetting_C::Parent' has a wrong offset!");

}

