#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Tablet_Server

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Tablet_Server.W_Tablet_Server_C.ExecuteUbergraph_W_Tablet_Server
// 0x00B8 (0x00B8 - 0x0000)
struct W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMainGI_C*                              K2Node_DynamicCast_AsMain_GI;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPingInMs_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentPlayers_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0010)()
	class FString                                 CallFunc_GetServerName_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00A8(0x0010)()
};
static_assert(alignof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server) == 0x000008, "Wrong alignment on W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server");
static_assert(sizeof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server) == 0x0000B8, "Wrong size on W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, EntryPoint) == 0x000000, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, K2Node_DynamicCast_AsMain_GI) == 0x000010, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::K2Node_DynamicCast_AsMain_GI' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_GetPingInMs_ReturnValue) == 0x00001C, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_GetPingInMs_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_GetCurrentPlayers_ReturnValue) == 0x000020, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_GetCurrentPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000038, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_GetServerName_ReturnValue) == 0x000088, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_GetServerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_Left_ReturnValue) == 0x000098, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000A8, "Member 'W_Tablet_Server_C_ExecuteUbergraph_W_Tablet_Server::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");

}

