#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Tablet_ButtonVideo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Tablet_ButtonVideo.W_Tablet_ButtonVideo_C
// 0x0100 (0x03D0 - 0x02D0)
class UW_Tablet_ButtonVideo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowBackground;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Frame;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock_logo;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Tablet_Trigger_C*                    W_Tablet_Trigger;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              On_Pressed;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 Text;                                              // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Color;                                             // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Press_Color;                                       // 0x0334(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Invert_Text;                                       // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Text_Size;                                         // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Letter_Spacing;                                    // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Letter_Thickness;                                  // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor;                                         // 0x0354(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Unovered_Color;                                    // 0x0364(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hovered_Color;                                     // 0x0374(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hovered_Text_Color;                                // 0x0384(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Unovered_Text_Color;                               // 0x0394(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Color_Preset;                                      // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lock;                                              // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              On_Enter;                                          // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_Leave;                                          // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void PreConstruct(bool IsDesignTime);
	void BndEvt__W_Tablet_ButtonText_W_Tablet_Trigger_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature();
	void BndEvt__W_Tablet_ButtonText_W_Tablet_Trigger_K2Node_ComponentBoundEvent_4_On_Enter__DelegateSignature();
	void BndEvt__W_Tablet_ButtonText_W_Tablet_Trigger_K2Node_ComponentBoundEvent_5_On_Leave__DelegateSignature();
	void Reset();
	void Set_Color(int32 Color_0);
	void Rename(const class FString& Text_0);
	void Set_Lock(bool TRUE_0);
	void ExecuteUbergraph_W_Tablet_ButtonVideo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Tablet_ButtonVideo_C">();
	}
	static class UW_Tablet_ButtonVideo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Tablet_ButtonVideo_C>();
	}
};
static_assert(alignof(UW_Tablet_ButtonVideo_C) == 0x000008, "Wrong alignment on UW_Tablet_ButtonVideo_C");
static_assert(sizeof(UW_Tablet_ButtonVideo_C) == 0x0003D0, "Wrong size on UW_Tablet_ButtonVideo_C");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, UberGraphFrame) == 0x0002D0, "Member 'UW_Tablet_ButtonVideo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, ShowBackground) == 0x0002D8, "Member 'UW_Tablet_ButtonVideo_C::ShowBackground' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Background) == 0x0002E0, "Member 'UW_Tablet_ButtonVideo_C::Background' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, ButtonText) == 0x0002E8, "Member 'UW_Tablet_ButtonVideo_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Frame) == 0x0002F0, "Member 'UW_Tablet_ButtonVideo_C::Frame' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Lock_logo) == 0x0002F8, "Member 'UW_Tablet_ButtonVideo_C::Lock_logo' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, W_Tablet_Trigger) == 0x000300, "Member 'UW_Tablet_ButtonVideo_C::W_Tablet_Trigger' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Hovered) == 0x000308, "Member 'UW_Tablet_ButtonVideo_C::Hovered' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, On_Pressed) == 0x000310, "Member 'UW_Tablet_ButtonVideo_C::On_Pressed' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Text) == 0x000320, "Member 'UW_Tablet_ButtonVideo_C::Text' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Color) == 0x000330, "Member 'UW_Tablet_ButtonVideo_C::Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Press_Color) == 0x000334, "Member 'UW_Tablet_ButtonVideo_C::Press_Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Invert_Text) == 0x000344, "Member 'UW_Tablet_ButtonVideo_C::Invert_Text' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Text_Size) == 0x000348, "Member 'UW_Tablet_ButtonVideo_C::Text_Size' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Letter_Spacing) == 0x00034C, "Member 'UW_Tablet_ButtonVideo_C::Letter_Spacing' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Letter_Thickness) == 0x000350, "Member 'UW_Tablet_ButtonVideo_C::Letter_Thickness' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, TextColor) == 0x000354, "Member 'UW_Tablet_ButtonVideo_C::TextColor' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Unovered_Color) == 0x000364, "Member 'UW_Tablet_ButtonVideo_C::Unovered_Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Hovered_Color) == 0x000374, "Member 'UW_Tablet_ButtonVideo_C::Hovered_Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Hovered_Text_Color) == 0x000384, "Member 'UW_Tablet_ButtonVideo_C::Hovered_Text_Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Unovered_Text_Color) == 0x000394, "Member 'UW_Tablet_ButtonVideo_C::Unovered_Text_Color' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Color_Preset) == 0x0003A4, "Member 'UW_Tablet_ButtonVideo_C::Color_Preset' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, Lock) == 0x0003A8, "Member 'UW_Tablet_ButtonVideo_C::Lock' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, On_Enter) == 0x0003B0, "Member 'UW_Tablet_ButtonVideo_C::On_Enter' has a wrong offset!");
static_assert(offsetof(UW_Tablet_ButtonVideo_C, On_Leave) == 0x0003C0, "Member 'UW_Tablet_ButtonVideo_C::On_Leave' has a wrong offset!");

}

