#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TutoPC_UI

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_TutoPC_UI.W_TutoPC_UI_C.ExecuteUbergraph_W_TutoPC_UI
// 0x0008 (0x0008 - 0x0000)
struct W_TutoPC_UI_C_ExecuteUbergraph_W_TutoPC_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutoPC_UI_C_ExecuteUbergraph_W_TutoPC_UI) == 0x000004, "Wrong alignment on W_TutoPC_UI_C_ExecuteUbergraph_W_TutoPC_UI");
static_assert(sizeof(W_TutoPC_UI_C_ExecuteUbergraph_W_TutoPC_UI) == 0x000008, "Wrong size on W_TutoPC_UI_C_ExecuteUbergraph_W_TutoPC_UI");
static_assert(offsetof(W_TutoPC_UI_C_ExecuteUbergraph_W_TutoPC_UI, EntryPoint) == 0x000000, "Member 'W_TutoPC_UI_C_ExecuteUbergraph_W_TutoPC_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TutoPC_UI_C_ExecuteUbergraph_W_TutoPC_UI, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_TutoPC_UI_C_ExecuteUbergraph_W_TutoPC_UI::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_TutoPC_UI.W_TutoPC_UI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_TutoPC_UI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutoPC_UI_C_PreConstruct) == 0x000001, "Wrong alignment on W_TutoPC_UI_C_PreConstruct");
static_assert(sizeof(W_TutoPC_UI_C_PreConstruct) == 0x000001, "Wrong size on W_TutoPC_UI_C_PreConstruct");
static_assert(offsetof(W_TutoPC_UI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_TutoPC_UI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

