#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UpperNotif

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UpperNotif.W_UpperNotif_C
// 0x0038 (0x0308 - 0x02D0)
class UW_UpperNotif_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txt;                                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                Mec_Ref;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Switching_Item;                                    // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               M_Jauge;                                           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_UpperNotif(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Show_Message(const class FString& Message, const struct FLinearColor& Color);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_UpperNotif_C">();
	}
	static class UW_UpperNotif_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UpperNotif_C>();
	}
};
static_assert(alignof(UW_UpperNotif_C) == 0x000008, "Wrong alignment on UW_UpperNotif_C");
static_assert(sizeof(UW_UpperNotif_C) == 0x000308, "Wrong size on UW_UpperNotif_C");
static_assert(offsetof(UW_UpperNotif_C, UberGraphFrame) == 0x0002D0, "Member 'UW_UpperNotif_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_UpperNotif_C, Show) == 0x0002D8, "Member 'UW_UpperNotif_C::Show' has a wrong offset!");
static_assert(offsetof(UW_UpperNotif_C, Background) == 0x0002E0, "Member 'UW_UpperNotif_C::Background' has a wrong offset!");
static_assert(offsetof(UW_UpperNotif_C, txt) == 0x0002E8, "Member 'UW_UpperNotif_C::txt' has a wrong offset!");
static_assert(offsetof(UW_UpperNotif_C, Mec_Ref) == 0x0002F0, "Member 'UW_UpperNotif_C::Mec_Ref' has a wrong offset!");
static_assert(offsetof(UW_UpperNotif_C, Switching_Item) == 0x0002F8, "Member 'UW_UpperNotif_C::Switching_Item' has a wrong offset!");
static_assert(offsetof(UW_UpperNotif_C, M_Jauge) == 0x000300, "Member 'UW_UpperNotif_C::M_Jauge' has a wrong offset!");

}

