#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponCase_UI

#include "Basic.hpp"

#include "E_NumType_structs.hpp"
#include "E_NumPassState_structs.hpp"
#include "Str_WeaponCase_Step_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_WeaponCase_UI.W_WeaponCase_UI_C.ExecuteUbergraph_W_WeaponCase_UI
// 0x0260 (0x0260 - 0x0000)
struct W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0010)()
	class UW_WeaponCaseStep_UI_C*                 CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_NumPassState                                Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NumPassState                                Temp_byte_Variable_9;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NumPassState                                Temp_byte_Variable_18;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_19;                             // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_20;                             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_21;                             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_22;                             // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_23;                             // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_24;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_25;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_26;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NumPassState                                Temp_byte_Variable_27;                             // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_28;                             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_29;                             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_30;                             // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_31;                             // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_32;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_33;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_34;                             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_35;                             // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NumPassState                                Temp_byte_Variable_36;                             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_37;                             // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_38;                             // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_39;                             // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_40;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_41;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_42;                             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_43;                             // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_44;                             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 K2Node_CustomEvent_Value;                          // 0x0088(0x0010)(ConstParm, ReferenceParm)
	uint8                                         CallFunc_Array_Get_Item;                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x00A8(0x0010)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00C8(0x0010)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00D8(0x0014)()
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array_1;                          // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UTextBlock*                             CallFunc_Array_Get_Item_1;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 K2Node_CustomEvent_Values;                         // 0x0118(0x0010)(ConstParm, ReferenceParm)
	TArray<E_NumType>                             K2Node_CustomEvent_Type;                           // 0x0128(0x0010)(ConstParm, ReferenceParm)
	E_NumPassState                                K2Node_CustomEvent_State;                          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_WeaponCase_Step                   K2Node_CustomEvent_Steps;                          // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NumType                                     CallFunc_Array_Get_Item_2;                         // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Array_Get_Item_3;                         // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B[0x1];                                      // 0x016B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue_1;              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue_1;            // 0x0178(0x0010)()
	class FText                                   K2Node_Select_Default_6;                           // 0x0188(0x0010)()
	class UTextBlock*                             CallFunc_Array_Get_Item_4;                         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x01A0(0x0038)(NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_NumType                                     Temp_byte_Variable_45;                             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_7;                           // 0x0224(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0234(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0244(0x0014)()
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI) == 0x000008, "Wrong alignment on W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI");
static_assert(sizeof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI) == 0x000260, "Wrong size on W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, EntryPoint) == 0x000000, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_bool_Variable) == 0x000004, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_text_Variable) == 0x000008, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_bool_Variable_1) == 0x000018, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_text_Variable_1) == 0x000020, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Create_ReturnValue) == 0x000030, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable) == 0x000038, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_1) == 0x000039, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_2) == 0x00003A, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_3) == 0x00003B, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_4) == 0x00003C, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_5) == 0x00003D, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_6) == 0x00003E, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_7) == 0x00003F, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_8) == 0x000040, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_9) == 0x000041, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_10) == 0x000042, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_11) == 0x000043, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_12) == 0x000044, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_13) == 0x000045, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_14) == 0x000046, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_15) == 0x000047, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_16) == 0x000048, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_17) == 0x000049, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_18) == 0x00004A, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_19) == 0x00004B, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_20) == 0x00004C, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_20' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_21) == 0x00004D, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_21' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_22) == 0x00004E, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_22' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_23) == 0x00004F, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_23' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_24) == 0x000050, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_24' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_25) == 0x000051, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_25' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_26) == 0x000052, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_26' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_27) == 0x000053, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_27' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_28) == 0x000054, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_28' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_29) == 0x000055, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_29' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_30) == 0x000056, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_30' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_31) == 0x000057, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_31' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_32) == 0x000058, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_32' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_33) == 0x000059, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_33' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_34) == 0x00005A, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_34' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_35) == 0x00005B, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_35' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_36) == 0x00005C, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_36' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_37) == 0x00005D, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_37' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_38) == 0x00005E, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_38' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_39) == 0x00005F, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_39' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_40) == 0x000060, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_40' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_41) == 0x000061, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_41' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_42) == 0x000062, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_42' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_43) == 0x000063, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_43' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_44) == 0x000064, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_44' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_int_Array_Index_Variable) == 0x000068, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_int_Array_Index_Variable_1) == 0x000074, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_int_Variable) == 0x000078, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_Event_IsDesignTime) == 0x000080, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_CustomEvent_Value) == 0x000088, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Array_Get_Item) == 0x000098, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Less_ByteByte_ReturnValue) == 0x0000A0, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Conv_ByteToText_ReturnValue) == 0x0000A8, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_SelectColor_ReturnValue) == 0x0000B8, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_Select_Default) == 0x0000C8, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_MakeStruct_SlateColor) == 0x0000D8, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_MakeArray_Array) == 0x0000F0, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_MakeArray_Array_1) == 0x000100, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_CustomEvent_Values) == 0x000118, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_CustomEvent_Values' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_CustomEvent_Type) == 0x000128, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_CustomEvent_Type' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_CustomEvent_State) == 0x000138, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_CustomEvent_Steps) == 0x00013C, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_CustomEvent_Steps' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_int_Loop_Counter_Variable_1) == 0x000144, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Less_IntInt_ReturnValue) == 0x000148, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000149, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00014A, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Less_IntInt_ReturnValue_1) == 0x00014B, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Add_IntInt_ReturnValue_2) == 0x00014C, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000150, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000151, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_Select_Default_1) == 0x000152, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_Select_Default_2) == 0x000153, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_Select_Default_3) == 0x000154, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_Select_Default_4) == 0x000155, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_Select_Default_5) == 0x000156, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000157, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_SwitchEnum_CmpSuccess) == 0x000158, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000160, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_SwitchEnum_CmpSuccess_1) == 0x000168, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Array_Get_Item_2) == 0x000169, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Array_Get_Item_3) == 0x00016A, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Array_Length_ReturnValue_1) == 0x00016C, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Less_ByteByte_ReturnValue_1) == 0x000170, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Less_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Less_IntInt_ReturnValue_2) == 0x000171, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Conv_ByteToText_ReturnValue_1) == 0x000178, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Conv_ByteToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_Select_Default_6) == 0x000188, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_Array_Get_Item_4) == 0x000198, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_MakeStruct_WidgetTransform) == 0x0001A0, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_PlayAnimation_ReturnValue) == 0x0001D8, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_struct_Variable) == 0x0001E0, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_AddChild_ReturnValue) == 0x0001F0, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_struct_Variable_1) == 0x0001F8, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_struct_Variable_2) == 0x000208, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_PlayAnimation_ReturnValue_1) == 0x000218, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, Temp_byte_Variable_45) == 0x000220, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::Temp_byte_Variable_45' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_Select_Default_7) == 0x000224, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_SelectColor_ReturnValue_1) == 0x000234, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, K2Node_MakeStruct_SlateColor_1) == 0x000244, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000258, "Member 'W_WeaponCase_UI_C_ExecuteUbergraph_W_WeaponCase_UI::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function W_WeaponCase_UI.W_WeaponCase_UI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_WeaponCase_UI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponCase_UI_C_PreConstruct) == 0x000001, "Wrong alignment on W_WeaponCase_UI_C_PreConstruct");
static_assert(sizeof(W_WeaponCase_UI_C_PreConstruct) == 0x000001, "Wrong size on W_WeaponCase_UI_C_PreConstruct");
static_assert(offsetof(W_WeaponCase_UI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_WeaponCase_UI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_WeaponCase_UI.W_WeaponCase_UI_C.Update Process
// 0x0010 (0x0010 - 0x0000)
struct W_WeaponCase_UI_C_Update_Process final
{
public:
	TArray<uint8>                                 Value;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_WeaponCase_UI_C_Update_Process) == 0x000008, "Wrong alignment on W_WeaponCase_UI_C_Update_Process");
static_assert(sizeof(W_WeaponCase_UI_C_Update_Process) == 0x000010, "Wrong size on W_WeaponCase_UI_C_Update_Process");
static_assert(offsetof(W_WeaponCase_UI_C_Update_Process, Value) == 0x000000, "Member 'W_WeaponCase_UI_C_Update_Process::Value' has a wrong offset!");

// Function W_WeaponCase_UI.W_WeaponCase_UI_C.Update Result
// 0x0030 (0x0030 - 0x0000)
struct W_WeaponCase_UI_C_Update_Result final
{
public:
	TArray<uint8>                                 Values;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<E_NumType>                             Type;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	E_NumPassState                                State;                                             // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_WeaponCase_Step                   Steps;                                             // 0x0024(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponCase_UI_C_Update_Result) == 0x000008, "Wrong alignment on W_WeaponCase_UI_C_Update_Result");
static_assert(sizeof(W_WeaponCase_UI_C_Update_Result) == 0x000030, "Wrong size on W_WeaponCase_UI_C_Update_Result");
static_assert(offsetof(W_WeaponCase_UI_C_Update_Result, Values) == 0x000000, "Member 'W_WeaponCase_UI_C_Update_Result::Values' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_Update_Result, Type) == 0x000010, "Member 'W_WeaponCase_UI_C_Update_Result::Type' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_Update_Result, State) == 0x000020, "Member 'W_WeaponCase_UI_C_Update_Result::State' has a wrong offset!");
static_assert(offsetof(W_WeaponCase_UI_C_Update_Result, Steps) == 0x000024, "Member 'W_WeaponCase_UI_C_Update_Result::Steps' has a wrong offset!");

}

