#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponParameter

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_WeaponParameter.W_WeaponParameter_C.Set Value
// 0x0010 (0x0010 - 0x0000)
struct W_WeaponParameter_C_Set_Value final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_NewValue_ImplicitCast;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponParameter_C_Set_Value) == 0x000008, "Wrong alignment on W_WeaponParameter_C_Set_Value");
static_assert(sizeof(W_WeaponParameter_C_Set_Value) == 0x000010, "Wrong size on W_WeaponParameter_C_Set_Value");
static_assert(offsetof(W_WeaponParameter_C_Set_Value, Value) == 0x000000, "Member 'W_WeaponParameter_C_Set_Value::Value' has a wrong offset!");
static_assert(offsetof(W_WeaponParameter_C_Set_Value, CallFunc_SetValue_NewValue_ImplicitCast) == 0x000008, "Member 'W_WeaponParameter_C_Set_Value::CallFunc_SetValue_NewValue_ImplicitCast' has a wrong offset!");

// Function W_WeaponParameter.W_WeaponParameter_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_WeaponParameter_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponParameter_C_PreConstruct) == 0x000001, "Wrong alignment on W_WeaponParameter_C_PreConstruct");
static_assert(sizeof(W_WeaponParameter_C_PreConstruct) == 0x000001, "Wrong size on W_WeaponParameter_C_PreConstruct");
static_assert(offsetof(W_WeaponParameter_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_WeaponParameter_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_WeaponParameter.W_WeaponParameter_C.BndEvt__W_WeaponParameter_SpinBox_73_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_WeaponParameter_C_BndEvt__W_WeaponParameter_SpinBox_73_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponParameter_C_BndEvt__W_WeaponParameter_SpinBox_73_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on W_WeaponParameter_C_BndEvt__W_WeaponParameter_SpinBox_73_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(W_WeaponParameter_C_BndEvt__W_WeaponParameter_SpinBox_73_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on W_WeaponParameter_C_BndEvt__W_WeaponParameter_SpinBox_73_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(W_WeaponParameter_C_BndEvt__W_WeaponParameter_SpinBox_73_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'W_WeaponParameter_C_BndEvt__W_WeaponParameter_SpinBox_73_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function W_WeaponParameter.W_WeaponParameter_C.ExecuteUbergraph_W_WeaponParameter
// 0x0030 (0x0030 - 0x0000)
struct W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter) == 0x000008, "Wrong alignment on W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter");
static_assert(sizeof(W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter) == 0x000030, "Wrong size on W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter");
static_assert(offsetof(W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter, EntryPoint) == 0x000000, "Member 'W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter, K2Node_ComponentBoundEvent_InValue) == 0x000004, "Member 'W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter::K2Node_ComponentBoundEvent_InValue' has a wrong offset!");
static_assert(offsetof(W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter, CallFunc_Round_ReturnValue) == 0x000008, "Member 'W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter, CallFunc_SelectInt_ReturnValue) == 0x000010, "Member 'W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter, CallFunc_Round_A_ImplicitCast) == 0x000028, "Member 'W_WeaponParameter_C_ExecuteUbergraph_W_WeaponParameter::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

}

