#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponCase_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "E_NumType_structs.hpp"
#include "E_NumPassState_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WeaponCase_UI.W_WeaponCase_UI_C
// 0x00F8 (0x03C8 - 0x02D0)
class UW_WeaponCase_UI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MoveWait;                                          // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MoveCode;                                          // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BlackScreen;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_98;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Wait;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FailedText;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxStep;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Process;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Process_1;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Process_2;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Process_3;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Process_4;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Result;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Result_1;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Result_2;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Result_3;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Result_4;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_locked;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_open;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_opening;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_wait;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValidText;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Wait_jauge;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Partner_Room;                                      // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Underscore;                                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     Process_Textes;                                    // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UTextBlock*>                     Result_Textes;                                     // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_W_WeaponCase_UI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update_Process(const TArray<uint8>& Value);
	void Update_Result(const TArray<uint8>& Values, const TArray<E_NumType>& Type, E_NumPassState State, const struct FStr_WeaponCase_Step& Steps);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_WeaponCase_UI_C">();
	}
	static class UW_WeaponCase_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_WeaponCase_UI_C>();
	}
};
static_assert(alignof(UW_WeaponCase_UI_C) == 0x000008, "Wrong alignment on UW_WeaponCase_UI_C");
static_assert(sizeof(UW_WeaponCase_UI_C) == 0x0003C8, "Wrong size on UW_WeaponCase_UI_C");
static_assert(offsetof(UW_WeaponCase_UI_C, UberGraphFrame) == 0x0002D0, "Member 'UW_WeaponCase_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, MoveWait) == 0x0002D8, "Member 'UW_WeaponCase_UI_C::MoveWait' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, MoveCode) == 0x0002E0, "Member 'UW_WeaponCase_UI_C::MoveCode' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, BlackScreen) == 0x0002E8, "Member 'UW_WeaponCase_UI_C::BlackScreen' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Border_98) == 0x0002F0, "Member 'UW_WeaponCase_UI_C::Border_98' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Border_Wait) == 0x0002F8, "Member 'UW_WeaponCase_UI_C::Border_Wait' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, FailedText) == 0x000300, "Member 'UW_WeaponCase_UI_C::FailedText' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, HBoxStep) == 0x000308, "Member 'UW_WeaponCase_UI_C::HBoxStep' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Process) == 0x000310, "Member 'UW_WeaponCase_UI_C::Process' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Process_1) == 0x000318, "Member 'UW_WeaponCase_UI_C::Process_1' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Process_2) == 0x000320, "Member 'UW_WeaponCase_UI_C::Process_2' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Process_3) == 0x000328, "Member 'UW_WeaponCase_UI_C::Process_3' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Process_4) == 0x000330, "Member 'UW_WeaponCase_UI_C::Process_4' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Result) == 0x000338, "Member 'UW_WeaponCase_UI_C::Result' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Result_1) == 0x000340, "Member 'UW_WeaponCase_UI_C::Result_1' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Result_2) == 0x000348, "Member 'UW_WeaponCase_UI_C::Result_2' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Result_3) == 0x000350, "Member 'UW_WeaponCase_UI_C::Result_3' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Result_4) == 0x000358, "Member 'UW_WeaponCase_UI_C::Result_4' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Switcher) == 0x000360, "Member 'UW_WeaponCase_UI_C::Switcher' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Txt_locked) == 0x000368, "Member 'UW_WeaponCase_UI_C::Txt_locked' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Txt_open) == 0x000370, "Member 'UW_WeaponCase_UI_C::Txt_open' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Txt_opening) == 0x000378, "Member 'UW_WeaponCase_UI_C::Txt_opening' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Txt_wait) == 0x000380, "Member 'UW_WeaponCase_UI_C::Txt_wait' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, ValidText) == 0x000388, "Member 'UW_WeaponCase_UI_C::ValidText' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Wait_jauge) == 0x000390, "Member 'UW_WeaponCase_UI_C::Wait_jauge' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Partner_Room) == 0x000398, "Member 'UW_WeaponCase_UI_C::Partner_Room' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Underscore) == 0x0003A0, "Member 'UW_WeaponCase_UI_C::Underscore' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Process_Textes) == 0x0003A8, "Member 'UW_WeaponCase_UI_C::Process_Textes' has a wrong offset!");
static_assert(offsetof(UW_WeaponCase_UI_C, Result_Textes) == 0x0003B8, "Member 'UW_WeaponCase_UI_C::Result_Textes' has a wrong offset!");

}

