#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WaterCamera.WaterCamera_C
// 0x0020 (0x02C8 - 0x02A8)
class AWaterCamera_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPlanarReflectionComponent*             PlanarReflection;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AMec_C*                                 Mec_Ref;                                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WaterCamera(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WaterCamera_C">();
	}
	static class AWaterCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterCamera_C>();
	}
};
static_assert(alignof(AWaterCamera_C) == 0x000008, "Wrong alignment on AWaterCamera_C");
static_assert(sizeof(AWaterCamera_C) == 0x0002C8, "Wrong size on AWaterCamera_C");
static_assert(offsetof(AWaterCamera_C, UberGraphFrame) == 0x0002A8, "Member 'AWaterCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWaterCamera_C, PlanarReflection) == 0x0002B0, "Member 'AWaterCamera_C::PlanarReflection' has a wrong offset!");
static_assert(offsetof(AWaterCamera_C, DefaultSceneRoot) == 0x0002B8, "Member 'AWaterCamera_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AWaterCamera_C, Mec_Ref) == 0x0002C0, "Member 'AWaterCamera_C::Mec_Ref' has a wrong offset!");

}

